[{"version":{"major":0,"minor":13,"patch":19,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":1,"day":5},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed automatic numbering of lists doesn't stop at the end of the list and accidentally changes the numbers of lists further down the document.</li>\n<li>Fixed sometimes undo/redo combines multiple consecutive operations like typing and pasting into a single change.</li>\n<li>Fixed when redoing a change, the cursor would be put in the wrong spot afterwards.</li>\n<li>Fixed sometimes bad HTML causes Live Preview to crash with an error.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":1,"day":2},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved fold indicators in new editor. They will now appear closer to the line's text rather than all the way at the left edge.</li>\n<li>New hotkeys for in document search: &quot;Search All&quot; (<code>Alt+Enter</code>) and &quot;Replace All&quot; (<code>Ctrl/Cmd+Alt+Enter</code>).</li>\n<li>In Live Preview, you can now click a code block's language flair (top right) to copy the code block.</li>\n<li>New editor's vim mode now experimentally supports search highlighting and multiple cursors.</li>\n<li>You can now use <code>Ctrl/Cmd+Shift+Enter</code> in quick switcher to create a new note and open it in a new pane.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the fold all command sometimes not working.</li>\n<li>Fixed <code>Shift+Up/Down</code> in Live Preview doesn't select hidden blocks properly.</li>\n<li>Fixed backlink and unlinked reference count indicator not properly updated when a link is removed.</li>\n<li>Fixed middle click and <code>Ctrl/Cmd+Click</code> embedded note's &quot;open link&quot; button in Live Preview causes weird behavior.</li>\n<li>Fixed middle click links, file explorer items, and search results stopped working.</li>\n<li>Fixed unable to click external links with formatting styles like bold or italics in editing view.</li>\n<li>Fixed sometimes the bullet dot renders as weird letters.</li>\n<li>Fixed console error when OS language doesn't support spellchecker.</li>\n<li>Word count now properly count contractions as one word.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added <code>.cm-active</code> to gutter elements as well.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":17,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":29},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved list bullet rendering to avoid jumping in Live Preview.</li>\n<li>Improved behavior when pressing <code>Enter</code> in lists and blockquotes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed new editor's spellchecker dictionary options not working.</li>\n<li>Fixed two consecutive footnote references causes any text in between to be underlined.</li>\n<li>Fixed unable to type <code>&lt;</code> and <code>&gt;</code> in Hungarian keyboard layout on mac.</li>\n<li>Removed emacsy toggle for mac in new editor.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Heads up to theme developers: the <code>.list-bullet</code> CSS has been reworked. It will now keep the original character and superimpose the dot using the <code>:after</code> pseudo-element.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":24},"info":"<h2>Improvements</h2>\n<ul>\n<li>Switching between files will now keep the undo/redo history for the last 20 files, unless the file was changed externally. Not available for the legacy editor.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed readable line length not properly applied when line wrapping is turned on.</li>\n<li>Search will now properly unfold folded areas when highlighting the match.</li>\n<li>Fixed wikilinks at the beginning of the line causes it to inherit styles from the previous line.</li>\n<li>Fixed a rare case of data loss due to race condition caused by clicking on a link and triggering the loading of the additional syntax highlighting library.</li>\n<li>Fixed gutter alignment for empty lines above headings.</li>\n<li>Fixed mermaid diagrams overflowing.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":15,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":23},"info":"<h2>Improvements</h2>\n<ul>\n<li>Edit mode now supports headings in lists.</li>\n<li>Embedded content generated by plugin custom handlers (like image in Admonitions and Dataview) are now rendered in both Live Preview and Reading view. This will be a temporary addition until we can come up with a proper Markdown rendering API that handles nestable rendering contexts better.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li><code>Ctrl/Cmd+C</code> now copies the whole line again if there is no selection.</li>\n<li>Fixed several parsing issues with formatting symbols in wikilinks.</li>\n<li>Fixed an issue where the <code>Tab Size</code> setting could change how indented lists are interpreted in edit view. This will now always recognize a tab character as 4 spaces, as required by Markdown's specifications.</li>\n<li>Fixed a crash when pressing up (or using <code>k</code> in vim mode) on a <code>---</code> separator that's out of screen.</li>\n<li>Fixed a crash that happens sometimes when pressing page up or page down (or the equivalent commands in vim mode).</li>\n<li>Fixed some plugins could cause line wrapping to fail and grow the width of the editor.</li>\n<li>Code blocks will now line wrap in reading view, to stay consistent with editing view.</li>\n<li>Fixed code block's language flair stopped showing up when indented in Live Preview.</li>\n<li>Fixed math blocks inside blockquotes and lists are rendered outside.</li>\n<li>Improved parsing of footnote references and definitions.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>getSectionInfo()</code> is now implemented for custom code blocks in Live Preview.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":14,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":12,"day":21},"info":"<h2>Improvements</h2>\n<ul>\n<li>When changing default edit mode between Live Preview and Source mode, the new setting will now be automatically applied to all panes.</li>\n<li>Fixed default edit mode, which will now use Live Preview when not using Legacy editor.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed Live Preview sometimes unable to drop at the end of the document.</li>\n<li>Fixed reading view clips out the first line of the document when in document search is active.</li>\n<li>Drag and drop external files from the file system now preserves file extension in the display text if creating an external link.</li>\n<li>Fixed some plugins CSS causes Live Preview's selections to break.</li>\n<li>Fixed when using in document search or clicking on a global search result, the search highlight is sometimes hidden due to Live Preview.</li>\n<li>Fixed using in document search and replace does not highlight the next match when replacing.</li>\n<li>Fixed sometimes selecting multi-line text results in a weirdly rendered selection box.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":17},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed line wrapping not working with panes smaller than 700px.</li>\n<li>Fixed unresolved links in Live Preview not taking into account link aliases.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":17},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a new Core plugin called &quot;Editor status&quot; which adds a status bar item showing you the current editor mode. You can also use it to toggle the editor mode.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Internal links to non-existent files will now look dimmer than regular links.</li>\n<li>Fixed drop cursor is invisible in dark mode, also fixed drop cursor doesn't position correctly when document is scrolled.</li>\n<li>Fixed IME on MacOS sometimes causes duplicate characters to be entered.</li>\n<li>Fixed vim mode <code>g</code>  related keys causes vim mode to crash until app is restarted.</li>\n<li>Middle click now opens internal links in new panes.</li>\n<li>Removed very faint background colors on external links.</li>\n<li>Fixed pressing <code>Enter</code> on an indented line does not keep the indent properly.</li>\n<li>Fixed long tables broken again due to an engine upgrade.</li>\n<li>Fixed tables has a weird extra spacing after the last <code>|</code> character.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Word count will now no longer re-calculate on every change, but instead re-compute at most twice every second, to spare some CPU time.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The <code>changed</code> event on MetadataCache now contains the file contents as well as the parsed metadata object.</li>\n<li>There is now two helper functions for <code>HTMLElement</code>: <code>isShown()</code> which tells you whether this element is shown, and <code>onNodeInserted</code> which can add a callback for when the element is shown. These statuses depend on the element to be attached to the DOM and require not having any parent or ancestor with the css <code>display: none</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added basic RTL (right-to-left) text support. The option can be found in Settings &gt; Editor.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Fixed pasting from websites causes duplicate text to be inserted.</li>\n<li>Fixed sometimes the list bullet, or the checkbox shows up duplicated when selecting text.</li>\n<li>Improved the onboarding modal for selecting whether to use legacy editor or live preview.</li>\n<li>Relaunching after changing the legacy editor option now properly saves the option value, without having to wait for one second.</li>\n<li>When switching out of legacy editor, all edit panes will automatically use the default edit mode, rather than always staying in source mode.</li>\n<li>Fixed some actions like indenting and unindenting sometimes moves the cursor to unintended spots.</li>\n<li>Fixed an issue where selections look really bad if the first line of the document has a list.</li>\n<li>Internal links that start with <code>#</code> for heading sections will now hide the <code>#</code> when not selected to avoid confusion with tags.</li>\n<li>Fixed vim mode scrolling commands like <code>zz</code>, <code>zt</code> and <code>zb</code>.</li>\n<li>Fixed blocks like embeds and custom code blocks aren't properly included in the fold if they're at the end of the fold section.</li>\n<li>Fixed re-focusing on the editor sometimes causes the selection to jump to the beginning of the file.</li>\n<li>Improved inline footnotes parsing.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed tooltips wrap text in awkward spots.</li>\n<li>Fixed outgoing links unlinked mentions cuts off items that has a dot in the file name.</li>\n<li>Fixed changing image alt text does not update in reading view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":13},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Restored legacy editor to be default for now.</li>\n<li>Fixed gutter elements (line numbers and fold indicators) misalignment.</li>\n<li>Fixed Live Preview sometimes run into situations where it stops being parsed and highlighted halfway down the document.</li>\n<li>Fixed drag and drop text duplicates instead of moves selected text.</li>\n<li>Fixed several operations such as pasting, undo/redo, drag and drop, etc, causes duplicate characters or phrases to linger in the document.</li>\n<li>Fixed <code>Ctrl/Cmd+Shift+Z</code> stopped working for undo.</li>\n<li>Fixed full line embeds has an extra line after it.</li>\n<li>Improved external images rendering when on its own line.</li>\n<li>Empty headings will now keep the <code>#</code> characters in view to help see that it's an empty heading.</li>\n<li>Inline LaTeX will no longer be accidentally recognized when the ending sign is followed by a digit like <code>$10</code>.</li>\n<li>Fixed several commands that sometimes mis-position the selection after the command executes.</li>\n<li>Spellchecking is now properly applied to wiki links.</li>\n<li>Fixed some themes and plugins accidentally introduces margins, causing editor selections to misbehave.</li>\n<li>Fixed vim mode jumps by two lines sometimes.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Reverted editing/reading icon state. We will try to improve this in a future version.</li>\n<li>Improved Markdown formatting commands like bold and italics detection when selecting the outside layer.</li>\n<li>Markdown formatting commands now ignores whitespace characters at the beginning or ending of the selection when being applied.</li>\n<li>Backlink in document can now be turned on by default in the settings page of the core plugin &quot;Backlinks&quot;.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Sync now has a bulk restore functionality for deleted files.</li>\n<li>&quot;Preview mode&quot; has been renamed to &quot;Reading view&quot; to avoid confusion.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Live Preview is now enabled by default. To switch to the old CodeMirror 5 based editor, toggle the &quot;Legacy Editor&quot; option.</li>\n<li>You can now set the default editing mode to Live Preview or Source Mode.</li>\n<li>Vim mode is now available for both Live Preview and Source mode.</li>\n<li>Completed task lists are now crossed out and greyed out to match reading view.</li>\n<li>Improved handling of up/down arrow keys interacting with blocks like embeds and code blocks.</li>\n<li>Improved selection when clicking on previewed blocks.</li>\n<li>Improved selection when selecting across hidden Markdown formatting syntax.</li>\n<li>Fixed drag and drop does not show caret where the drop will occur, and also sometimes inserts garbage content when dragging within the editor.</li>\n<li>Improved detection of inline HTML blocks.</li>\n<li>Improved blockquote handling.</li>\n<li>Fixed deleting auto-matched brackets like  <code>[</code> with backspace not deleting the closing counterpart <code>]</code>.</li>\n<li>Fixed HTML comments could cause a crash in the editor parser.</li>\n<li>Fixed clicking or selecting the end of the file selects to the beginning when there is a block at the end.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed code block has an extra indent on the first line in reading view.</li>\n<li>Quick Switcher will now create new files relative to the file of the current active pane when new file option is set to be relative to current file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Breaking change: the <code>data-task</code> css class has been moved to the line element, rather than being on each piece of <code>&lt;span&gt;</code>.</li>\n<li>The API for CodeMirror 6 has now been opened up. To deeply integrate with CodeMirror 6, you will be required to write an <code>Extension</code> to augment the editor. More details and tutorials will be available later.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":3},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Spell checker languages can now be changed on Windows and Linux. On MacOS, the system native spell checker is used, which automatically detects the language.</li>\n<li>Spell checker will now skip over things that shouldn't be spell checked, such as code blocks, links, and math blocks.</li>\n<li>Improved code block syntax highlighting colors.</li>\n<li>Fixed fold all command not folding inner folds.</li>\n<li>Fixed heading folds does not load sometimes, causing the fold state to be lost.</li>\n<li>Fixed frontmatter not foldable.</li>\n<li>Fixed image links with titles. Fixed links surrounded by <code>&lt;&gt;</code> not linking properly.</li>\n<li>Improved bottom padding handling when backlink in document is enabled.</li>\n<li>Fixed editor suggestions continue to show up after switching documents.</li>\n<li>Fixed indent soft-wrapping mis-calculating tab sizes.</li>\n<li>Fixed bare links with <code>&lt;&gt;</code> disappears.</li>\n<li>Fixed rendered code blocks could overflow the editor.</li>\n<li>Fixed characters past the line wrapping threshold not selectable using the mouse, happens with long tables, or with line wrapping disabled.</li>\n<li>Internal links rendered by plugins are now handled within rendered code blocks.</li>\n<li>Improved handling of list bullet when the cursor is at the beginning of the line.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Global search panes will no longer continuously run in the background when the pane is not in view.</li>\n<li>Fixed overflowing tooltips.</li>\n<li>Fixed drag and drop internal links on Windows looks weird.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":25},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Inline LaTeX is now supported and rendered.</li>\n<li>HTML blocks, including iframes are now rendered.</li>\n<li>Added <code>data-task</code> for all tokens on a list item with checkbox to facilitate css styling.</li>\n<li>Improved gutter alignment for fold icon and line numbers.</li>\n<li>Added code syntax highlighting for source mode and live preview (including legacy editor).</li>\n<li>Improved code block styling when cursor isn't active.</li>\n<li>Implemented <code>Ctrl/Cmd+Click</code> on Markdown links.</li>\n<li>Fixed Markdown links with &quot;title&quot; not working correctly.</li>\n<li>Removed hard-coded <code>Ctrl/Cmd+G</code> search hotkey.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Fixed legacy editor not properly scrolled to the top when switching document.</li>\n<li>Improved handling of custom panes when plugins are no longer installed.</li>\n<li>There is now a &quot;Copy share link&quot; in the community plugin's information page.</li>\n<li>Leftover panes from disabled plugins will no longer be automatically closed. They will now show up as an un-recognized pane, and if the plugin is re-enabled, they will work again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":22},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now use drag and drop to re-arrange heading sections from the Outline pane.</li>\n<li>You can also drop an outline item into the editor to generate a heading link.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Folding state is now properly saved.</li>\n<li>Fixed embed, image, or code blocks related page reflows making selection and interactions stop working.</li>\n<li>Fixed sometimes the page becomes plaintext with no highlights halfway.</li>\n<li>Fixed switching document does not scroll back to the top.</li>\n<li>Fixed document keeps scrolling up when selecting the last few lines.</li>\n<li>Fixed clicking on search results from global search, backlinks and outline pane not properly highlighting the matching location.</li>\n<li>Removed hardcoded editor folding hotkeys.</li>\n<li>Fixed unable to extract heading on macOS due to context menu also selecting word.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed clicking on an external link freezes the app for engine versions using Electron 12.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":19},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Fixed mouse drag selection jumpiness.</li>\n<li>Improved IME handling.</li>\n<li>Fixed link aliases broken.</li>\n<li>Fixed rendered images still showing link.</li>\n<li>Fixed dynamically resized blocks such as <code>query</code> causes selection to stop working after they resize.</li>\n<li>Fixed indentation width not updating when swapping CSS themes.</li>\n<li>Fixed block quotes always have background and border in source mode.</li>\n<li>Fixed external <code>file:///</code> images not working.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Plugin and theme download counts now have thousands separators.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":19},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Backlink in document is now available for Live preview, which can be toggled in the pane menu.</li>\n<li>Mermaid and query blocks are now rendered.</li>\n<li>Some custom code blocks from plugins are now rendered.</li>\n<li>Implemented auto-pairing of brackets for Markdown formatting symbols such as <code>$</code>, <code>=</code>, <code>~</code> and <code>%</code>.</li>\n<li>Improved handling of block quotes.</li>\n<li>Improved image size handling.</li>\n<li>Improved Markdown link styling.</li>\n<li>Fixed image alt text not live updated.</li>\n<li>Fixed empty lines in code blocks.</li>\n<li>Fixed <code>Option+ArrowUp/Down</code> keys on MacOS not performing native cursor functions.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Added <code>show-plugin</code> Obsidian URI action. Example: <code>obsidian://show-plugin?id=admonition</code></li>\n<li>Added notice for indexing large files taking too long to help debug indexing stuck issues.</li>\n<li>Obsidian now live-reloads the app and appearance options when the configuration files are changed on disk, to avoid issues with sync solutions overwriting each other with older versions.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed some syntax not highlighting for code blocks in preview mode while in dark mode.</li>\n<li>Preview should now render reference style Markdown links and images correctly.</li>\n<li>Obsidian Sync should no longer sync dot files and dot folders within plugin folders when community plugin sync is turned on.</li>\n<li>Fixed legacy editor's replace all function.</li>\n<li>Fixed adapter rename fail to work for dot files.</li>\n<li>Fixed copy from preview mode sometimes doesn't copy all the text.</li>\n<li>Fixed toggle strikethrough always adds more <code>~~</code> instead of removing.</li>\n<li>Pressing <code>Enter</code> when in an empty nested block quote will now only exit one level of block quote.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":11,"day":12},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Added <code>list-bullet</code> css class for theme styling.</li>\n<li>Fixed multiple cursors were added with <code>Ctrl/Cmd+Click</code> rather than <code>Alt+Click</code>.</li>\n<li>Fixed mermaid not rendering properly in preview.</li>\n<li>Improved block LaTeX rendering, fixed consecutive blocks not rendering.</li>\n<li>Fixed last line of document can't be selected when LaTeX blocks are in the document.</li>\n<li>External link icon should no longer be shown for embedded images.</li>\n<li>Fixed having a URL in image alt text breaks parsing.</li>\n<li>Fixed barelinks in footnotes disappears.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":11},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Separators (<code>---</code>) are now implemented.</li>\n<li>Headings will now always show the <code>#</code> characters when the cursor is on that line.</li>\n<li>Fixed wikilink embeds not working with aliases or sizes using the <code>|</code> character.</li>\n<li>Fixed embedded documents not live updated.</li>\n<li>Implemented embeds using Markdown embed syntax.</li>\n<li>Improved visuals of list items by replacing list bullet character with a dot.</li>\n<li>Checklists now have their list bullet hidden.</li>\n<li>Fixed two wikilinks with alias on the same line causes the first one to disappear.</li>\n<li>Fixed empty wikilinks disappears.</li>\n<li>Added external link icon.</li>\n<li>Checkbox now has a <code>data-task</code> attribute added.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The insider build toggle in Settings &gt; About is now back.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Live Preview (also known as &quot;WYSIWYG&quot; mode) is now available for insider testing.\n<ul>\n<li>To enable it, go to <code>Settings &gt; Editor &gt; Experimental Live Preview</code>. Changing this option requires a restart to take effect.</li>\n<li><strong>The live preview mode is highly experimental and many bugs are expected. Please report bugs in the Discord server under the <code>insider-desktop</code> channel.</strong></li>\n<li>Once you turn on this option, there is a command to toggle source mode as well as a pane menu option.</li>\n<li>Current features\n<ul>\n<li>Hide Markdown formatting syntax.</li>\n<li>Embedded notes, images, audio, video, PDFs and notes using the wikilink syntax will show a preview in the editor.</li>\n<li>Embedded images using the Markdown syntax from external sources will show previewed.</li>\n<li>Block (<code>$$</code>) LaTeX will show a preview. Inline LaTeX will be implemented in a future release.</li>\n<li>Checklists will be replaced with a checkbox. Clicking on it will toggle the check status.</li>\n</ul>\n</li>\n<li><strong>Not implemented yet and coming soon</strong>\n<ul>\n<li>Embeds using Markdown link syntax.</li>\n<li>Inline LaTeX.</li>\n<li>HTML blocks.</li>\n<li>Custom code blocks (including plugin rendered blocks like Admonition and Dataview).</li>\n<li>Improved list bullets (and hide bullet with checklists).</li>\n<li>Tables.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Added <code>webp</code> image support.</li>\n<li>Obsidian Sync\n<ul>\n<li>The remote vault selection dialog has been reworked to prevent accidentally connecting to a different remote vault, causing unintentional vault merges.</li>\n<li>A warning has also been added to confirm the merging of local and remote vaults when the local vault already contains files.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Copy code block button now also shows up on code blocks without a language.</li>\n<li>Fixed tabs becoming spaces within code blocks in preview mode.</li>\n<li>Fixed tab size not respected in preview mode.</li>\n<li>Fixed right clicking on search result matches not working.</li>\n<li>Fixed backlink in preview mode not updated when switching to an empty note.</li>\n<li>Fixed embeds in exported PDF documents not showing page title.</li>\n<li>Fixed code blocks in exported PDF documents sometimes contain duplicate characters when copied to clipboard when using Obsidian's dark mode.</li>\n<li>Fixed code blocks in exported PDF not wrapping.</li>\n<li>Fixed app zoom hotkeys stops working after opening a PDF document.</li>\n<li>Changing font size will no longer cause the cursor in the editor to behave erratically.</li>\n<li>Fixed navigating to headings, block IDs, and search results sometimes not scrolling down properly.</li>\n<li>Fixed navigating in local graph sometimes causes the navigation history to skip over a file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now an <code>append</code> function for both the <code>Vault</code> and the <code>Adapter</code> APIs.</li>\n<li>There is now a function to sanitize HTML called <code>sanitizeHTMLToDom</code> which returns a <code>DocumentFragment</code> of the sanitized HTML content.</li>\n<li>You can now <code>setInstructions</code> for an <code>EditorSuggest</code>.</li>\n<li>There is now a <code>wordAt</code> function on the <code>Editor</code> interface.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":5,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2021,"month":11,"day":8},"info":"<h2>Core update</h2>\n<p>Includes all new functionality and bug fixes up to Obsidian Desktop v0.12.19</p>\n<ul>\n<li>Improved graph view animations.</li>\n<li>Heading rename.</li>\n<li>New theme store.</li>\n<li>Slash commands.</li>\n<li>New plugin APIs now available for the latest plugins to use.</li>\n<li>Tons of bug fixes.</li>\n</ul>\n<p><strong>Editor</strong></p>\n<ul>\n<li>There are now new commands for copying, pasting, and opening the context menu, which can be assigned to the toolbar or the pull down menu for convenience.</li>\n<li>Upgraded CodeMirror 6 which should come with many bug fixes and performance improvements.</li>\n<li>Copy and paste is now handled just like the desktop app.</li>\n</ul>\n<p><strong>Obsidian Sync</strong></p>\n<ul>\n<li>Fixed version history page not showing size and device info.</li>\n<li>Restoring files using version history will no longer error out with &quot;This version is already the latest version&quot;.</li>\n</ul>\n<h2>Android</h2>\n<ul>\n<li><strong>If you're using Android 11+, you will be prompted for the new file access permission.</strong> This is unfortunately required by the latest Play Store policy.</li>\n<li>Android vaults should no longer show duplicates if you've selected a vault in <code>Documents/Obsidian</code>.</li>\n<li>Renaming a vault on Android should no longer cause it to disappear from the list.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>The iOS app will now wait for iCloud to sync back configuration files before opening the vault to prevent load failures. This fixes the &quot;plugin failed to load&quot; popups that happens sometimes.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":19,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":10,"day":15},"info":"<h2>Improvements</h2>\n<ul>\n<li>Rename heading now has a command in addition to the previous context menu action.</li>\n<li>Improved theme statistic handling.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed editor suggestions for links and tags sometimes not working due to a race condition.</li>\n<li>Fixed current theme delete button sometimes shows in the next line.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":10,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed link suggestions sometimes disappears with large vault.</li>\n<li>Fixed heading rename doesn't work if there was no link to the heading.</li>\n<li>Fixed empty sidebar does not save collapsed state properly.</li>\n<li>Fixed theme manager sometimes showing no theme installed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":17,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":10,"day":6},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The theme store has received a massive upgrade! The interface has been completely revamped, now with download counts, sorting options, and a button to update each theme.</li>\n<li>There is now a new core plugin called &quot;Slash commands&quot;. Activating it will allow you to type <code>/</code> while editing to trigger any command.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Updated CodeMirror 5 with several bug fixes.</li>\n<li>Updated Mermaid.js with several bug fixes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Removed hardcoded navigation shortcuts <code>Alt+Left/Right</code>.</li>\n<li>Fixed large pages with multiple queries causes some queries to stop working.</li>\n<li>Fixed some search operators when used in combination causes wrong results.</li>\n<li>Fixed rare case of workspace leaving an empty space in the sidebar that can't be closed.</li>\n<li>Fixed sync's setting history modal has the incorrect title of &quot;deleted files&quot;.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Command palette now renders the plugin name and command name in separate elements to facilitate CSS styling.</li>\n<li>Plugins that crash after <code>onLayoutReady</code> will now show a message to help debug.</li>\n<li>New <code>EditorSuggest</code> is now accessible to the API to provide in-line suggestions, like auto-complete. This is what powers the link auto-complete, tag auto-complete, and slash commands.</li>\n<li><code>Keymap</code> has now been exposed with <code>isModEvent</code> to help check if the user is holding <code>Ctrl/Cmd</code> or pressing the middle mouse button. This is used as a convention to &quot;open in new pane&quot;.</li>\n<li>There are now 3 new workspace events:\n<ul>\n<li><code>editor-change</code> fired when an editor has received changes. This event happens fairly frequently so please be mindful of performance when using it.</li>\n<li><code>editor-paste</code> fired before the editor handles a paste event. If you handle the paste event, you should call <code>evt.preventDefault()</code> to let the next handler know that it's been handled.</li>\n<li><code>editor-drop</code> fired before the editor receives a drop event. Works the same was as the paste event.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":9,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added a command to undo closed panes. Default hotkey is <code>Ctrl/Cmd+Shift+T</code>.</li>\n<li>Added copy code block button in preview mode.</li>\n<li>There is now a tooltip when hovering links that has a different display text (or alias).</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Empty panes will be removed on startup if the plugin that created it has been uninstalled or disabled.</li>\n<li><code>{{date}}</code> and <code>{{time}}</code> will now work in daily notes and zettelkasten prefixer. Previously you needed to add the format <code>{{date:format}}</code></li>\n<li>Creating new files from in note composer will now show an error if it contains illegal characters.</li>\n<li>You can now use <code>Ctrl/Cmd</code>+click or middle-click the icon or the command palette item to open daily note/new zettelkasten in a new pane.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed clicking on external links in hover previews not working.</li>\n<li>Fixed creating new files/renaming files not registered in recent files.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now access to the following bundled libraries: PDF.js, Mermaid, Prism, MathJax. Each library does things a bit differently but we now expose functions to load them if they weren't loaded already: <code>loadPdfJs</code>, <code>loadMermaid</code>, <code>loadPrism</code>, <code>loadMathJax</code>.</li>\n<li><code>request</code> can now set HTTP headers.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":8,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now select text and right click to search for it globally.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed rename heading not working when using links from the same document.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":8,"day":23},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added rename heading utility in editor context menu, which will rename the heading and update links.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Note composer's &quot;extract heading&quot; function now has a command and can be assigned to a hotkey.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Removed timelapse button from local graph.</li>\n<li>Fixed Enter key for CJK input methods in several places when confirming a selection.</li>\n<li>Note composer will no longer accidentally create files with leading or trailing empty spaces.</li>\n<li>Fixed Obsidian Publish upload interface unable to check and uncheck folders when collapsed.</li>\n<li>Fixed can't check for updates when auto-update is turned off.</li>\n<li>Fixed undo pasting also undoes the previous characters typed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":8,"day":3},"info":"<h2>Improvements</h2>\n<ul>\n<li>Graph view timelapse animation improvements:\n<ul>\n<li>The animation now animates according to the note's creation date to generate a true &quot;time&quot; lapse.</li>\n<li>The graph will now start empty and fill in gradually, without the need to hide orphan notes.</li>\n<li>The timelapse feature is now more accessible. You can find the new button in the &quot;Display&quot; section, or click the magic wand when the settings panel is closed.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed deleting a file that is currently open sometimes causes the file to come back.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":4,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":7,"day":29},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.9.</li>\n<li>Added a way to pin sidebars for tablet mode.</li>\n<li>You can now click on an image in preview mode to see it full screen, and zoom in.</li>\n<li>The &quot;Open in default app&quot; menu option has been reworded to &quot;Share&quot; to avoid confusion.</li>\n<li>Sidebar settings, such as which panes are open and which one is active, are now properly saved.</li>\n<li>Plugins that are marked &quot;desktop only&quot; will no longer attempt to run on mobile.</li>\n<li>Fixed padding above frontmatter section.</li>\n<li>Vault stats and note stats should now stay up-to-date.</li>\n<li>Obsidian Sync now has improved handling of illegal characters on Android.</li>\n<li>Fixed <code>Shift+Option+Up/Down</code> duplicating line instead of selecting up/down.</li>\n<li><code>Alt+B/F/D</code> now properly inputs text on iOS.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":12,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":7,"day":26},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now use the keyboard to navigate and select context menus.</li>\n<li>There is now a search bar to find core plugins better.</li>\n<li>Graph view will now highlight the current focused file in a different color. This can be configured through the css class <code>.graph-view.color-fill-focused</code>, or disabled if you set the color to <code>transparent</code>.</li>\n<li>There is now a YAML frontmatter flag for <code>publish:</code>. This flag affects the UI when uploading files to your publish site:\n<ul>\n<li>When publishing, the default behavior without this flag is to auto-select changed files, but not new files.</li>\n<li>If you set <code>publish: true</code>, then new files are auto-selected to publish.</li>\n<li>If you set <code>publish: false</code>, then we will pretend this file does not exist when publishing. This file will not show up in new/changed files. If this file was previously published, you will see an option to delete it instead.</li>\n</ul>\n</li>\n</ul>\n<h2>Breaking changes</h2>\n<ul>\n<li>The legacy <code>obsidian.css</code> has been deprecated and is no longer supported. If you were using it, you can migrate by moving it to <code>.obsidian/themes/</code> and rename it to your theme's name. Then, choose that theme in the Appearance &gt; Theme setting.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>For security reasons, there is now a confirmation box when clicking on links to non-standard URLs (any protocol that is not <code>http://</code> or <code>https://</code>). You can ask the app to not ask again on a per-protocol basis.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed graph view's hotkey/command not working.</li>\n<li>Fixed note composer not leaving empty lines when splitting a heading.</li>\n<li>Removing a local vault from the vault switcher will now properly clears any associated cache, as well as disassociate it from Obsidian Sync.</li>\n<li>Fixed tables that are longer than the pane's width previously couldn't be scrolled all the way to the right side.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":7,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Note composer now adds a context menu item to headings which lets you extract the heading as well as all of its child content to a different note.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now Ctrl/Cmd+Click the graph view ribbon icon to open it in a new pane.</li>\n<li>Upgraded MathJax to v3.2.0.</li>\n<li>Upgraded Prism.js to v1.24.1.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed deleting to trash sometimes doesn't work.</li>\n<li>Moving files to subfolders will no longer cause Markdown links to add the folder name to the display text.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The <code>Editor</code> interface now has a way to set multiple selections.</li>\n<li>There is now an API to perform HTTP requests without any CORS restrictions. The API is called <code>request()</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":4,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":7,"day":15},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.12.</li>\n<li>Improved startup speed for large vaults.</li>\n<li>Fixed Android app couldn't select locations in the external SD card.</li>\n<li>Fixed Android app crash or behave unexpectedly when file names contain <code>:</code>, <code>%</code> or <code>#</code> characters.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":3,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":7,"day":12},"info":"<ul>\n<li>Android: Fixed crash when files and folders contains <code>#</code> or <code>%</code> in their names.</li>\n<li>iOS: Obsidian will now properly create the iCloud folder on first boot up.</li>\n<li>iOS: Fixed minimum iOS requirement back down to iOS 12.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":2,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":7,"day":11},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.10.</li>\n<li>Fixed rare case sync error when synchronizing deleted community plugins.</li>\n<li>Fixed Android 10 &quot;path cannot be resolved&quot; error when selecting vaults in Documents folder.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":0,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2021,"month":7,"day":7},"info":"<ul>\n<li>This version is aimed for public release soon!</li>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.10.</li>\n<li>Most notably, you might need the configuration sync improvements for hotkeys.</li>\n<li>Graph view is now functional.\n<ul>\n<li>Pinch zoom has been implemented.</li>\n<li>Graph nodes can now be easily dragged around, or tapped on.</li>\n<li>Graph no longer crashes the second time it's opened.</li>\n</ul>\n</li>\n<li>On Android, you can now choose to open folders as vaults anywhere on your device.</li>\n<li>On Android, you can now share text, links, or attachment files like images and PDFs to Obsidian.\n<ul>\n<li>You can decide to insert the shared text into the current note, choose a note, or insert into your daily note.</li>\n<li>Shared attachment files will be imported into your vault's attachment folder, and after that you can choose to insert them as links into a note or your daily note.</li>\n</ul>\n</li>\n<li>Sharing for iOS will come in a later release.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":10,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":7,"day":7},"info":"<h2>Migration notice</h2>\n<ul>\n<li>Since hotkeys are now stored in a separate file, if you're using Obsidian on multiple devices you might notice that your hotkeys will disappear on non-upgraded Obsidian instances when using Obsidian Sync to sync your app config. To migrate, upgrade Obsidian and turn on the hotkeys sync flag to receive the hotkeys, then restart Obsidian.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync now allows you to view the version history of settings files through a button from the sync settings page.</li>\n<li>Hotkeys are now saved in its own <code>hotkeys.json</code> file to facilitate independent syncing of hotkeys from the rest of the app settings.</li>\n<li>Obsidian Sync now has an option to sync (or not sync) your hotkeys independently.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed applying fold multiple times causes the fold toggle to require many clicks to unfold.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Obsidian's config files will now be formatted json instead of all on one line.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":6,"day":30},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed settings don't get saved if they've been ever changed before the new format migration in v0.12.8.</li>\n<li>Fixed hotkeys don't get saved through a restart in some situations.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":6,"day":28},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Sync can now be used to synchronize your settings, appearance tweaks, custom CSS, and installed plugins.</li>\n<li>Obsidian Sync can now sync any file type using the &quot;Sync all other types&quot; option.</li>\n<li>Quick switcher now has configuration options to show or hide attachments and unsupported file types, in addition to the current option to show links to non-existent files.</li>\n<li>An option to open file in new pane has been added to file explorer's context menu.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Obsidian's config file has been split up into 4 different files. Previously, it was just <code>config</code>. Now it's <code>app.json</code>, <code>appearance.json</code>, <code>core-plugins.json</code> and <code>community-plugins.json</code>.</li>\n<li><code>registerMarkdownPostProcessor</code> and <code>registerMarkdownCodeBlockProcessor</code> will now return the <code>MarkdownPostProcessor</code> callback function to facilitate manual un-registration.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":6,"day":23},"info":"<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync will now no longer store the sync configuration in <code>sync.json</code>, and instead store it inside the app's storage using IndexedDB. This should prevent third party sync tools from accidentally corrupting the sync status database.</li>\n<li>Obsidian Sync will now show the paused icon when uninitialized, instead of the green checkmark.</li>\n<li>Note composer's merge functionality will now update links to point to the newly merged file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed template core plugin not applying to all dates in the template.</li>\n<li>Fixed note composer not respecting new file location setting.</li>\n<li>Fixed quick switcher not showing links to non-existent files even when enabling the option.</li>\n<li>Fixed search operators <code>line:</code>, <code>section:</code> and <code>block:</code> not showing correct explanation text.</li>\n<li>Fixed Obsidian Sync sometimes causing duplicate files when creating and then immediately renaming files when latency to the sync server is high.</li>\n<li>Fixed unable to use certain characters on non-english keyboards when renaming files because the app thinks the keyboard is entering an illegal character.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":6,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There's a new core plugin called &quot;Note Composer&quot; that can help you merge and split notes quickly.\n<ul>\n<li>New command and menu option are available for merging current note into another one.</li>\n<li>Select text and right click for the option to extract it into a separate note.</li>\n<li>You can choose to apply a template for extracted notes. The extracted text will be filled into the <code>{{content}}</code> variable in the template. Other variables like <code>{{fromTitle}}</code>, <code>{{newTitle}}</code>, <code>{{date:YYYY-MM-DD}}</code> are also available.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Core plugins now has their commands prefixed with their plugin name, which makes them easier to find in Command Palette.</li>\n<li>The right click menu in edit mode is now unified into a single consistent menu, which contains the cut/copy/paste/select all options, spellcheck suggestions, as well as link options if available.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Syntax highlighting will now properly recognize any character for task lists.</li>\n<li>Pasting images from Chrome now properly works to import it on MacOS.</li>\n<li>Quick switcher now no longer ranks subfolder matches significantly lower than poor file name matches.</li>\n<li>Text overflowing modals now properly scroll rather than clip at the edge of the screen.</li>\n<li>Plugins causing an error in <code>checkCallback</code> no longer breaks the command palette.</li>\n<li>Fixed backlink in document not showing up in an empty file.</li>\n<li>Fixed drag-and-drop panes not working when right sidebar has no panes and is completely hidden.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fixed <code>data-path</code> not updated when folders are renamed.</li>\n<li>There is now a <code>editor-menu</code> event on <code>Workspace</code>, which can be used to add more options to the context menu inside the editor.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":6,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The template core plugin now has commands to insert the current time or the current date.</li>\n<li>There's now a new dedicated command to focus on the editor.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Pasting images copied from Chrome's &quot;Copy image&quot; menu action will now properly import the image to the vault, instead of creating a link to the image's original URL.</li>\n<li>On MacOS, in some rare setups, the file system API may stop working, which should now be caught by Obsidian if any action takes over 60 seconds.</li>\n<li>Upgraded MathJax and Mermaid to latest versions.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The strikethrough command now works properly instead of erroneously adding highlight markers.</li>\n<li>Block math now no longer adds an extra empty line after it when immediately followed by a line of text.</li>\n<li>Quick switcher no longer errors out when opening a non-existent file when the new file location is set to current note.</li>\n<li>During link auto-completion, typing <code>#</code> or <code>^</code> when selecting an alias should now put the cursor in the correct place.</li>\n<li>Opening the app no longer opens to an empty editor with a file called &quot;No file&quot; if the file was deleted. Instead it will correctly open the &quot;No file is open&quot; page.</li>\n<li>Fixed performance issue with very long lines of text.</li>\n<li>In the editor, using two <code>:</code> in text no longer causes text to be grayed out in between.</li>\n<li>Fixed some Mermaid diagrams not rendering properly (journey missing text, gantt unreadable active task, class diagrams have very faint text).</li>\n<li>Fixed autocomplete fuzzy sorting algorithm that previously prioritized punctuation over space characters.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now a function available for converting HTML to Markdown called <code>htmlToMarkdown</code>, which is using a pre-configured Turndown Service.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":1,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":6,"day":2},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.5.</li>\n<li>Fixed iOS app freeze when typing Chinese, Japanese or Korean.</li>\n<li>Fixed app freeze when indenting list at the end of the file.</li>\n<li>Added new command to focus on the editor.</li>\n<li>Fixed iOS <code>Cmd+Option+I</code> emitted as <code>Cmd+Option+6</code>. Thanks Apple.</li>\n<li>Fixed switching Workspaces causes the sidebars to stop working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":0,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":5,"day":31},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.4.</li>\n<li>You can now add global (non-editor) commands to the toolbar.</li>\n<li>Fixed readable line length not working.</li>\n<li>Fixed iOS editing toolbar (for selection/pasting) not showing up when tapping empty line.</li>\n<li>Fixed up/down not highlighting selected auto-complete items, such as quick switcher and command palette.</li>\n<li>Improved link/tag popover location and styling.</li>\n<li>Fixed multiple consecutive tags recognized into a single tag.</li>\n<li>Fixed some setting pages have text that goes out-of-screen.</li>\n<li>Added commands to insert template, current date, and current time (requires templates core plugin).</li>\n<li>Fixed iPad trackpad unable to click on some items the first time.</li>\n<li>Audio recorder now keeps the device awake to avoid losing the recording.</li>\n<li>Fixed unable to type polish  on iPad keyboard.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":5,"day":25},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Quick switcher now has an option to show links to files that haven't been created yet.</li>\n<li>A new core plugin &quot;Outgoing links&quot; is now available.\n<ul>\n<li>It shows a list of destinations your note links to.</li>\n<li>It also gives a list of unlinked mentions from the current note that can be linked.</li>\n<li>This plugin is disabled by default, and you must enable it first to see the new side panel.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Graph view's right click menu now has an option to open the note in a new pane.</li>\n<li>The last opened setting tab is now saved when you close and re-open the setting dialog.</li>\n<li>The folding state of the metadata section in preview is now saved, and will be synced with the folding of the frontmatter in edit view.</li>\n<li>Obsidian Sync's status icon will now show red when not connected to the server.</li>\n<li>Exiting from editor search using the escape key now puts the cursor back.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Obsidian Publish dialog checking a folded folder doesn't work.</li>\n<li>Fixed removing the right sidebar still left a gap.</li>\n<li>Fixed resizing sidebars can sometimes go beyond the app window.</li>\n<li>Graph now updates correctly when files are renamed.</li>\n<li>Renaming files while using Markdown links no longer cause unnecessary characters to be url encoded.</li>\n<li>Markdown links to files that haven't been created yet will no longer cause an entry with <code>.md</code> to show up in link auto-complete.</li>\n<li>Fixed navigation history sometimes skips a note.</li>\n<li>Fixed navigating from a non-active linked pane causes the navigation history to forget the previous note.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Status bar elements now have a css class of the plugin ID added to it, for example, <code>plugin-word-count</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":5,"day":10},"info":"<h2>Improvements</h2>\n<ul>\n<li>Update Electron to v12.0.6.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":19,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":5,"day":7},"info":"<ul>\n<li>Fixed indented lists flicker when scrolled.</li>\n<li>Fixed line wrapping not properly applied on iOS, causing horizontal scroll.</li>\n<li>Fixed display issue on iOS where left side of the editor is cut off.</li>\n<li>Fixed sharing not working on iOS.</li>\n<li>Fixed strikethrough command adds highlight syntax instead.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":5,"day":3},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Command palette can now be configured to have &quot;pinned&quot; commands that appear at the top.</li>\n<li>Obsidian Publish now has a search filter in the upload dialog.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync no longer runs into a possible race condition which sometimes causes file to be recognized as deleted. This has only been observed happening on Obsidian Mobile so far.</li>\n<li>Vastly improved Obsidian Sync boot up speed. It will now also avoid re-scans of attachments when they haven't been changed.</li>\n<li>Obsidian Sync will now log the reason for connection errors to help with debugging.</li>\n<li>Embedding other notes with a heading or a block target will no longer render the whole note when the target cannot be found.</li>\n<li>On macOS, the trigger to change font size will now use the pinch-to-zoom gesture instead of <code>Cmd+Scroll</code>.</li>\n<li>Improved performance when sidebars are hidden.</li>\n<li>Caching/speed improvements for rendering images and other media files.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed headings took too much space when line-wrapping.</li>\n<li>Fixed editor had a larger gap on the right side due to an improper CodeMirror upgrade.</li>\n<li>Fixed exiting the hotkey customization pane while the app is waiting for a hotkey causes keys to stop working.</li>\n<li>Fixed link suggestion not working with capital letters when over 10k files + aliases.</li>\n<li>The fold indicator in metadata section is now correctly aligned.</li>\n<li>Fixed bound command not preventing default when command doesn't execute, causing confusion.</li>\n<li>Fixed some plugins didn't show up when a sort filter is applied.</li>\n<li>Removed Ctrl/Cmd+M hotkey for minimizing the app, which was previously assigned by default from Electron.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>You can now specify an <code>editorCallback</code> or <code>editorCheckCallback</code> in a command that will register your command as an editor command, which will allow it to be added to the editor toolbar on mobile.</li>\n<li><code>Adapter</code> now has a <code>stat</code> function.</li>\n<li>There is now a <code>Platform</code> object that can be used to determine whether the app is on mobile, along with some other platform information.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":18,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":4,"day":30},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.2.</li>\n<li>\n<h2>Shiny new things</h2>\n<ul>\n<li>You can now share the current open file to other apps in the more options menu if you have &quot;Open in default app&quot; core plugin enabled.</li>\n<li>Fixed new panes didn't appear right away when you enable core plugins, like outline and starred, and required a restart.</li>\n<li>You can now see the app's version in the About setting tab.</li>\n</ul>\n</li>\n<li><strong>Mobile Toolbar</strong>:\n<ul>\n<li>The configuration tool can now drag-and-drop to reorder toolbar items.</li>\n<li>The toolbar has been rewritten in anticipation of new upcoming APIs. As a result of this, you may need to re-configure the toolbar order.</li>\n<li>The toolbar will no longer show up if you remove all items.</li>\n</ul>\n</li>\n<li><strong>Editor improvements</strong>:\n<ul>\n<li>Clicking search results, backlink items, or outline items will now properly scroll and highlight the target in edit mode.</li>\n<li>Folding is now implemented in edit mode.</li>\n<li>Fixed link suggestion not working for headings.</li>\n<li>You can now click on links in edit mode, which will trigger a popup that can be used to navigate.</li>\n<li>Lists that wraps to the next line will be indented instead of starting at the very left.</li>\n</ul>\n</li>\n<li><strong>Swipe actions</strong>:\n<ul>\n<li>You can now use two-finger swipe left/right to navigate back/forward.</li>\n<li>Will no longer accidentally trigger on <code>canvas</code> objects, which affects graphs and the excalidraw plugin.</li>\n<li>Will now be ignored when coming from a stylus.</li>\n</ul>\n</li>\n<li><strong>iOS specific</strong>:\n<ul>\n<li>Fixed couldn't rename files with long names because it wraps into a hidden area.</li>\n<li>Implemented deleting files to system trash. Deleted files can then be restored from the Files app.</li>\n<li>Fixed Audio recorder plugin on iOS 14.5+.</li>\n<li>File explorer should no longer show some files with a bigger font than others.</li>\n<li>Rotating the screen no longer causes some paragraphs to have a bigger font.</li>\n<li>Fixed iCloud initial sync causes errors when Obsidian boots up.</li>\n<li>When creating new vaults, the iCloud toggle will now be off by default to avoid accidentally setting up Obsidian Sync in iCloud.</li>\n<li>Fixed checkboxes misaligned.</li>\n</ul>\n</li>\n<li><strong>Other general improvements</strong>:\n<ul>\n<li>Fixed deleting files to <code>.trash</code> folder not working properly.</li>\n<li>Fixed flicker when using the font slider in the Appearance setting tab.</li>\n<li>Fixed long-press the three dot menu stopped working. It should now open the more options menu directly.</li>\n<li>Fixed the UI of File recovery plugin.</li>\n<li>&quot;Link&quot; button will now always show in unlinked mentions on mobile.</li>\n<li>Plugins that create a status bar item will no longer crash.</li>\n<li>Menus triggered from file explorer will now have the file name indicated at the top.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":17,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":4,"day":20},"info":"<ul>\n<li>Fixed can't backspace to delete <code>Tab</code> characters on Android.</li>\n<li>Fixed Option + left/right/delete not behaving correctly on iOS.</li>\n<li>Fixed selecting text triggers swipe action, causing selection handles to disappear.</li>\n<li>Fixed auto-capitalization not working on iOS.</li>\n<li>Fixed side panel fullscreen looking ugly on iOS.</li>\n<li>Don't crash on iOS when selecting &quot;Camera&quot; when inserting attachments.</li>\n<li>Don't show hover tooltips for a split second when pressing buttons.</li>\n<li>Also includes everything up to Desktop v0.12.1</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":4,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>On initial loading of the vault, the cache indexing notification will now contain the indexing progress.</li>\n<li>Improvements to the font size adjustment annoyance:\n<ul>\n<li><code>Ctrl+Scroll</code> now only activates if you hold Ctrl before starting to scroll.</li>\n<li>This option can also now be disabled in Settings &gt; Appearance.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Obsidian Sync: setting custom device names now persists properly.</li>\n<li>Obsidian Sync: viewing version history of images and other media files no longer freeze the app trying to render the media file as plaintext. Images can now be previewed.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The HTML property on task lists has been changed from <code>data-checklist</code> to <code>data-task</code> to be consistent with internal code names.</li>\n</ul>\n","major_release":false}]