[{"version":{"major":1,"minor":6,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":6,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>Added &quot;Publish current file&quot; command and menu item to Obsidian Publish.</li>\n<li>Made minor tweaks to the names and descriptions of various settings.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed duplicate menu items appearing in the context menu when right-clicking on a link inside an embed.</li>\n<li>Fixed &quot;Quick start&quot; from the vault screen not working if the location already exists.</li>\n<li>Fixed lag when dragging and dropping files in the file explorer with many open files.</li>\n<li>Fixed toggling checkbox on the last line of a file or callout.</li>\n<li>Fixed link autocompletion for headings (via <code>[[#</code>) sometimes generating invalid links.</li>\n<li>Fixed dragging and dropping folders in the file explorer generating incorrect folder names if there's a path conflict.</li>\n<li>Fixed links inside callouts not appearing in the Backlinks view.</li>\n</ul>\n<h3>Tables</h3>\n<ul>\n<li>Automatic link renaming now correctly escapes custom display text links (<code>\\|</code>) inside tables.</li>\n<li>Adding a link via the Outgoing Links view now escapes the pipe (<code>\\</code>) character if the link is inside a table.</li>\n<li>Fixed drag and drop not working in table cells.</li>\n<li>Fixed bug where undo/redo inside a table causes columns to disappear.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Improved the overall experience of editing files with inline properties hidden. If properties are hidden in the editor and the Properties core plugin is enabled, any action that attempts to focus the properties will now focus the property in the sidebar.</li>\n<li>Clicking on a property from the global search view now focuses the property.</li>\n</ul>\n<h3>RTL</h3>\n<ul>\n<li>Added better support for mixed LTR and RTL tables.</li>\n<li>Improved rendering of mixed LTR and RTL content inside exported PDFs.</li>\n<li>Made small fixes for tabs.</li>\n<li>No longer force right-alignment on the inline title.</li>\n</ul>\n<h3>Editor</h3>\n<ul>\n<li>Added &quot;Copy&quot; menu item when right-clicking on external links. This copies the displayed text, not the underlying URL.</li>\n<li>Bold links now have the correct text weight applied.</li>\n<li>Fixed links inside headings having the incorrect text weight applied.</li>\n<li>Fixed the color of bare external links.</li>\n<li>Fixed formatting commands when the selected text contains a task list.</li>\n<li>Fixed backslashes (<code>\\</code>) inside inline code getting hidden.</li>\n<li>Updated the letter spacing on smaller headings.</li>\n<li>Fixed the <code>--bold-weight</code> CSS variable not being correctly computed in some places.</li>\n</ul>\n<h3>Workspace</h3>\n<ul>\n<li>The &quot;Split right&quot; menu item and command are no longer available if the active tab is in the sidebar.</li>\n<li>The inline find/replace bar now uses icon buttons instead of text buttons.</li>\n<li>When the app is full screen, the maximize button now turns into a &quot;restore&quot; button in the window frame.</li>\n<li>Fixed translucency on macOS when the app ribbon is visible.</li>\n<li>Fixed several animation glitches with the sidebars when they are opened and closed.</li>\n<li>Fixed issue where items inside the <code>View</code> menu on the macOS application bar did not reflect the current state of the app.</li>\n<li>Updated the appearance of dropdowns across the app.</li>\n</ul>\n<h3>Ribbon</h3>\n<ul>\n<li>Fixed issue with app ribbon items getting reordered incorrectly after drag and drop.</li>\n<li>Disabling and reenabling plugins no longer causes the position of their ribbon items to be lost.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":3,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":6,"day":8},"info":"<ul>\n<li>Includes all bug fixes up to <a href=\"https://obsidian.md/changelog/2024-06-08-desktop-v1.6.3/\">Obsidian Desktop v1.6.3</a>.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":6,"day":8},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed the log-in screen closing without an error if login failed.</li>\n<li>Fixed users with two-factor authentication not being able to log-in within the app.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":2,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":6,"day":7},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-06-07-desktop-v1.6.2/\">Obsidian Desktop v1.6</a>.</li>\n<li>The mobile sidebars have received a slight design refresh. In an effort to reduce some of the visual complexity, we've changed the sidebar tabs to a dropdown list. We also removed the &quot;fullscreen&quot; button to further simplify things.</li>\n<li>Redesigned notices. They will now appear at the bottom of the screen.</li>\n<li>Added a drag handle to dismissable menus.</li>\n<li>Select table cells by dragging the caret.</li>\n<li>You can now fuzzy search for commands when adding them to the mobile toolbar.</li>\n<li>Fixed lists rendering too far to the right in reading mode.</li>\n</ul>\n<h2>Obsidian Sync</h2>\n<ul>\n<li>Layout improvements when viewing the activity log and the file sync history.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Ensure that filesystem <code>mkdir</code> errors are caught on initial load.</li>\n<li>Tweaks to the iCloud loading screen.</li>\n<li>The &quot;Hide keyboard&quot; button now also appears in the mobile toolbar on iPad.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Fixed navigation bar staying hidden after opening a link.</li>\n<li>Show keypad when number property is focused.</li>\n<li>Soft keyboard will now show &quot;next&quot; on iOS and &quot;enter&quot; on Android.</li>\n<li>Disabled autocapitalize for property names and tag values.</li>\n</ul>\n<h3>Styles</h3>\n<ul>\n<li>The splash screen now remains visible until the app has fully loaded.</li>\n<li>Fix appearance of vault switcher when transitioning between screens.</li>\n<li>Fix box-shadow getting cut off clipped in Sync's activity log.</li>\n<li>Fix animation getting skipped when pressing &quot;cancel&quot; in a confirmation dialog.</li>\n<li>Minor animation/shadow tweaks for dialogs.</li>\n<li>Fixed the context menus on side drawer tabs automatically closing.</li>\n<li>Fix alignment of the view header (it's finally centered).</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Fixed the Share Sheet not always working on iOS.</li>\n<li>Increased the maximum number of items you can &quot;Share&quot; using the iOS Share Sheet to 100.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is a new <code>.mobile-tap</code> class that gets applied to elements when they are tapped. If you want to add an active state to your buttons on mobile, you can add the class <code>.tappable</code> to your element. When your element is touched, a <code>.mobile-tap</code> class will get applied.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":6,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":6,"day":7},"info":"<p>This update focuses on improving a few long-standing sore points. Notably, we overhauled <strong>support for right-to-left (RTL) languages</strong>. The editor now automatically detects language direction per line, making it more adaptable for mixed-language usage. In addition, when the app is set to an RTL language, the interface is mirrored accordingly.</p>\n<p>We've improved the editing and reading experience of <strong>footnotes</strong>. This release is jam-packed with bug fixes and small improvements. This release includes numerous bug fixes and small improvements, along with some performance enhancements for loading and editing.</p>\n<h4>Highlights</h4>\n<ul>\n<li>RTL UI and mixed-direction support. The interface direction is now mirrored when the app is set to an RTL language.</li>\n<li>New vault profile. The vault name is now always visible in the primary sidebar, making it easier to switch vaults.</li>\n<li>The app ribbon can now be hidden in settings or by right-clicking on the ribbon and selecting &quot;Hide ribbon&quot;.</li>\n<li>Character count and word count now update based on the current text selection.</li>\n<li>Faster workspace loading and parsing longer Markdown files.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li><code>Tab</code> now completes the path segment of the currently selected file in the Quick switcher and &quot;Move files&quot; prompt.</li>\n<li>Added &quot;Add alias&quot; command.</li>\n<li>Added &quot;Create new folder&quot; command.</li>\n<li>Hotkeys and property types are now automatically reloaded if the settings are modified outside of Obsidian.</li>\n<li>Added custom instructions and result when adding display text to a link.</li>\n<li>Prompts now have a &quot;clear&quot; button to clear the input. Pressing the button when there is no input now dismisses the prompt.</li>\n<li>Page preview popups should now have more consistent sizing and positioning.</li>\n</ul>\n<h3>Footnotes</h3>\n<ul>\n<li>Added autocompletion for footnote references using <code>[^</code>.</li>\n<li>Improved parsing and rendering of footnotes in the editor.</li>\n<li>Added hover preview support for inline footnotes.</li>\n<li>Hovering over a footnote ID displays a popup with the corresponding footnote.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Merging properties now flashes the new property name in the global property list.</li>\n<li>Double-clicking a property list item now allows you to edit it.</li>\n<li>Added an edit button to the properties view if the open file has invalid frontmatter.</li>\n</ul>\n<h3>Obsidian Sync</h3>\n<ul>\n<li>Updated the default selective syncing when setting up Sync. By default, Sync now syncs:\n<ul>\n<li>Main settings</li>\n<li>Appearance settings</li>\n<li>Hotkeys</li>\n<li>Core plugins</li>\n<li>Core plugin settings</li>\n<li>Video, images, PDFs, and audio</li>\n</ul>\n</li>\n<li>Arbitrary files inside plugin folders are no longer tracked by Sync. The only files inside a plugin folder that are tracked are:\n<ul>\n<li><code>data.json</code></li>\n<li><code>main.js</code></li>\n<li><code>styles.css</code></li>\n<li><code>manifest.json</code></li>\n</ul>\n</li>\n<li>Improved loading experience while Sync connects to the remote vault.</li>\n<li>The &quot;purge&quot; button now appears if storage is more than 95% full.</li>\n<li>Added command to open the activity log.</li>\n<li>Updated layout of the status bar menu.</li>\n<li>Clicking the statusbar item now always shows the Sync menu instead of opening the activity log.</li>\n<li>Improved appearance of the &quot;Disconnect&quot; button in settings.</li>\n<li>Syncing is faster when processing pending changes.</li>\n<li>No throttling when the main window is minimized or in the background.</li>\n<li>Improved interface for inviting Sync collaborators.</li>\n<li>Fixed issue with &quot;View version history&quot; not working if file is not tracked in Sync.</li>\n<li>Disconnecting from vault no longer hangs indefinitely.</li>\n<li>Automatically disconnect from vaults that do not exist.</li>\n<li>Standardized the &quot;Vault not found&quot; error message.</li>\n<li>Removed redundant disconnect button.</li>\n<li>Fixed settings reset issues when switching between remote vaults.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed file contents flickering when switching away from a file with properties.</li>\n<li>Resolved issues with &quot;Collapse all&quot; requiring multiple clicks.</li>\n<li>Fixed <code>Redo</code> not working from the macOS app menu.</li>\n<li>Properties now inherit the page preview setting of whatever mode the view is in.</li>\n<li>Updated icons for &quot;Move to new window&quot; and &quot;Open in new window&quot;.</li>\n<li>Consistent context menu icons in the Bookmarks view.</li>\n<li>Fixed workspace layout not always saving after selecting a tab.</li>\n<li>Attempting to open an invalid URL shows a notice instead of failing silently.</li>\n<li>Fixed vim mode crashing when dragging cursor over folded text.</li>\n<li>Allow clicking at start of line inside blockquote.</li>\n<li>Fixed scrolling when clicking next to scrollbar in a PDF.</li>\n<li>Fixed minimized main window doesn't adapt to system theme change.</li>\n<li>Fixed Backlinks view not always showing an empty state.</li>\n<li>Fixed toggling core plugins not always showing the settings &quot;gear&quot; icon immediately.</li>\n<li>Fixed checklists getting unfolded when clicking on the checkbox.</li>\n<li>Fixed list collapse indicators from extending into text in Live Preview.</li>\n<li>Fixed callout images being clipped inside hover preview.</li>\n<li>Improved appearance of &quot;destructive&quot; menu items when disabled.</li>\n<li>Views that cannot navigate (e.g. the File Explorer) no longer shows pinned icons if they are pinned in the workspace.</li>\n<li>Multiple consecutive spaces are no longer collapsed in file names.</li>\n<li>Fixed Canvas cards appearing blurry when a card contains a callout with a list.</li>\n<li>Fixed Outgoing Links unlinked mentions always showing the count as &quot;0&quot;.</li>\n<li>Fixed &quot;New&quot; section in Obsidian Publish showing folders uncollapsed.</li>\n</ul>\n<h3>Formatting</h3>\n<ul>\n<li>Fixed incorrect formatting getting applied if selection has trailing newline.</li>\n<li>The &quot;Toggle bullet list&quot; command now turns a task list into a bullet list.</li>\n<li>Fixed commands for toggling formatting sometimes not working on the last line of the editor.</li>\n</ul>\n<h3>Settings</h3>\n<ul>\n<li>Improved the layout of the login screen inside settings.</li>\n<li>Minor updates to the notices shown when installing community themes and plugins.</li>\n<li>The &quot;Light themes only&quot; toggle is no longer displayed when using 'adapt to system'.</li>\n<li>Improved drag and drop for the command palette reordering.</li>\n<li>Fixed reorder handler not working in pop-out windows.</li>\n</ul>\n<h3>Search</h3>\n<ul>\n<li>Search suggestions are dismissed when typing quoted string.</li>\n<li>Search suggestions are not shown unless the cursor is at the end of the query, or the next character is a space.</li>\n<li>Clicking the &quot;clear&quot; button no longer causes the search input to lose focus.</li>\n</ul>\n<h3>Localization</h3>\n<ul>\n<li>The Norsk language is now mapped to the Bokmål locale.</li>\n</ul>\n<h3>Table</h3>\n<ul>\n<li>Clicking in margin to right of table now focuses the editor.</li>\n<li>Fixed shift + arrow key not responding.</li>\n<li>Ensure cell updates from main editor correctly update cell offsets.</li>\n<li>Fix parsing math blocks inside table cells.</li>\n<li>Fixed double-click not working in table cells.</li>\n<li>Fixed rendering tables inside callouts.</li>\n</ul>\n<h3>Source mode</h3>\n<ul>\n<li>Fixed pressing <code>End</code> key not moving to end of line if cursor is in table.</li>\n</ul>\n<h3>Live Preview</h3>\n<ul>\n<li>Fix callout menu overlapping with URL menu when right-clicking on a link.</li>\n<li>Fix failing to render headings with trailing <code>#</code> at the end of the line.</li>\n<li>Fixed checklist items getting unfolded if cursor was inside a folded region.</li>\n<li>Allow blank lines in multi-line footnotes.</li>\n</ul>\n<h3>Reading mode</h3>\n<ul>\n<li>Reading mode no longer renders footnote references that contain spaces.</li>\n<li>Fixed rendering of inline footnotes in reading mode.</li>\n</ul>\n<h3>PDF</h3>\n<ul>\n<li>Mitigation for PDF.js vulnerability (<a href=\"https://github.com/advisories/GHSA-wgrm-67xf-hhpq\">CVE-2024-4367</a>)</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>We have published <a href=\"https://docs.obsidian.md/Plugins/User+interface/Right-to-left\">a guide</a> for how to adapt your theme or plugin to support RTL interfaces.</li>\n</ul>\n<h3>Themes</h3>\n<ul>\n<li>Switched to Cascadia Mono instead of Cascadia Code as the default monospace on Windows.</li>\n<li>Bold text is now computed based on the current text weight, so bold inside a heading still appears bold.\n<ul>\n<li>For theming we recommend using the <code>--bold-modifier</code> variable instead of <code>--bold-weight</code>. This enables Obsidian to use a heavier weight in situations where the text may already be bold, such as headings: <code>## Bold **bolder**</code></li>\n</ul>\n</li>\n<li>Added <code>--caret-color</code> CSS variable to make it easier to style caret color on both desktop and mobile.</li>\n<li>Added new <code>--link-weight</code> variable.</li>\n<li>The user's interface language is added to the <code>lang</code> attribute on the <code>html</code> element, which allows language-specific CSS rules.</li>\n<li>The <code>.mod-rtl</code> class is added to <code>body</code> element when the user's interface language is RTL.</li>\n</ul>\n<h3>Plugins</h3>\n<ul>\n<li>Fixed <code>processFrontmatter</code> not processing files if all properties are removed.</li>\n<li>Improved detection of external config changes.</li>\n<li>Improved <code>app.emulateMobile</code> to make it easier to test if your plugins are mobile-compatible. Attempting to run a NodeJS library presents a Notice. Drag-and-drop more accurately mirrors mobile behavior. The app has default <code>safe-area-inset</code> properties set so that your views properly account for offsets in the mobile device viewport (such as the iPhone Dynamic Island).</li>\n<li>Modals should respect <code>safe-area-insets</code> without requiring additional CSS.</li>\n<li>Added loading state to some settings buttons that make remote requests.</li>\n<li>Completely removed global <code>app</code> from the API spec (previously it was marked as deprecated).</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":6,"patch":2,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":6,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-06-04-desktop-v1.6.2/\">Obsidian Desktop v1.6.2</a>.</li>\n<li>Redesigned notices. They will now appear at the bottom of the screen.</li>\n<li>Added a drag handle to dismissable menus.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The splash screen will show again if the app closes due to iOS memory compression.</li>\n<li>Input prompts will no longer automatically capitalize the first letter.</li>\n<li>Add padding to the bottom of the main settings page.</li>\n<li>Fixed the vim bottom panel styling on phone screens. It should now appear above the toolbar.</li>\n<li>Minor fixes for the publish screen layout on phone screens.</li>\n<li>The &quot;Close window&quot; command will no longer appear on mobile devices.</li>\n<li>The &quot;Undo close tab&quot; command should not attempt to create a new tab group on mobile.</li>\n<li>Fix back button not always getting removed inside the Community plugins view.</li>\n<li>Fixed horizontal table scrolling.</li>\n<li>Fixed iOS not being able to open the context menu on sidebar tabs.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":6,"day":4},"info":"<h2>Improvements</h2>\n<h3>Footnotes</h3>\n<ul>\n<li>The inline footnote suggest now allows for spaces when searching for footnotes via <code>[^</code>.</li>\n<li>Pressing the clear button when there is no input will now dismiss the prompt.</li>\n</ul>\n<h3>Sync</h3>\n<ul>\n<li>Fix disconnecting from vault sometimes hanging indefinitely.</li>\n<li>Automatically disconnect from vaults that do not exist.</li>\n<li>Standardized &quot;Vault not found&quot; error message.</li>\n<li>Remove redundant disconnect button.</li>\n<li>Fixed issue where Sync would not reset your settings properly when switching to a different remote vault.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where File Explorer would sometimes load without remembering which folders were expanded.</li>\n<li>Improved the layout and styling of the login screen inside settings.</li>\n<li>Minor updates to the notices shown when installing community themes and plugins.</li>\n<li>Views that cannot navigate (e.g. the File Explorer) will no longer show pinned icons if they are pinned in the workspace.</li>\n<li>The &quot;Find&quot; and &quot;Replace&quot; menu items now have their own menu section.</li>\n<li>Fixed table cell text alignment for RTL text.</li>\n<li>Multiple consecutive spaces are no longer collapsed in file names.</li>\n<li>The &quot;toggle bullet list&quot; command will now turn a task list into a bullet list.</li>\n<li>Fixed double-click not working in table cells.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":1,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":5,"day":22},"info":"<h2>Improvements</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-05-22-desktop-v1.6.1/\">Obsidian Desktop v1.6.1</a>.</li>\n<li>The mobile sidebars have received a slight design refresh. In an effort to reduce some of the visual complexity, we've changed the sidebar tabs to a dropdown list. We also removed the &quot;fullscreen&quot; button to further simplify things.</li>\n<li>Select table cells by dragging the caret.</li>\n<li>You can now fuzzy search for commands when adding them to the mobile toolbar.</li>\n<li>Fixed lists rendering too far to the right in reading mode.</li>\n</ul>\n<h2>Obsidian Sync</h2>\n<ul>\n<li>Layout improvements when viewing the activity log and the file sync history.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Ensure that filesystem <code>mkdir</code> errors are caught on initial load.</li>\n<li>Tweaks to the iCloud loading screen.</li>\n<li>The &quot;Hide keyboard&quot; button now also appears in the mobile toolbar on iPad.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Fixed navigation bar staying hidden after opening a link.</li>\n<li>Show keypad when number property is focused.</li>\n<li>Soft keyboard will now show &quot;next&quot; on iOS and &quot;enter&quot; on Android.</li>\n<li>Disabled autocapitalize for property names and tag values.</li>\n</ul>\n<h3>Styles</h3>\n<ul>\n<li>The splash screen now remains visible until the app has fully loaded.</li>\n<li>Fix appearance of vault switcher when transitioning between screens.</li>\n<li>Fix box-shadow getting cut off clipped in Sync's activity log.</li>\n<li>Fix animation getting skipped when pressing &quot;cancel&quot; in a modal.</li>\n<li>Minor animation/shadow tweaks for dialogs.</li>\n<li>Fixed the context menus on side drawer tabs automatically closing.</li>\n<li>Fix alignment of the view header (it's finally centered).</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Fixed the Share Sheet not always working on iOS.</li>\n<li>Increased the maximum number of items you can &quot;Share&quot; using the iOS Share Sheet to 100.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is a new <code>.mobile-tap</code> class that gets applied to elements when they are tapped. If you want to add an active state to your buttons on mobile, you can add the class <code>.tappable</code> to your element. When your element is touched, a <code>.mobile-tap</code> class will get applied.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":5,"day":22},"info":"<h2>Improvements</h2>\n<ul>\n<li>Add autocompletion for footnote references using <code>[^</code>.</li>\n<li>Remove flicker when switching away from a file with properties.</li>\n<li>Added an edit button to the properties view if the open file has invalid frontmatter.</li>\n<li>Added hover preview support for inline footnotes.</li>\n<li>Prompts now have a &quot;clear&quot; button to clear the input.</li>\n</ul>\n<h3>macOS</h3>\n<ul>\n<li>Application menu now has &quot;Substitutions&quot; menu to toggle the System level text substitution preferences.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We have reverted the 2 MB limit for Markdown file parsing.</li>\n<li>The inline text suggestions now appear to the left of the cursor if the current editor line is RTL.</li>\n<li>Fixed rendering tables inside callouts.</li>\n<li>Fixed reorder handler not working in pop-out windows.</li>\n<li>Fixed commands for toggling formatting sometimes not working on the last line of the editor.</li>\n<li>Fixed canvas cards appearing blurry when a card contains a callout with a list.</li>\n<li>Small fix for tab header color.</li>\n<li>Fixed Outgoing Links unlinked mentions always showing the count as &quot;0&quot;.</li>\n<li>Fixed incorrect formatting getting applied if selection has trailing newline.</li>\n<li>Minor layout improvements for the file explorer.</li>\n<li>Fixed &quot;New&quot; section in Obsidian Publish showing folders uncollapsed.</li>\n</ul>\n<h3>Reading mode</h3>\n<ul>\n<li>Reading mode will no longer render footnote refs that contain spaces.</li>\n<li>Page preview now shows footnote previews on hover in reading mode.</li>\n<li>Fix rendering of inline footnotes in reading mode.</li>\n</ul>\n<h3>Source mode</h3>\n<ul>\n<li>Fixed pressing <code>End</code> key not moving to end of line if cursor is in table.</li>\n</ul>\n<h3>Live Preview</h3>\n<ul>\n<li>Fix callout menu overlapping with URL menu when right-clicking on a link.</li>\n<li>Fix failing to render headings with trailing <code>#</code> at the end of the line.</li>\n<li>Fixed checklist items getting unfolded if cursor was inside a folded region.</li>\n<li>Allow blank lines in multi-line footnotes.</li>\n</ul>\n<h3>PDF</h3>\n<ul>\n<li>Mitigation for PDF.js vulnerability (<a href=\"https://github.com/advisories/GHSA-wgrm-67xf-hhpq\">CVE-2024-4367</a>)</li>\n</ul>\n<h2>Developers</h2>\n<p>We have reverted the CSS changes to <code>.suggestion-popover</code> which should fix the issues with suggestions created by plugins appearing unstyled.</p>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":5,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The interface direction is now mirrored when the app is set to an RTL language.</li>\n<li>Updated the left sidebar layout. Vault switcher is now shown at the bottom. App ribbon can now be hidden in settings or by right-clicking on the ribbon and selecting &quot;hide ribbon.&quot;</li>\n<li>Character and word count is now updated based on the current text selection.</li>\n<li><code>Tab</code> will now complete the path segment of the currently selected file in the Quick switcher and &quot;Move files&quot; modal.</li>\n</ul>\n<h2>Improved</h2>\n<ul>\n<li>Initial workspace load time should be improved.</li>\n<li>The &quot;More options&quot; menu items have been reorganized to be easier to parse visually.</li>\n<li>Added &quot;Add alias&quot; command.</li>\n<li>Added &quot;Create new folder&quot; command.</li>\n<li>Hotkeys and property types are now automatically reloaded if the settings are modified outside of Obsidian.</li>\n<li>Improved editor parsing performance.</li>\n<li>Added custom instructions and result when adding display text to a link.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>When merging two properties, the new property name will now flash in the global property list.</li>\n<li>You can now double-click on a property list item to edit it.</li>\n</ul>\n<h3>Page preview</h3>\n<ul>\n<li>Hovering over a footnote ID will now display a popup with the corresponding footnote.</li>\n<li>Previews should now have more consistent sizing and positioning.</li>\n</ul>\n<h3>Sync Improvements</h3>\n<ul>\n<li>Updated the default selective syncing when setting up Sync. By default, Sync will now sync:\n<ul>\n<li>Main settings</li>\n<li>Appearance settings</li>\n<li>Hotkeys</li>\n<li>Core plugins</li>\n<li>Core plugin settings</li>\n<li>Video, images, PDFs, and audio</li>\n</ul>\n</li>\n<li>Arbitrary files inside plugin folders will no longer get tracked by Sync. The only files inside a plugin folder that will get tracked are:\n<ul>\n<li>data.json</li>\n<li>main.js</li>\n<li>styles.css</li>\n<li>manifest.json</li>\n</ul>\n</li>\n<li>The &quot;Purge&quot; button will now appear if storage is more than 95% full.</li>\n<li>Add command to open the activity log.</li>\n<li>Improve styling of status bar menu.</li>\n<li>Clicking the statusbar item now always shows the Sync menu instead of opening the activity log.</li>\n<li>Tweak appearance of &quot;Disconnect&quot; button in settings.</li>\n<li>Syncing should be faster when processing pending sync changes.</li>\n<li>Don't throttle when main window is minimized or in the background.</li>\n<li>Improved loading experience while Sync connects to the remote vault.</li>\n<li>Improved the interface for inviting Sync collaborators to your vault.</li>\n<li>Fixed issue with &quot;View version history&quot; not working if file is not tracked in Sync.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed parsing and rendering of footnotes in the editor.</li>\n<li>Markdown files larger than 2MB will no longer get indexed. This should prevent programmatically generated Markdown files causing Obsidian to lag at startup.</li>\n<li>Fixed <code>Redo</code> not working when triggered from the macOS app menu.</li>\n<li>Properties now inherit the page preview setting of whatever mode the view is in.</li>\n<li>Updated the &quot;move to new window&quot; and &quot;open in new window&quot; icons.</li>\n<li>Updated the context menu icons in the Bookmarks view to be consistent with the rest of the app.</li>\n<li>Fixed workspace layout not always saving after selecting a tab.</li>\n<li>Attempting to open an invalid URL will show a Notice instead of failing silently.</li>\n<li>The &quot;Light themes only&quot; toggle is no longer displayed when using 'adapt to system'.</li>\n<li>Fixed vim mode crashing when dragging cursor over folded text.</li>\n<li>Don't show empty text when there's a fallback suggestion.</li>\n<li>Allow clicking at start of line inside blockquote.</li>\n<li>Fix scrolling when clicking at next to scrollbar in a PDF.</li>\n<li>Fixed minimized main window doesn't adapt to system theme change.</li>\n<li>Improved drag and drop for the command palette reordering.</li>\n<li>Fixed clicking &quot;Collapse all&quot; sometimes requiring two clicks to work.</li>\n<li>Fixed backlinks view not always showing an empty state.</li>\n<li>Fixed toggling core plugins not always showing the settings &quot;gear&quot; icon immediately.</li>\n<li>Fixed checklists getting unfolded when clicking on the checkbox.</li>\n<li>Fixed list collapse indicators from extending into text in Live Preview.</li>\n<li>Fix callout images getting clipped inside hover preview.</li>\n<li>Improve styling of tree items during rename.</li>\n<li>Fixed appearance of &quot;destructive&quot; menu items when they are disabled.</li>\n</ul>\n<h3>Search</h3>\n<ul>\n<li>Dismiss suggestions when typing quoted string.</li>\n<li>Don't open suggestions if next character is non-space.</li>\n<li>Clicking &quot;clear&quot; button will no longer cause search input fields to lose focus.</li>\n</ul>\n<h3>Localization</h3>\n<ul>\n<li>The Norsk language is now mapped to the Bokmål locale.</li>\n</ul>\n<h3>Table</h3>\n<ul>\n<li>Clicking in margin to right of table now focuses the editor.</li>\n<li>Fixed shift + arrow key not responding.</li>\n<li>Ensure cell updates from main editor correctly update cell offsets.</li>\n<li>Fix parsing math blocks inside table cells.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>We have published <a href=\"https://docs.obsidian.md/Plugins/User+interface/Right-to-left\">a guide</a> for how to adapt your theme or plugin to support RTL interfaces.</li>\n</ul>\n<h3>Themes</h3>\n<ul>\n<li>Switched to Cascadia Mono instead of Cascadia Code for default monospace on Windows.</li>\n<li>Bold is now computed based on the current text weight, so bold inside a heading will still appear bold.</li>\n<li>Added <code>--caret-color</code> CSS variable to make it easier to style caret color on both desktop and mobile.</li>\n<li>Added new <code>--link-weight</code> variable.</li>\n<li>The user's interface language is added to the <code>lang</code> attribute on the <code>html</code> element, which allows language-specific CSS rules.</li>\n<li>The <code>.mod-rtl</code> class is added to <code>body</code> element when the user's interface language is RTL.</li>\n</ul>\n<h3>Plugins</h3>\n<ul>\n<li>Fixed <code>processFrontmatter</code> failing to process file if all properties are removed.</li>\n<li>Improve detection of external config changes.</li>\n<li>We've made several improvements to the behavior of <code>app.emulateMobile</code> that should make it easier to test that your plugins are mobile-compatible. Attempting to run a NodeJS library will present a Notice. Drag and drop will more accurately mirror the behavior on mobile. The app will have default <code>safe-area-inset</code> properties set so that your views properly account for offsets in the mobile device viewport (such as the iPhone Dynamic Island).</li>\n<li>Bare modals should respect <code>safe-area-insets</code> by default.</li>\n<li>Added loading state to some of the settings button that make remote requests.</li>\n<li>Global <code>app</code> has been completely removed from the API spec (previously it was marked as deprecated).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":12,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":3,"day":31},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Android: Fixed issues with some keyboards and voice input putting characters behind the cursor.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":12,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":3,"day":31},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed issues with East Asian input methods putting characters behind the cursor.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":11,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":3,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-03-19-desktop-v1.5.11/\">Obsidian Desktop v1.5.11</a>.</li>\n<li>Fixed alignment of app header. The file name should now be horizontally centered.</li>\n<li>Ensure the last few seconds of changes are saved when leaving the app.</li>\n<li>Added missing icons in the &quot;Mobile&quot; settings list.</li>\n<li>Fixed dialogs sometimes appearing with way too much space at the top.</li>\n<li>Allow loading Google fonts inside custom CSS.</li>\n<li>Fixed collapse buttons on tablet devices were incorrectly shown when sidebar is pinned.</li>\n<li>Opening the photo lightbox no longer activates the keyboard.</li>\n<li>Removed commands to navigate to specific tab number on small mobile devices.</li>\n</ul>\n<h3>Appearance</h3>\n<ul>\n<li>Animations throughout the app have been sped up slightly.</li>\n<li>Fixed the appearance of dialogs throughout the app to appear more uniform.</li>\n<li>The mobile toolbar items are now spaced closer together.</li>\n<li>Improved layout of community plugins directory.</li>\n<li>Fixed the status bar color in light mode for tablets.</li>\n<li>The last updated date in community plugins is now hidden on smaller devices.</li>\n<li>Settings will now slide in from the left.</li>\n</ul>\n<h3>Performance</h3>\n<ul>\n<li>Minor improvements to scrolling in Live Preview. Should reduce the amount of times that scrolling gets interrupted.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Text properties will be selected when they receive focus on tablet.</li>\n<li>Fix placeholder text not showing for date and datetime properties.</li>\n<li>Fixed issue where arrow keys would not always function when properties were focused.</li>\n</ul>\n<h3>Android</h3>\n<ul>\n<li>Fixed keyboard getting closed when deleting a table.</li>\n<li>Fixed keyboard being closed when switching back to Obsidian from another app.</li>\n<li>Fixed not being able to type with external keyboard.</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Fixed app being laggy when backlinks view is open.</li>\n<li>Fixed black bars sometimes appearing when virtual keyboard opens or closes.</li>\n<li>Fixed &quot;Select all&quot; not working on larger documents.</li>\n<li>Fixed pasting link sometimes generate a link with empty title.</li>\n<li>Fixed pasting text containing a colon getting inserted as a Markdown link.</li>\n<li>Long-pressing on links in Live Preview no longer activates the keyboard.</li>\n<li>Keyboard will now update immediately after the theme changes between light/dark modes.</li>\n<li>Fixes file corruption when large files fails to save due to out of memory errors when using Sync.</li>\n<li>Typing <code>--</code> at the start of a line will no longer get converted to a en-dash.</li>\n<li>Native interface elements such as the text selection menu and iPad keyboard overlay will now following the color scheme.</li>\n</ul>\n<h3>iPad</h3>\n<ul>\n<li>Fixed tabs requiring two taps to activate.</li>\n<li>Improved compatibility with Apple Vision Pro's eye tracking making it clear what elements are interactive.</li>\n<li>Fixed the toolbar sometimes having too much space below it when using physical keyboard.</li>\n<li>Fixed sometimes the navigation bar shows behind the toolbar when using an external keyboard.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the &quot;toggle sidebar&quot; commands causing the sidebars to get completely hidden.</li>\n<li>The formatting submenu will no longer appear in the editor context menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":11,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":3,"day":19},"info":"<h2>Breaking changes</h2>\n<ul>\n<li>It is no longer possible to enable the &quot;Translucent windows&quot; setting on Windows.</li>\n</ul>\n<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Added support for setting alignment of multiple table columns at once.</li>\n<li>It's now possible to drag and drop content into table cells.</li>\n<li>Fixed &quot;Show context menu&quot; command when cursor is inside a table cell.</li>\n<li>Allow deleting line before table if its the first line of the file.</li>\n</ul>\n<h3>Obsidian Sync</h3>\n<ul>\n<li>Add support for the new <a href=\"https://obsidian.md/blog/standard-plan/\">Standard</a> plan.</li>\n<li>The deleted files list loads much faster for users with large vaults.</li>\n<li>Before Sync has loaded the configuration data, the Sync status will indicate that its still loading, instead of saying &quot;No remote vault connected.&quot;</li>\n</ul>\n<h3>Workspaces</h3>\n<ul>\n<li>The list of workspaces now shows the last modified time of each workspace.</li>\n<li>Added new &quot;Save layout&quot; command.</li>\n<li>The active workspace is now highlighted in the workspace switcher.</li>\n</ul>\n<h3>Appearance</h3>\n<ul>\n<li>Add system default font options for Windows and Linux.</li>\n<li>Update monospace system font stack.</li>\n</ul>\n<h3>General</h3>\n<ul>\n<li>Improved the performance of browsing community plugins and themes.</li>\n<li>The font size slider no longer attempts to resize the interface while it is still being dragged.</li>\n<li>Enabling &quot;Restricted mode&quot; in the settings will now automatically reload the app to ensure that plugins are completely unloaded.</li>\n<li>The &quot;Move current file to another folder&quot; command now properly handles moving files into the same folder they are currently in</li>\n<li>Properties: Ensure text property resets when pressing escape.</li>\n<li>Fixed issue where <code>cssclasses</code> would sometimes stay applied to the tab when switching to another file.</li>\n<li>Fix bug with unresolved link color being overridden.</li>\n<li>Removed extra top padding when window is fullscreen and using &quot;Obsidian frame&quot; setting.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":11,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":3,"day":13},"info":"<h2>Improvements</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-03-13-desktop-v1.5.11/\">Obsidian Desktop v1.5.11</a>.</li>\n</ul>\n<h3>Appearance</h3>\n<ul>\n<li>Animations throughout the app have been sped up slightly.</li>\n<li>Fixed the appearance of dialogs throughout the app to appear more uniform.</li>\n<li>Minor tweaks to the layout of the mobile toolbar.</li>\n<li>Improved layout of community plugins directory.</li>\n<li>Fixed the status bar color in light mode for tablets.</li>\n<li>The last updated date in community plugins is now hidden on smaller devices.</li>\n<li>Settings will now slide in from the left.</li>\n</ul>\n<h3>Performance</h3>\n<ul>\n<li>Minor improvements to scrolling in Live Preview. Should reduce the amount of times that scrolling gets interrupted.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Select input text on tablet.</li>\n<li>Fix placeholder text not showing for date and datetime properties.</li>\n<li>Fixed issue where arrow keys would not always function when properties were focused.</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Typing <code>--</code> at the start of a line will no longer get converted to a en-dash.</li>\n<li>Native interface elements such as the text selection menu and iPad keyboard overlay will now following the color scheme.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the &quot;toggle sidebar&quot; commands causing the sidebars to get completely hidden.</li>\n<li>The formatting submenu will no longer appear in the editor context menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":3,"day":13},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>It's now possible to drag and drop content into table cells.</li>\n<li>Fixed &quot;Show context menu&quot; command when cursor is inside a table cell.</li>\n<li>Allow deleting line before table if its first line.</li>\n</ul>\n<h3>Obsidian Sync</h3>\n<ul>\n<li>The deleted files list should now load much faster for users with large vaults.</li>\n</ul>\n<h3>Workspaces</h3>\n<ul>\n<li>The list of workspaces now shows the last modified time of each workspace.</li>\n<li>Added new &quot;Save layout&quot; command.</li>\n<li>The active workspace is now highlighted in the workspace switcher.</li>\n</ul>\n<h3>Appearance</h3>\n<ul>\n<li>Add system default font options for Windows and Linux.</li>\n<li>Update monospace system font stack.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Enabling &quot;Restricted mode&quot; in the settings will now automatically reload the app to ensure that plugins are completely unloaded.</li>\n<li>The &quot;Move current file to another folder&quot; command now properly handles moving files into the same folder they are currently in</li>\n<li>Properties: Ensure text property resets when pressing escape.</li>\n<li>Fixed issue where <code>cssclasses</code> would sometimes stay applied to the tab when switching to another file.</li>\n<li>Fix bug with unresolved link color being overridden.</li>\n<li>Removed extra top padding when window is fullscreen-ed and using &quot;Obsidian frame&quot; setting.</li>\n</ul>\n<h2>For developers</h2>\n<ul>\n<li>Fixed <code>revealLeaf</code> failing to focus the correct window.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":3,"day":4},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed readable line length not getting applied immediately when opening a tab.</li>\n<li>Added minor improvements to how Obsidian Sync initially loads before connecting to a remote vault.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":9,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":3,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-03-04-desktop-v1.5.9/\">Obsidian Desktop v1.5.9</a>.</li>\n<li>Fixed alignment of app header. The filename should now be horizontally centered.</li>\n<li>Ensure the last few seconds of changes are saved when leaving the app.</li>\n<li>Added missing icons in the &quot;Mobile&quot; settings list.</li>\n<li>Fixed dialogs sometimes appearing with way too much space at the top.</li>\n<li>Allow loading Google fonts inside custom CSS.</li>\n<li>Fixed collapse buttons on tablet devices were incorrectly shown when sidebar is pinned.</li>\n<li>Opening the photo lightbox no longer activates the keyboard.</li>\n<li>Removed commands to navigate to specific tab number on small mobile devices.</li>\n</ul>\n<h3>Android</h3>\n<ul>\n<li>Fixed keyboard getting closed when deleting a table.</li>\n<li>Fixed keyboard being closed when switching back to Obsidian from another app.</li>\n<li>Fixed not being able to type with external keyboard.</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Fixed app being laggy when backlinks view is open.</li>\n<li>Fixed black bars sometimes appearing when virtual keyboard opens or closes.</li>\n<li>Fixed &quot;Select all&quot; not working on larger documents.</li>\n<li>Fixed pasting link sometimes generate a link with empty title.</li>\n<li>Fixed pasting text containing a colon getting inserted as a Markdown link.</li>\n<li>Long-pressing on links in Live Preview no longer activates the keyboard.</li>\n<li>Keyboard will now update immediately after the theme changes between light/dark modes.</li>\n<li>Fixes file corruption when large files fails to save due to out of memory errors when using Sync.</li>\n</ul>\n<h3>iPad</h3>\n<ul>\n<li>Fixed tabs requiring two taps to activate.</li>\n<li>Improved compatibility with Apple Vision Pro's eye tracking making it clear what elements are interactive.</li>\n<li>Fixed the toolbar sometimes having too much space below it when using physical keyboard.</li>\n<li>Fixed sometimes the navigation bar shows behind the toolbar when using an external keyboard.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":3,"day":4},"info":"<h2>Breaking changes</h2>\n<ul>\n<li>It is no longer possible to enable the &quot;Translucent windows&quot; setting on Windows.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Added support for setting alignment of multiple table columns at once.</li>\n<li>Improved the performance of browsing community plugins and themes.</li>\n<li>The font size slider no longer attempts to resize the interface while it is still being dragged.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where bookmarks would sometimes disappear.</li>\n<li>Fixed selecting headings in Live Preview unexpectedly selects the leading &quot;#&quot; characters.</li>\n<li>Fixed first line of file sometimes getting folded unexpectedly.</li>\n<li>Fixed links sometimes getting activated when clicking beyond the bounds of the link.</li>\n<li>Fixed pasting into table cells failing if cell has trailing space.</li>\n<li>Fix IME input on the line before a table causing extra newline characters to be inserted.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":8,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":2,"day":22},"info":"<ul>\n<li>Obsidian now requires either Android 5.1+ or iOS 13+ to run.</li>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-02-22-desktop-v1.5.8/\">Obsidian Desktop v1.5.8</a>.</li>\n<li>Added support for the new table editor.</li>\n<li>The mobile quick action (the pull-down gesture) can now be disabled.</li>\n<li>Switching tabs via mobile navbar should focus the new tab.</li>\n<li>The mobile drawer will now show &quot;no file&quot; in the right mobile drawer header instead of the last opened file.</li>\n<li>Fixed &quot;Toggle left sidebar&quot; and &quot;Toggle right sidebar&quot; not working on mobile.</li>\n<li>It's no longer possible for phones to load stacked tabs. The &quot;Toggle stacked tabs&quot; command is no longer shown in the command palette and loading a workspace with stacked tabs will unstack them on devices that don't support stacked tabs.</li>\n<li>It's now possible to delete tables by placing the cursor after the table and pressing backspace.</li>\n<li>iOS: Fixed bug where selecting all the text in a table cell and pressing backspace would not clear the cell.</li>\n<li>iOS: Fixed indentation guide markers not aligning properly in source mode.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":8,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":2,"day":22},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Added RTL text support.</li>\n<li>Tables are now automatically formatted as you type. This means columns will now render cleanly in source mode.</li>\n<li>Tables will no longer break when typing in the line preceding a table widget.</li>\n<li>The paragraph submenu is now disabled inside the table context menu.</li>\n<li>Typing &quot;---&quot; will no longer autocomplete inside a table cell.</li>\n<li>Fixed issue where long horizontal tables would lose their scroll position on edit.</li>\n<li>Fixed issue where right-clicking inside a table would cause multiple context menus to appear.</li>\n<li>Lots of small fixes to how we handle editing text adjacent to tables.</li>\n<li>Fixed table not always getting focused when using &quot;Insert table&quot; command.</li>\n<li>Fixed issue where undo/redo would put cursor in wrong position.</li>\n<li>You can now press backspace after a table to select the table. Pressing backspace again will delete the table.</li>\n<li>You can now click links and tags inside table cells.</li>\n</ul>\n<h3>Editing</h3>\n<ul>\n<li>Formatting commands now recognize <code>_</code> for italic and <code>__</code> for bold.</li>\n<li>Fixed issue where &quot;Copy&quot; would not work in a file where a PDF was embedded.</li>\n<li>&quot;Quick font size adjustment&quot; is now disabled by default.</li>\n<li>Fixed some weird behavior with &quot;Toggle comment&quot; command when it was used next to other comments.</li>\n<li>It's no longer possible to accidentally edit text inside a fold. Navigating into a fold will automatically open the fold.</li>\n<li>&quot;Close&quot; has been moved to the top in the tab menu.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Sync: When viewing your remote vaults inside Obsidian, you can now see the total storage space used by each vault.</li>\n<li>Improvements for indented text and lists in Live Preview.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The focused item in the File Explorer will now hide after opening a file.</li>\n<li>Fixed the appearance of the embedded backlinks for right-to-left interfaces.</li>\n<li>Pressing <code>Home</code> when editing a table in source mode will now always go to the beginning of the line.</li>\n<li>Fixed issue where Canvas would fail to render if a zero-byte image file was embedded on the canvas.</li>\n<li>Fixed issue where files would fail to save when navigating between files at the same time the properties are being edited.</li>\n<li>Fixed Live Preview issue where tokens inside Markdown code blocks will no longer get parsed and rendered.</li>\n<li>Fixed Outgoing links &quot;link&quot; button missing for unresolved links.</li>\n<li>Fixed &quot;copy&quot; button inside Sync History not working.</li>\n<li>Fixed Outline view not showing leading numerics.</li>\n<li>Fixed page preview sometimes getting triggered when mouse is not hovering over the app.</li>\n<li>Fixed issue where Backlinks view would incorrectly render links if they are on the same line as an embed.</li>\n<li>We have reverted the changes to how lists are displayed in Live Preview. They will be formatted how they were in v1.4.</li>\n<li>Fixed <code>Enter</code>, <code>F2</code>, and <code>Command + ArrowDown</code> not working when File Explorer is focused. <code>Enter</code> should now open the focused file on Linux and Windows and rename the file on macOS. <code>F2</code> will rename the focused folder/file. And <code>Command + ArrowDown</code> will open the focused file on macOS.</li>\n<li>Editing a ordered checklist (i.e. <code>1. [ ]</code>) will no longer cause the checkboxes to get wiped out.</li>\n</ul>\n<h3>macOS</h3>\n<ul>\n<li>Double-clicking on the sidebar tabs will no longer trigger &quot;maximize window.&quot;</li>\n<li>Fixed <code>View → Source Mode</code> and <code>View → Reading View</code> app menu items getting out of sync with the app.</li>\n<li>Fixed issue where dragging and dropping screenshots into Obsidian would produce broken links.</li>\n</ul>\n<h3>Vim</h3>\n<ul>\n<li>Fixed issue where the Vim cursor got out of sync with the app cursor. This made it possible to accidentally edit Properties inside Vim mode.</li>\n<li>The Vim cursor will now be hidden if the editor is not focused.</li>\n<li>Restyled the Vim normal mode command panel.</li>\n</ul>\n<h3>Developers</h3>\n<ul>\n<li>The installer has been updated to Electron v28.2.3. For macOS, Catalina 10.15 or higher is now required to run.</li>\n<li>See the <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/CHANGELOG.md#v157\">API Changelog</a> for a list of API updates.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":2,"day":21},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed properties not appearing when navigating from a file that has the same properties.</li>\n<li>Fixed <code>Home</code> and <code>End</code> not always navigating to the top and bottom of the document.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":7,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":2,"day":20},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-02-20-desktop-v1.5.7/\">Obsidian Desktop v1.5.7</a>.</li>\n<li>Fixed indentation guide markers not aligning properly in source mode on iOS.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":2,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed links in properties not getting renamed updated when the file is renamed.</li>\n<li>Fixed Obsidian hanging while scrolling through long files if certain plugins that affect Live Preview are enabled.</li>\n<li>Fixed scroll jumping when typing inside a narrow pane.</li>\n<li>Fixed issue where Canvas would fail to render if a zero-byte image file was embedded on the canvas.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":6,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":2,"day":16},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-02-16-desktop-v1.5.6/\">Obsidian Desktop v1.5.6</a>.</li>\n<li>Fixed indentation guide markers not aligning properly in source mode on iOS.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":2,"day":16},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Fixed table not always getting focused when using &quot;Insert table&quot; command.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where pressing &quot;Use Live Version&quot; of a binary file in Obsidian Publish would corrupt the file on disk.</li>\n<li>Fixed race condition where properties would fail to save when navigating between files at the same time.</li>\n<li>The focused item in the File Explorer will now hide after opening a file.</li>\n<li>Fixed visual block selection in Vim mode.</li>\n<li>Fixed bug with our <code>processFrontMatter</code> API not properly saving properties to a file that didn't previously have properties. This might have impacted plugins.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":5,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":2,"day":13},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-02-13-desktop-v1.5.5/\">Obsidian Desktop v1.5.5</a>.</li>\n<li>It's now possible to delete tables by placing the cursor after the table and pressing backspace.</li>\n<li>iOS: Fixed bug where selecting all the text in a table cell and pressing backspace would not clear the cell.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":2,"day":13},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Fixed brief flash when editing RTL tables.</li>\n<li>Fixed issue where undo/redo would put cursor in wrong position.</li>\n<li>You can now press backspace after a table to select the table. Pressing backspace again will delete the table.</li>\n<li>Fixed issue where editing a large table would cause spaces to unexpected get deleted.</li>\n<li>Fixed issue causing autosuggests inside table cells to sometimes not appear.</li>\n<li>You can now click links and tags inside table cells.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Sync: When viewing your remote vaults inside Obsidian, you can now see the total storage space used by each vault.</li>\n<li>Improvements for indented text and lists in Live Preview.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the appearance of the embedded backlinks for right-to-left interfaces.</li>\n<li>Fixed sidebar views missing a &quot;close&quot; button.</li>\n<li>Pressing <code>Home</code> when editing a table in source mode will now always go to the beginning of the line.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":4,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":2,"day":6},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2024-02-06-desktop-v1.5.4/\">Obsidian Desktop v1.5.4</a>.</li>\n<li>Added support for the new table editor.</li>\n<li>The mobile quick action (the pull-down gesture) can now be disabled.</li>\n<li>Switching tabs via mobile navbar should focus the new tab.</li>\n<li>The mobile drawer will now show &quot;no file&quot; in the right mobile drawer header instead of the last opened file.</li>\n<li>Fixed &quot;Toggle left sidebar&quot; and &quot;Toggle right sidebar&quot; not working on mobile.</li>\n<li>It's no longer possible for phones to load stacked tabs. The &quot;Toggle stacked tabs&quot; command is no longer shown in the command palette and loading a workspace with stacked tabs will unstack them on devices that don't support stacked tabs.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":2,"day":6},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Added RTL text support.</li>\n<li>Tables are now automatically formatted as you type. This means columns will now render cleanly in source mode.</li>\n<li>Tables will no longer break when typing in the line preceding a table widget.</li>\n<li>The paragraph submenu is now disabled inside the table context menu.</li>\n<li>Typing &quot;---&quot; will no longer autocomplete inside a table cell.</li>\n<li>Fixed issue where long horizontal tables would lose their scroll position on edit.</li>\n<li>Fixed issue where right-clicking inside a table would cause multiple context menus to appear.</li>\n<li>Lots of small fixes to how we handle editing text adjacent to tables.</li>\n</ul>\n<h3>Editing</h3>\n<ul>\n<li>Formatting commands now recognize <code>_</code> for italic and <code>__</code> for bold.</li>\n<li>Fixed issue where &quot;Copy&quot; would not work in a file where a PDF was embedded.</li>\n<li>&quot;Quick font size adjustment&quot; is now disabled by default.</li>\n<li>Fixed some weird behavior with &quot;Toggle comment&quot; command when it was used next to other comments.</li>\n<li>It's no longer possible to accidentally edit text inside a fold. Navigating into a fold will automatically open the fold.</li>\n<li>&quot;Close&quot; has been moved to the top in the tab menu. Previously it would show below &quot;Close all&quot; and &quot;Close others.&quot;</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Live Preview issue where tokens inside markdown code blocks will no longer get parsed and rendered.</li>\n<li>Fixed Outgoing links &quot;link&quot; button missing for unresolved links.</li>\n<li>Fixed issue where bookmarks would be hidden or missing from the Bookmarks view.</li>\n<li>Fixed &quot;copy&quot; button inside Sync History not working.</li>\n<li>Fixed issue where dragging and dropping screenshots into Obsidian would produce broken links.</li>\n<li>Fixed Outline view not showing leading numerics.</li>\n<li>Fixed page preview sometimes getting triggered when mouse is not hovering over Obsidian.</li>\n<li>Fixed issue where Backlinks view would incorrectly render links if they are on the same line as an embed.</li>\n<li>We have reverted the changes to how lists are displayed in Live Preview. They will be formatted how they were in v1.4.</li>\n<li>Fixed <code>Enter</code>, <code>F2</code>, and <code>Cmd+ArrowDown</code> not working when File Explorer is focused. Enter should now open the focused file on linux/win and rename the file on macOS. F2 will rename the focused folder/file. And <code>Cmd+ArrowDown</code> will open the focused file on macOS.</li>\n<li>Editing a ordered checklist (i.e. <code>1. [ ]</code>) will no longer cause the checkboxes to get wiped out.</li>\n</ul>\n<h3>macOS</h3>\n<ul>\n<li>Double-clicking on the sidebar tab items will no longer trigger &quot;maximize window.&quot;</li>\n<li>Fixed <code>View → Source Mode</code> and <code>View → Reading View</code> app menu items getting out of sync with the app.</li>\n</ul>\n<h3>Vim</h3>\n<ul>\n<li>Fixed issue where vim cursor got out of sync with the Obsidian cursor. This made it possible to accidentally edit Properties inside vim mode.</li>\n<li>The vim cursor will now be hidden if the editor is not focused (good bye red box!)</li>\n<li>Restyled the Vim normal mode command panel.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":12,"day":26},"info":"<h2>Shiny new things</h2>\n<p>Introducing a brand new editor for Markdown tables. Table rows and columns are now easier to create, edit, sort, reorder, select, copy, and paste. These new table features can also be accessed via context menu, command palette, and hotkeys. Tables are still saved to plain text Markdown.</p>\n<p><video src=\"https://user-images.githubusercontent.com/693981/284392728-eeb5609f-0622-4a3b-b514-c35993703fa7.mp4\"  autoplay=\"true\" muted=\"muted\" style=\"max-height:400px; min-height: 200px\" class=\"rounded-lg\"></video></p>\n<p>To add a table to a note, right click and choose <em>Insert → Table</em>, or use the command palette.</p>\n<p>Once you insert a table, you can add new columns and rows by clicking on the sides of the table. Add text with inline formatting. Press <code>tab</code> to navigate between cells.</p>\n<h2>Improvements</h2>\n<h3>Properties</h3>\n<ul>\n<li>Properties can now be renamed globally. Renaming will cause the property to be modified in each corresponding file and the search is case-insensitive.</li>\n<li>Global Search: Search now works with non-string property values. Search for boolean values <code>[property:TRUE]</code> or <code>[property:FALSE]</code> or empty values <code>[property:EMPTY]</code>. You can also use inequality operators to search for things like <code>[some_property:&gt;10]</code>.</li>\n<li>Global properties view can now be filtered.</li>\n</ul>\n<h3>Editing experience</h3>\n<ul>\n<li>New formatting menu. You can now right click in the editor to change text formatting, paragraph styles, and insert elements such as lists and tables.</li>\n<li>Right-click on a callout to quickly change the callout type from a list of default callout type options.</li>\n<li>Pressing <code>Tab</code> when the <code>#</code> autocomplete is active will autocomplete the highlighted suggestion. If the highlighted suggestion has a <code>/</code> in it, like &quot;#projects/in-review&quot;, <code>Tab</code> will autocomplete by <em>segment</em>, so &quot;#projects&quot; then press again to get &quot;/in-review&quot;.</li>\n</ul>\n<h3>Sync</h3>\n<ul>\n<li>When viewing the version history for a file, changes made by the same user on the same device will now be grouped together. And Markdown will be rendered to more closely match reading mode.</li>\n<li>Number of vaults has increased from 5 to 10</li>\n<li>Maximum file size has increased from 100MB to 200MB</li>\n</ul>\n<p><img src=\"https://github.com/obsidianmd/obsidian-help/assets/10565871/bf2334dd-6add-4dfa-9adb-67ff183746ec\" alt=\"Sync version history\"></p>\n<h3>Quality of life</h3>\n<ul>\n<li>The Outline view now has a &quot;collapse all&quot; button as well as a search field for filtering the list of headings in the file.</li>\n<li>Files from outside Obsidian can now be dropped anywhere in the File Explorer pane instead of on top of the vault name. Similarly, dropping a file on top of any item in a folder will cause the file to get imported into that particular folder.</li>\n<li>Pressing <code>Ctrl/Command-F</code> in any view with a search input (including Backlinks or Properties) will now focus the search input.</li>\n<li>Menu options within the <code>...</code> pane menu (the <code>...</code> in the tab header) as well as the tab menu (right clicking on a tab) have been cleaned up and should now show more relevant options.</li>\n<li>Copy, cut, and paste items in the Bookmarks view (works via hotkey only currently).</li>\n<li>Bookmarks: Removed the &quot;Bookmark this block...&quot; context menu item.</li>\n<li>Added new &quot;Show trash&quot; command to open the .trash folder in filesystem.</li>\n<li>The Appearance section in settings has been reordered for clarity.</li>\n</ul>\n<h3>Onboarding</h3>\n<ul>\n<li>Obsidian will now use the system setting for light or dark mode by default, you can change this in Appearance settings.</li>\n<li>Improved the experience when creating a new vault from scratch. If you select &quot;Create new vault,&quot; the created vault will include a <code>welcome.md</code> file and show a side-by-side view with the Graph view.</li>\n</ul>\n<h3>Bug fixes</h3>\n<ul>\n<li>The active context menu is now automatically dismissed when the view navigates away or a dialog appears.</li>\n<li>Clicking 'New file' on an empty tab should open the new file in the current tab instead of creating a new one.</li>\n<li>Properties: Fixed issue where properties view sometimes displayed a stale value when switching between files.</li>\n<li>Properties: Fixed bug where pressing the left arrow key (<code>←</code>) the start the input would cause the input to lose focus.</li>\n<li>Word count and character count status bar items now ignore frontmatter.</li>\n<li>Bookmarks: Fixed several edge cases where drag and drop would fail to work, including dragging an item to the bottom of the bookmark list.</li>\n<li>Fixed bug where canceling a drag would not cause the actively hovered element to remove its styling.</li>\n<li>Unclosed <code>[[</code> will no longer cause the next line to get rendered as a link.</li>\n<li>Updated &quot;Auto pair brackets&quot; behavior so that <code>[[link]]'s</code> can be typed without the apostrophe getting paired.</li>\n<li>Hover preview is no longer positioned on top of the cursor or target element if there isn't enough room to display the preview box.</li>\n<li>Editor selection no longer loses focus when resizing a tab group.</li>\n<li>Search: Minor tweak to avoid the content shifting a lot as the search counter ticks upward.</li>\n<li>Vim: Fixed issue with character movements not respective atomic ranges.</li>\n<li>Vim: Fixed issue where <code>O</code> on the first line of a file with properties would put the cursor in the wrong position.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>As of 1.5.0, the <a href=\"https://obsidian.md/blog/goodbye-legacy-editor/\">Legacy editor has been completely removed</a> from Obsidian.</li>\n<li><a href=\"https://docs.obsidian.md/Reference/CSS+variables/Editor/Table\">New CSS table variables for selection and dragging</a></li>\n</ul>\n<h2>Breaking changes</h2>\n<ul>\n<li>File Explorer and Tags pane both received a small code refactor. This might affect some plugins that rely on the internal JS structure. Themes should not be affected.</li>\n<li>Tags can no longer end in a <code>/</code>.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":5,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":12,"day":12},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>Triple-click in a table cell to select the whole table.</li>\n<li>Clicking on the drag-indicators is now a quick way to select the entire row or column.</li>\n<li>Improved performance of the table editor when rendering large tables.</li>\n<li>&quot;Insert template&quot; now works within table cells.</li>\n<li>Dragging rows and columns in the table will now move the row/column instead of swapping it.</li>\n</ul>\n<h3>Editor</h3>\n<ul>\n<li>We have overhauled our formatting commands (e.g. &quot;Toggle bold&quot;). The commands now support multiple-cursors, work across multiple lines, works with table selections, and even detect existing formatting in the selection and &quot;intelligently&quot; places the formatting characters without breaking the document formatting.</li>\n<li>There is a new &quot;Format&quot; submenu when you right-click in a Markdown document to easily toggle the inline formatting for the current text selection.</li>\n<li>New &quot;Clear formatting&quot; command to remove inline formatting from the current selection</li>\n</ul>\n<h3>Outline</h3>\n<ul>\n<li>The Outline view now has a &quot;collapse all&quot; button as well as a search field for filtering the list of headings in the file.</li>\n<li>The view is now registered with the &quot;Page preview&quot; core plugin. Preview individual headings in the note on hover.</li>\n</ul>\n<h3>Settings</h3>\n<ul>\n<li>We've done some shuffling around in the settings.\n<ul>\n<li>&quot;About&quot; has been renamed to &quot;General&quot; and is now first in the list.</li>\n<li>&quot;About → Advanced&quot; Section has been removed.</li>\n<li>&quot;About → Disable GPU&quot; has been moved to Appearance.</li>\n<li>&quot;About → Override config folder&quot; has been moved to Files and Links.</li>\n</ul>\n</li>\n</ul>\n<h3>Sync</h3>\n<ul>\n<li>When viewing the version history for a file, changes made by the same user on the same device will now be grouped together. And Markdown will be rendered to more closely match reading mode.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Reorganized the menu when right-clicking on a folder in the file explorer.</li>\n<li>New &quot;Search in folder&quot; menu item when right-clicking on a folder</li>\n<li>Improved appearance of inline code when it soft-wraps to the next line.</li>\n<li>New css class for order-list-number (<code>.formatting-list-ol</code>).</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Search operators such as <code>file:</code> and <code>path:</code> are now case-insensitive. So you can use &quot;FILE:&quot; or &quot;PATH:&quot; now.</li>\n<li>Outgoing links: Fixed issue where unresolved block links would render as an empty row in outgoing links view.</li>\n<li>Fixed issue where links with custom display text (i.e. <code>[[link|alias]]</code>) would render incorrectly after a table.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":11,"day":29},"info":"<h2>Improvements</h2>\n<h3>Tables</h3>\n<ul>\n<li>New buttons to quickly add a new column or row.</li>\n<li>Sorting table columns now ignores formatting characters.</li>\n<li>There's now a smaller minimum width for table cells.</li>\n</ul>\n<p><img src=\"https://github.com/obsidianmd/obsidian-api/assets/693981/2788bf9f-9e90-49f7-9bce-685e898c6607\" alt=\"quickly add table row or column\"></p>\n<h3>General</h3>\n<ul>\n<li>The currently active heading will be highlighted in the Outline view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On macOS, the area around the traffic light buttons is now draggable.</li>\n<li>Fixed drag-and-drop in the bookmarks view failing if you have a long list of bookmarks.</li>\n<li>Fixed not being able to reorder table rows when line numbers is enabled.</li>\n<li>Fixed the file explorer not remembering what folders are folded.</li>\n<li>Fixed the &quot;Insert internal link&quot; command causing the cursor to go to the end of the table.</li>\n<li>Fixed tables sometimes showing multiple text selections.</li>\n<li>The <em>diff</em> view inside Sync History is now scrollable.</li>\n<li>Fixed <code>x</code> motion in Vim mode being able to delete newlines.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":5,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":11,"day":20},"info":"<h2>Shiny new things</h2>\n<p>Brand new editor for Markdown <strong>tables</strong>. Table rows and columns are now easier to create, edit, sort, reorder, select, copy, and paste. These new table features can also be accessed via context menu, command palette, and hotkeys. Tables are still saved to plain text Markdown.</p>\n<p><video src=\"https://user-images.githubusercontent.com/693981/284392728-eeb5609f-0622-4a3b-b514-c35993703fa7.mp4\"  autoplay=\"true\" muted=\"muted\" style=\"max-height:400px; min-height: 200px\" class=\"rounded-lg\"></video></p>\n<h2>Improvements</h2>\n<h3>Onboarding experience</h3>\n<ul>\n<li>Obsidian will now use the system setting for light or dark mode by default, you can change this in Appearance settings.</li>\n<li>Improved the experience when creating a new vault from scratch. If you select &quot;Create new vault,&quot; the created vault will include a <code>welcome.md</code> file and show a side-by-side view with the Graph view.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Properties can now be renamed globally. Renaming will cause the property to be modified in each corresponding file and the search is case-insensitive.</li>\n<li>Global Search: Search now works with non-string property values. Search for boolean values <code>[property:TRUE]</code> or <code>[property:FALSE]</code> or empty values <code>[property:EMPTY]</code>. You can also use inequality operators to search for things like <code>[some_property:&gt;10]</code>.</li>\n<li>Global properties view can now be filtered.</li>\n</ul>\n<h3>Editing experience</h3>\n<ul>\n<li>Live Preview: Right-click on a callout to quickly change the callout type from a list of default callout type options.</li>\n<li>Numbered list markers are now right-aligned in editing mode.</li>\n<li>Pressing <code>Tab</code> when the <code>#</code> autocomplete is active will autocomplete the highlighted suggestion. If the highlighted suggestion has a <code>/</code> in it, like &quot;#projects/in-review&quot;, <code>Tab</code> will autocomplete by <em>segment</em>, so &quot;#projects&quot; then press again to get &quot;/in-review&quot;.</li>\n</ul>\n<h3>Quality of life</h3>\n<ul>\n<li>Files from outside Obsidian can now be dropped anywhere in the File Explorer pane instead of on top of the vault name. Similarly, dropping a file on top of any item in a folder will cause the file to get imported into that particular folder.</li>\n<li>Pressing <code>Ctrl/Command-F</code> in any view with a search input (including Backlinks or Properties) will now focus the search input.</li>\n<li>Menu options within the <code>...</code> pane menu (the <code>...</code> in the tab header) as well as the tab menu (right clicking on a tab) have been cleaned up and should now show more relevant options.</li>\n<li>Copy, cut, and paste items in the Bookmarks view (works via hotkey only currently).</li>\n<li>Bookmarks: Removed the &quot;Bookmark this block...&quot; context menu item.</li>\n<li>Added new &quot;Show trash&quot; command to open the .trash folder in filesystem.</li>\n</ul>\n<h3>Bug fixes</h3>\n<ul>\n<li>The active context menu is now automatically dismissed when the view navigates away or a dialog appears.</li>\n<li>Clicking 'New file' on an empty tab should open the new file in the current tab instead of creating a new one.</li>\n<li>Properties: Fixed issue where properties view sometimes displayed a stale value when switching between files.</li>\n<li>Properties: Fixed bug where pressing the left arrow key (<code>←</code>) the start the input would cause the input to lose focus.</li>\n<li>Word count and character count status bar items now ignore frontmatter.</li>\n<li>Bookmarks: Fixed several edge cases where drag and drop would fail to work, including dragging an item to the bottom of the bookmark list.</li>\n<li>Fixed bug where canceling a drag would not cause the actively hovered element to remove its styling.</li>\n<li>The Appearance section in settings has been reordered for clarity.</li>\n<li>Unclosed <code>[[</code> will no longer cause the next line to get rendered as a link.</li>\n<li>Updated &quot;Auto pair brackets&quot; behavior so that <code>[[link]]'s</code> can be typed without the apostrophe getting paired.</li>\n<li>Hover preview is no longer positioned on top of the cursor or target element if there isn't enough room to display the preview box.</li>\n<li>Editor selection no longer loses focus when resizing a tab group.</li>\n<li>Search: Minor tweak to avoid the content shifting a lot as the search counter ticks upward.</li>\n<li>Vim: Fixed issue with character movements not respective atomic ranges.</li>\n<li>Vim: Fixed issue where <code>O</code> on the first line of a file with properties would put the cursor in the wrong position.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>As of 1.5.0, the <a href=\"https://obsidian.md/blog/goodbye-legacy-editor/\">Legacy editor has been completely removed</a> from Obsidian.</li>\n<li>New CSS variables added:\n<ul>\n<li><code>--list-marker-align</code></li>\n<li><code>--list-marker-min-width</code></li>\n<li><code>--indentation-guide-editing-indent</code></li>\n<li><a href=\"https://docs.obsidian.md/Reference/CSS+variables/Editor/Table\">New table variables for selection and dragging</a></li>\n</ul>\n</li>\n</ul>\n<h2>Breaking changes</h2>\n<ul>\n<li>File Explorer and Tags pane both received a small code refactor. This might affect some plugins that rely on the internal JS structure. Themes should not be affected.</li>\n<li>Tags can no longer end in a <code>/</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":16,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2023,"month":10,"day":13},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2023-10-13-desktop-v1.4.16/\">Obsidian Desktop v1.4.16</a>.</li>\n<li>Fixed drag and drop handler on iOS causing the view to scroll. This affects properties, the mobile toolbar, and the font picker.</li>\n<li>Added a &quot;Create&quot; button to menus like the share menu.</li>\n<li>Updated formatting of share menu and fixed bug where it would fail to insert if current file was in reading mode.</li>\n<li>Lots of styling improvements for settings.</li>\n<li>Login screen no longer mentions requiring 2FA if it is not enabled on your account.</li>\n<li>Fixed bug where template properties wouldn't get applied if a value was <code>null</code>.</li>\n<li>Fixed issue where you could sometimes not add text after an image in Live Preview.</li>\n<li>iOS: Added new persistent &quot;Hide keyboard&quot; button to the mobile toolbar.</li>\n<li>Canvas: Fixed Canvas view not being focused on touch.</li>\n</ul>\n<h2>Phone-only Improvements</h2>\n<ul>\n<li>Suggestions will now appear inline below the cursor instead of attached to the keyboard.</li>\n<li>Closing app settings no longer causes double animation.</li>\n<li>Fixed loading bar when opening the community themes and community plugins directory.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":16,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":10,"day":13},"info":"<h2>Improvements</h2>\n<h3>Properties</h3>\n<ul>\n<li>List property elements can now be edited. Right-click the list item and choose &quot;Edit...&quot;.</li>\n</ul>\n<h3>General</h3>\n<ul>\n<li>The backlinks and word count status bar elements will be hidden if the active view does not support them.</li>\n<li>The icon for bookmarked files has been updated for clarity.</li>\n<li>Pressing <code>Enter</code> or <code>Tab</code> when the file titlebar is focused will not revert the filename if the new name is invalid. Instead, an error message will be shown and the titlebar will stay active.</li>\n<li>Improved layout of &quot;About&quot; settings tab.</li>\n</ul>\n<h2>No longer broken</h2>\n<h3>Properties</h3>\n<ul>\n<li>Fixed &quot;Show file properties&quot; command not working if the Graph view is focused.</li>\n<li>If frontmatter parsing fails, we will now always show a token where the parsing error is.</li>\n<li>Fixed issue where status bar element did not update when closing a file.</li>\n<li>Fixed issue where properties are invisible when dragging a tab.</li>\n<li>List properties will now properly handle empty rows in the frontmatter.</li>\n</ul>\n<h3>General</h3>\n<ul>\n<li>Triggering a command from the macOS Application menu will now un-minimize the vault if the window is minimized.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":14,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2023,"month":10,"day":10},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2023-10-10-desktop-v1.4.15/\">Obsidian Desktop v1.4.15</a>.</li>\n<li>iOS: Added new persistent &quot;Hide keyboard&quot; button to the mobile toolbar.</li>\n<li>Canvas: Fixed Canvas view not being focused on touch.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":15,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":10,"day":10},"info":"<h2>Improvements</h2>\n<h3>Properties</h3>\n<ul>\n<li>List property elements can now be edited. Right-click the list item and choose &quot;Edit...&quot;.</li>\n</ul>\n<h3>General</h3>\n<ul>\n<li>macOS: The &quot;more options&quot; icon on views will now be horizontal instead of vertical to match OS guidelines.</li>\n<li>The backlinks and word count status bar elements will be hidden if the active view does not support them.</li>\n<li>The icon for bookmarked files has been updated for clarity.</li>\n<li>Pressing <code>Enter</code> or <code>Tab</code> when the file titlebar is focused will not revert the filename if the new name is invalid. Instead, an error message will be shown and the titlebar will stay active.</li>\n<li>Improved layout of &quot;About&quot; settings tab.</li>\n</ul>\n<h2>No longer broken</h2>\n<h3>Properties</h3>\n<ul>\n<li>Fixed &quot;Show file properties&quot; command not working if the Graph view is focused.</li>\n<li>If frontmatter parsing fails, we will now always show a token where the parsing error is.</li>\n<li>Fixed issue where status bar element did not update when closing a file.</li>\n<li>Fixed issue where properties are invisible when dragging a tab.</li>\n<li>List properties will now properly handle empty rows in the frontmatter.</li>\n</ul>\n<h3>Canvas</h3>\n<ul>\n<li>Fixed issue where navigating to files from a canvas would sometimes cause sidebar views to show empty results.</li>\n</ul>\n<h3>Bookmarks</h3>\n<ul>\n<li>The &quot;Bookmark this block&quot; command will now pre-populate the bookmark title with the currently selected text.</li>\n<li>Dragging a bookmark from the <em>bookmarks</em> view to the editor will include the subpath if there is one.</li>\n</ul>\n<h3>General</h3>\n<ul>\n<li>Tag suggestions will now be sorted alphabetically if there is no search query.</li>\n<li>Text selection will no longer be updated when the inline search input (<code>Ctrl/command + F</code>) loses focus.</li>\n<li>&quot;Split right&quot; and &quot;Split down&quot; commands will now copy the scroll position of the current leaf.</li>\n<li>Triggering a command from the macOS Application menu will now un-minimize the vault if the window is minimized.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":14,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":9,"day":26},"info":"<h2>No longer broken</h2>\n<h3>General</h3>\n<ul>\n<li>Formatting commands (e.g. &quot;Toggle bold&quot;) will now update the text selection to ignore leading and trailing whitespace.</li>\n<li>The suggest box in the Search view will no longer appear when reselecting the existing search query.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Added new indeterminate state to checkboxes.</li>\n<li>Pressing <em>arrow down</em> (↓) from the inline title should focus the note content if no properties exist.</li>\n<li>Fixed issue with inserting templates with properties failing to add new properties if the value is <code>null</code>.</li>\n<li>Right-click on links in properties now opens the link context menu.</li>\n</ul>\n<h3>Sync</h3>\n<ul>\n<li>Fixed a Sync bug that in rare cases could cause file duplication when editing a file and then immediately renaming it.</li>\n<li>Property types will now be counted &quot;Main settings&quot; in the sync preferences.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":12,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2023,"month":9,"day":22},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://obsidian.md/changelog/2023-09-22-desktop-v1.4.14/\">Obsidian Desktop v1.4.14</a>. This includes the new properties editor.</li>\n<li>Fixed drag and drop handler on iOS causing the view to scroll. This affects properties, the mobile toolbar, and the font picker.</li>\n<li>The suggest component is now inline on mobile instead of attached to the keyboard.</li>\n<li>Added a &quot;create&quot; button to menus like the share menu.</li>\n<li>Updated formatting of share menu and fixed bug where it would fail to insert if current file was in reading mode.</li>\n<li>Lots of styling improvements for settings.</li>\n<li>Login screen no longer mentions requiring 2FA if it is not enabled on your account.</li>\n<li>Fixed bug where template properties wouldn't get applied if a value was <code>null</code>.</li>\n<li>Fixed issue where you could sometimes not add text after an image in Live Preview.</li>\n</ul>\n<h2>Phone-only Improvements</h2>\n<ul>\n<li>Closing app settings no longer causes double animation.</li>\n<li>Fixed loading bar when opening the community themes and community plugins directory.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":9,"day":22},"info":"<h2>No longer broken</h2>\n<h3>General</h3>\n<ul>\n<li>Formatting commands (e.g. &quot;Toggle bold&quot;) will now update the text selection to ignore leading and trailing whitespace.</li>\n<li>The suggest box in the Search view will no longer appear when reselecting the existing search query.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Added new indeterminate state to checkboxes.</li>\n<li>Pressing <em>arrow down</em> (↓) from the inline title should focus the note content if no properties exist.</li>\n<li>Fixed issue with inserting templates with properties failing to add new properties if the value is <code>null</code>.</li>\n<li>Right-click on links in properties now opens the link context menu.</li>\n</ul>\n<h3>Sync</h3>\n<ul>\n<li>Fixed a Sync bug that in rare cases could cause file duplication when editing a file and then immediately renaming it.</li>\n<li>Property types will now be counted &quot;Main settings&quot; in the sync preferences.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":13,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":9,"day":15},"info":"<p>The installer has been updated to Electron v25.8.1 to address several vulnerabilities. To update, you must manually get the latest installer from <a href=\"https://obsidian.md/download\">https://obsidian.md/download</a>.</p>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":12,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":9,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed edits from source mode not properly updating the properties editor interface.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":11,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":9,"day":11},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: Fixed issue preventing Canvas cards from entering edit mode.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":10,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":9,"day":11},"info":"<h2>Improvements</h2>\n<h3>Editor</h3>\n<ul>\n<li>Empty lines before the frontmatter block are no longer allowed. Previously this was supported by some parts of the app and ignored by others.</li>\n<li>Adding inline formatting to text will now ignore whitespace at the start and end of the selection.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Date &amp; time fields now include seconds.</li>\n<li>Added command to fold properties.</li>\n<li>When toggling &quot;Properties view&quot; core plugin the core plugin will immediately open the &quot;All properties&quot; view.</li>\n<li>Added a tooltip when hovering over property names in case the property name is too long and gets cut off.</li>\n<li>Sidebar view now indicates if file properties are invalid.</li>\n<li>Right-click on the properties heading to quickly add a property or clear the properties from the file.</li>\n<li>If your file properties cannot be parsed, the exact spot where there YAML is invalid is now highlighted.</li>\n</ul>\n<h2>No longer broken</h2>\n<h3>General</h3>\n<ul>\n<li>Fixed &quot;Reveal in Finder&quot; hanging for a long time on macOS.</li>\n<li>Files specified in the &quot;Excluded files&quot; setting will no longer be counted in the Tags view or Properties view.</li>\n<li>Fixed &quot;Replace&quot; button in find/replace not highlighting the next match.</li>\n<li>Fix stacked tabs not scroll into view when first activated.</li>\n</ul>\n<h3>Properties</h3>\n<ul>\n<li>Fixed bug where editing properties in reading mode would cause changes made in edit mode to be reverted.</li>\n<li>Fixed the <em>All Properties</em> view sometimes jumping around when editing notes.</li>\n<li>Fixed issue where properties editor would sometimes produce invalid frontmatter when editing.</li>\n<li>Fixed Tag suggest not showing suggestions if the input starts with <code>#</code>.</li>\n<li>Fixed properties status bar item not updating if the properties sidebar was not open.</li>\n<li>Fixed more edge cases where frontmatter would temporarily appear when modifying properties.</li>\n<li>The &quot;Add file property&quot; menu item will no longer be disabled in reading mode.</li>\n<li>Fixed duplicate keys being suggested in property name input fields.</li>\n<li>Fixed &quot;Unassign type&quot; not working for properties with capital letters.</li>\n<li>It is no longer possible to unassign the type for default properties (<code>cssclasses</code>, <code>tags</code>, <code>aliases</code>).</li>\n<li>Fixed issue where the arrow keys would jump from the editor to properties editor even if the cursor isn't on the first line of the file.</li>\n<li>Pressing <kbd>escape</kbd> when property name input is focused now properly reverts the changes.</li>\n<li>Renaming a list property will no longer cause a type mismatch warning to appear.</li>\n<li>Clicking outside of the property editor will remove the empty property section for the note if there is one.</li>\n<li>Fixed &quot;type mismatch&quot; tooltip sometimes showing the wrong expected type.</li>\n<li>Fixed <code>cssclasses</code> sometimes staying applied to the current view after switching to a new file.</li>\n</ul>\n<h3>Search</h3>\n<ul>\n<li>Fixed <code>file:</code> queries showing wrong matches when composed with other search operators.</li>\n<li>Fixes results for <code>file:</code> queries highlighting the wrong text.</li>\n</ul>\n<h3>Other plugins</h3>\n<ul>\n<li>Outline: Fixed outline view scroll position getting reset when editing a longer document.</li>\n<li>Note composer: Improved behavior for merging frontmatter if note contains nested YAML properties or invalid frontmatter.</li>\n<li>Sync: Fixed app freezing for very large vaults sometimes.</li>\n</ul>\n<h3>Fixed since last insider build</h3>\n<ul>\n<li>Fixed properties sidebar view not showing &quot;Add properties&quot; button if the active file has no properties yet.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":9,"day":7},"info":"<h2>Improvements</h2>\n<ul>\n<li>Properties: Added a tooltip when hovering over property names in case the property name is too long and gets cut off.</li>\n<li>Properties: Sidebar view now indicates if file properties are invalid.</li>\n<li>Properties: Right-click on the properties heading to quickly add a property or clear the properties from the file.</li>\n<li>Frontmatter: If your file properties cannot be parsed, the exact spot where there YAML is invalid is now highlighted.</li>\n<li>Editor: Adding inline formatting to text will now ignore whitespace at the start and end of the selection.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Live Preview: Fixed not being able to edit properties if &quot;Show properties as source&quot; was enabled or if the frontmatter was invalid.</li>\n<li>Live Preview: Fixed issue where the arrow keys would jump from the editor to properties editor even if the cursor isn't on the first line of the file.</li>\n<li>Properties: Pressing 'escape' when property name input is focused now properly reverts the changes.</li>\n<li>Properties: Renaming a list property will no longer cause a type mismatch warning to appear.</li>\n<li>Properties: Clicking outside of the property editor will remove the empty property section for the note if there is one.</li>\n<li>Properties: Fixed &quot;type mismatch&quot; tooltip sometimes showing the wrong expected type.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":9,"day":5},"info":"<h2>Improvements</h2>\n<ul>\n<li>Properties: New behavior when toggling &quot;Properties view&quot; core plugin. Enabling the core plugin will immediately open the &quot;All properties&quot; view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed properties status bar item not updating if the properties sidebar was not open.</li>\n<li>Live Preview: Fixed more edge cases where frontmatter would temporarily appear when modifying properties.</li>\n<li>Live Preview: Fixed issue where sometimes the property editor would insert an extra newline character.</li>\n<li>The &quot;Add file property&quot; menu item will no longer be disabled in reading mode.</li>\n<li>Properties: Fixed duplicate keys being suggested in property name input fields.</li>\n<li>Properties: Fixed &quot;Unassign type&quot; not working for properties with capital letters.</li>\n<li>Properties: It is no longer possible to unassign the type for default properties (<code>cssclasses</code>, <code>tags</code>, <code>aliases</code>).</li>\n<li>Files specified in the &quot;Excluded files&quot; setting will no longer be counted in the Tags view or Properties view.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":9,"day":2},"info":"<h2>Improvements</h2>\n<ul>\n<li>Live Preview: Notes can no longer include empty lines before the frontmatter block. If the frontmatter block does not start on the first line of the note, we will interpret it as regular text.</li>\n<li>Properties: Date &amp; time fields now include seconds.</li>\n<li>Added command to fold properties.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Properties: Fixed bug where editing properties in reading mode would cause changes made in edit mode to be reverted.</li>\n<li>Search: Fixed <code>file:</code> queries showing wrong matches when composed with other search operators.</li>\n<li>Search: Fixes results for <code>file:</code> queries highlighting the wrong text.</li>\n<li>Properties: Fixed the <em>All Properties</em> view sometimes jumping around when editing notes.</li>\n<li>Note composer: Improved behavior for merging frontmatter if note contains nested YAML properties or invalid frontmatter.</li>\n<li>Properties: Fixed issue where properties editor would sometimes produce invalid frontmatter when editing.</li>\n<li>Properties: Fixed Tag suggest not showing suggestions if the input starts with '#'.</li>\n<li>macOS: Fixed &quot;Reveal in Finder&quot; hanging for a long time.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":8,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2023,"month":8,"day":31},"info":"<p><strong>Note:</strong> Mobile Obsidian is still based on Obsidian Desktop v1.3.7.</p>\n<ul>\n<li>Added support for 2FA login.</li>\n<li>PDF: Fixed text selection.</li>\n<li>There is now a loading screen when loading the Obsidian Sync view.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":8,"day":31},"info":"<p>This update introduces Properties, a simple and durable way to add tags, links, dates, and other metadata to your notes. The core plugins Search, Templates, and Backlinks have all received upgrades to support Properties. Some of the new features in this release:</p>\n<ul>\n<li>A new UI for editing properties, with autocomplete for property names and values</li>\n<li>Properties can have types (e.g. text, list, date, number, checkbox) that make it faster to input data</li>\n<li>Properties can contain internal links to other notes</li>\n<li>New sidebar view lists all properties in your vault, and sort by name or frequency</li>\n<li>Keyboard navigation, commands, and hotkeys</li>\n<li>Search syntax for searching notes by property and value</li>\n<li>Templates automatically merge properties with existing properties in the note</li>\n<li>Data is still stored as YAML frontmatter at the top of each Markdown file. Metadata is automatically formatted as valid YAML.</li>\n</ul>\n<p>With this update you can also enable two-factor authentication for your Obsidian account.</p>\n<h2>Properties</h2>\n<img alt=\"Property Editor\" src=\"https://github.com/obsidianmd/obsidian-api/assets/693981/aea72173-5663-459d-83de-6ff888f6bdd5\">\n<p>Properties help you organize information about a note. Adding properties to a note helps you track structured data such as text, links, dates and numbers. Properties can also be used in combination with Community plugins that can do useful things with your structured data. <a href=\"https://help.obsidian.md/Editing+and+formatting/Properties\">Learn more.</a></p>\n<h3>Basic usage</h3>\n<p>To add a property to a note, you have several options:</p>\n<ul>\n<li>Use the <strong>Add file property</strong> command.</li>\n<li>Use the <strong><code>Cmd/Ctrl+;</code></strong> hotkey.</li>\n<li>Choose <strong>Add file property</strong> from the <strong>More actions</strong> menu (three dots icon) or right-clicking the tab.</li>\n<li>Type <code>---</code> at the very beginning of a file.</li>\n</ul>\n<p>Once you add a property, a row will appear at the top of the file with two inputs: the property <em>name</em> and the property <em>value</em>. Once you choose the property name you can give it a value and type.</p>\n<h3>Advanced usage</h3>\n<p>In addition to the inline property editor, there is a new <strong>Properties view</strong> core plugin that adds two new views for managing your properties:</p>\n<ul>\n<li><strong>All properties</strong> sidebar view shows a list of all the properties across your vault, and number of uses for each. Click on a property to search for all uses of it across your vault.</li>\n<li><strong>File properties</strong>  sidebar view shows the properties for the active file. If you prefer to hide the inline property editor, you can choose to edit your file properties from the sidebar, without losing your place in the active file.</li>\n</ul>\n<p>Properties are an extremely powerful yet flexible feature that gives you even more ways to organize your information. See the <a href=\"https://help.obsidian.md/Editing+and+formatting/Properties\">documentation for Properties</a> for even more information.</p>\n<h2>Two-factor authentication (2FA) for Obsidian accounts</h2>\n<p>For even more security, you can now enable two-factor authentication on your Obsidian account. To do so, go to <a href=\"https://obsidian.md/account\">obsidian.md/account</a> and enable &quot;2-factor authentication&quot;. This will prompt you with setup instructions.</p>\n<p><em>Note:</em> Any devices logging into Obsidian must be running v1.4.5+ to log-in using two-factor authentication.</p>\n<h2>Core plugin upgrades</h2>\n<ul>\n<li>Search: New <a href=\"https://help.obsidian.md/Plugins/Search#Search+properties\">search syntax</a> for properties.\n<ul>\n<li>To find notes containing a property, use [<em>property</em>]</li>\n<li>To find notes with a property and a corresponding value, use [<em>property</em>:<em>value</em>]</li>\n<li>Both property and value allow complex sub-queries, such as parentheses for grouping, the OR operator, double-quotes for exact matching, and regex.</li>\n</ul>\n</li>\n<li>Templates: When using the &quot;Insert template&quot; command, properties inside template files will be merged with the current file.</li>\n<li>Backlinks: Properties with links will now properly show in backlink entries.</li>\n<li>Note Composer: Merging notes will now merge their properties.</li>\n</ul>\n<h2>Misc. improvements</h2>\n<ul>\n<li>Search: Search autocomplete will now be shown based on the current input context.</li>\n<li>Live Preview now supports single column tables.</li>\n<li>Tag autocomplete now uses a fuzzy search algorithm.</li>\n<li>PDF: Added “Copy as quote” and “Copy annotation” context menu options</li>\n<li>PDF: Added a button to copy annotations from the annotation popup</li>\n<li>PDF: Added “Copy link to page” to PDF thumbnail context menu</li>\n<li>Editor: Formatting commands for <strong>bold</strong>, <em>italic</em>, etc are now context-aware. For example, &quot;Toggle bold&quot; inside a bolded sentence will un-bold the sentence.</li>\n<li>Search: Removed the delay between typing and search happening.</li>\n<li>Sync: Always show a visual representation of storage usage.</li>\n<li>Numbers everywhere should now be formatted in the app. For example, word count and character count will have thousands separators.</li>\n<li>The Tags core plugin has been renamed to &quot;Tags view&quot;.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed: PDF Viewer single page view resets to first page.</li>\n<li>Fixed: PDF viewer search settings unclickable when toggling sidebar.</li>\n<li>Fixed bug where closing an pop-out window with an active modal would keep the modal active.</li>\n<li>macOS: In frameless window mode, the top-right buttons no longer shift when creating/closing tab groups.</li>\n<li>File Recovery will now show a loading state when loading large vaults.</li>\n<li>Workspace: fix &quot;follow link under cursor&quot; commands in Canvas.</li>\n<li>Canvas: nudging selection should not cause stacked tabs to scroll.</li>\n<li>Outline: Fixed outline not rendering if the view was opened via the &quot;Show outline&quot; command.</li>\n<li>The &quot;New tab&quot; view will now show the current hotkeys.</li>\n<li>Editor: Scroll bar should no longer affect the position of the text when it appears on long documents.</li>\n<li>Vim: Fix for spellchecker.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The installer has been updated to use Electron v25.8.0 (requires downloading <a href=\"https://obsidian.md\">the latest installer</a>).</li>\n<li>Vault: createFolder now return a <code>TFolder</code>.</li>\n<li>Metadata: <code>FrontMatterCache</code> no longer inherits from <code>CacheItem</code>.</li>\n<li>Theming: <a href=\"https://docs.obsidian.md/Reference/CSS+variables/Editor/Properties\">new CSS variables</a> have been added for Properties that start with <code>--metadata</code></li>\n<li>Disabled soft line width in <code>stringifyYaml</code> (this was causing some breakages with other plugins reading the YAML).</li>\n</ul>\n<h3>About Properties</h3>\n<h4>Internal Links</h4>\n<p>Internal links can be added to frontmatter using the following syntax:</p>\n<pre><code class=\"language-yaml\">---\nlink: &quot;[[Link]]&quot;\nlinklist:\n  - &quot;[[Link]]&quot;\n  - &quot;[[Link2]]&quot;\n---\n</code></pre>\n<h4>About <code>tag</code>/<code>alias</code>/<code>cssclass</code> properties</h4>\n<p>As of 1.4.0, we have <strong>deprecated</strong> the &quot;tag&quot;, &quot;alias&quot;, and &quot;cssClass&quot; properties. The property editor will automatically convert these properties to <code>tags</code>, <code>aliases</code>, and <code>cssclasses</code> and the values will automatically be converted to lists.</p>\n<p>The old property names will still be identified correctly in the app, but the property editor will always prefer <code>tags</code>, <code>cssClasses</code>, and <code>aliases</code>.</p>\n","major_release":true}]