[{"version":{"major":0,"minor":10,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":1,"day":25},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now choose to show all files, even if Obsidian doesn't recognize the file extension. This will allow you to link to those files, see them in the File Explorer, and open them from the Quick Switcher.</li>\n<li>You can now use <code>&lt;iframe&gt;</code> to embed sites that previously wouldn't show. This is done by ignoring the <code>X-Frame-Options</code> that some websites use to prevent embedding.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now upload <code>favicon.ico</code> for Obsidian Publish.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Image embeds using the wikilink syntax <code>![[image.png]]</code> are now displayed inline instead of taking up a whole line by itself.</li>\n<li>In the custom domain setting for Obsidian Publish, you should now properly see what custom URL you've previously set.</li>\n<li>Sync will no longer delete ignored folders or media files uploaded by other machines.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The API <code>Plugin.registerExtensions()</code> will now allow the app to recognize the file extension without requiring the user to turn on the &quot;Detect all file extensions&quot; option. In combination with <code>Plugin.registerView()</code>, you can now create custom viewers or editors for any file type that we don't currently support.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Publish now supports custom domains, subdomains or a sub-folder of your website. For details, <a href=\"https://publish.obsidian.md/help/Licenses+%26+add-on+services/Obsidian+Publish#Custom+domain\">see the help docs</a>.</li>\n<li>There is now a button to copy heading links on Obsidian Publish.</li>\n<li>Global search now displays helpful tips on the various filters we support.</li>\n<li>Global search now has a way to clear the search history.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>PDF export settings are now persisted.</li>\n<li>There is now a button to update all plugins. In addition, installed plugins are now sorted alphabetically.</li>\n<li>Non-existing files are now properly displayed when there is a search filter for path applied, instead of completely removed.</li>\n<li>Mermaid has been upgraded to v8.8.4.</li>\n<li>Clicking on the backlink status bar item now opens the backlink pane.</li>\n<li>Opening the help vault will now open a translated version based on your selected language. Currently only supports Italian, Japanese, and Chinese. <a href=\"https://github.com/obsidianmd/obsidian-docs\">Help us translate the help vault to your favorite language</a>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The random note plugin no longer adds two ribbon icons.</li>\n<li>Hover preview now loads embedded search properly.</li>\n<li>Fixed uppercase block IDs not linking/embedding properly.</li>\n<li>Backlink panes now updates file titles correctly when a file is renamed.</li>\n<li>Opening a dialog no longer lets you accidentally focus or make modifications to the document behind the dialog.</li>\n<li>Pasting as HTML no longer copies over the text from <code>&lt;style&gt;</code> tags.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":8,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":11},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Publish can now restrict site access with one or multiple passwords.</li>\n<li>You can now choose to store attachments in the same folder as the current note, or in a subfolder relative to the current note.</li>\n<li>Huge PDF improvements:\n<ul>\n<li>PDF files will now render when embedded inside a note.</li>\n<li>PDF files are now rendered using a native PDF viewer, which can scroll, zoom, select and copy text.</li>\n<li>You can now link to a page of a PDF file by adding <code>#page=number</code> at the end. For example <code>[[My file.pdf#page=3]]</code>. This also works for embedded PDFs. Typing <code>#</code> while auto-completing a PDF file will automatically add <code>#page=</code> for you.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Folders now shows the number of files and subfolders when you hover over them.</li>\n<li>The hover tooltips for the file explorer has been reprimanded for being too eager to show up on time. They will now only display once you stop your mouse over it.</li>\n<li>An unlinked pinned outline pane will now attempt to open the file if it's not already open.</li>\n<li>Audio recorder will now generate file names with timestamps similar to pasted images.</li>\n<li>Word count has been improved to handle numbers better.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Changing active panes with hotkeys will now properly focus on them.</li>\n<li>Tooltips no longer leave behind a lingering line sometimes.</li>\n<li>Tooltips now appear on the correct side for backlinks and file explorer.</li>\n<li>The editor text should now always stay clear using subpixel-antialiasing, instead of jumping to blurry grayscale from time to time.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The <code>file-open</code> event is now fired in a debounced frame instead of synchronously running while the <code>activeLeaf</code> is being set.</li>\n<li>The <code>layout-ready</code> event will now only fire once when the app finish loading the workspace, instead of also triggering when loading a different workspace.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Tags can now be clicked on Obsidian Publish to show a list of other pages containing the same tag.</li>\n<li>You can now <code>Ctrl/Cmd</code> click tags in the tag pane to toggle them as a search filter, instead of replacing the search query.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now unlink and pin backlink, outline, or local graph panes to have them stay on the file that was open, instead of navigating along with the current active pane.</li>\n<li>Daily notes will now only check for the daily note inside the selected folder.</li>\n<li><code>tag:#mytag</code> will now always use case-insensitive mode, since tags are always insensitively matched. For case sensitive match, use a plain <code>#mytag</code> query instead.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Tags with underscore <code>_</code> will now auto-complete properly.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Tags are now case insensitive in graph view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The backlink pane should now scroll properly if it's not in the sidebar.</li>\n<li>The ugly flair for attachment file types is now properly styled in the file explorer.</li>\n<li>Internal links can now be selected again in preview.</li>\n<li>Folding headings in preview no longer causes the subsequent area to stay blank until the page is scrolled.</li>\n<li>Dragging and dropping text with a <code>:</code> character no longer creates a Markdown link.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":31},"info":"<h2>Improvements</h2>\n<ul>\n<li>Opening Obsidian with an <code>obsidian://</code> URI no longer opens all previously opened vaults.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Graph view controls should now be styled properly.</li>\n<li>Unexpected OS keys should no longer break the hotkeys panel.</li>\n<li>Tooltips will now properly stay on a single line if there's enough space.</li>\n<li>Tag pane should no longer blank out after collapsing or expanding parent tags.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>In the editor, <code>#parent/child</code> nested tags will only have <code>cm-hashtag-end</code> on the last piece of <code>&lt;span&gt;</code> when spellchecker breaks the tag into multiple pieces.</li>\n<li><code>MarkdownRenderChild</code> has been properly exported.</li>\n<li>Elements in the file explorer now has their file path encoded in a <code>data-path</code> attribute to facilitate custom CSS targeting.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":30},"info":"<h2>Improvements</h2>\n<ul>\n<li>Hotkeys has been once again reworked to use a &quot;semi&quot; layout independent mode. This should properly recognize remapped layouts like AZERTY and Dvorak, but still provide layout-independence from number and symbol keys.</li>\n<li>Remapped escape key (typically on caps lock) should now work again.</li>\n<li>If you've set any hotkeys in v0.10.2 or v0.10.3, you might need to reset them if they stopped working.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed tag pane sometimes not showing some nested tags depending on the sorting algorithm used.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Nested Tags: you can now nest tags with unlimited hierarchies using the syntax <code>#parent/child/subchild</code>.\n<ul>\n<li>Searching for <code>tag:#parent</code> will now match <code>#parent/child</code>.</li>\n<li>Tag pane now has an option to display nested tags in hierarchy or flat mode.</li>\n</ul>\n</li>\n<li>Search now has 3 more operators:\n<ul>\n<li><code>line:(...)</code> will perform the subquery on a line-by-line basis, rather than a file-by-file basis. For example, <code>line:(foo bar)</code> will only match <code>foo</code> and <code>bar</code> if they're on the same line.</li>\n<li><code>block:(...)</code> will perform the subquery on a block-by-block basis. This is expensive computationally as it requires parsing each file, which means this is likely slower than other modes.</li>\n<li><code>section:(...)</code> will perform the subquery on a section-by-section basis. A section starts from a heading and ends before the next heading.</li>\n</ul>\n</li>\n<li>Hotkeys have been completely revamped to always use keyboard layout independent mode.\n<ul>\n<li>This has caused confusion in the last version, so we've simplified the process.</li>\n<li>If you've customized hotkeys in the past, they will still work.</li>\n<li>All new hotkeys will be layout independent.</li>\n</ul>\n</li>\n<li>You can now drag and drop links to pane headers to open the link in a specific pane.</li>\n<li>You can now see created and modified time of files by hovering them in the file explorer.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li><code>Cmd+Shift+V</code> can now paste as plaintext on macOS, in addition to the previous <code>Cmd+Shift+Option+V</code> (seriously, who came up with this default hotkey?).</li>\n<li>You can now disable HTML to Markdown conversion on paste in Settings &gt; Editor.</li>\n<li>Hotkeys that are assigned multiple times are now displayed in red.</li>\n<li>Closing panes will re-focus on the most recent active pane instead of the first pane from the left.</li>\n<li>Clicking on a link will automatically focus on the new pane if the current pane is pinned.</li>\n<li>The translucency plugin has been moved to the appearance setting tab.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Links with <code>%20</code> now decode properly when navigating using the editor.</li>\n<li>Focusing on panes now properly sets the state for arrow keys and page up/down keys to scroll the preview.</li>\n<li>Dragging text within the same editor pane no longer duplicates it.</li>\n<li>Fixed spacing between paragraphs in blockquotes.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>Setting</code> and <code>BaseComponent</code> now have a <code>setDisabled</code> function that will disable its control. Disabling a setting will disable all of its components.</li>\n<li><code>Scope.registerKey</code> is now deprecated. It is replaced by <code>Scope.register</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now embed search queries in the page using the fenced code block syntax with <code>query</code> as the language, similar to how mermaid works. Note that this syntax does not work in Obsidian Publish.</li>\n<li>Obsidian Publish now has a &quot;Show search bar&quot; option, which will add a search bar inside the navigation pane. This can be used to search for pages and headings.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>A layout independent mode has been introduced for hotkeys, which should work consistently across different keyboard layouts. This mode uses the virtual key code that's assigned to each physical key instead of the resulting character that's inputted when the combination is pressed.</li>\n<li>Drag and drop links will no longer create a Markdown link if the link title is identical to the URL.</li>\n<li>Improved behavior of <code>Ctrl/Cmd+Click</code> and <code>Alt+Enter</code> for links in the editor.</li>\n<li>Holding <code>Shift</code> while dropping text will drop it in plaintext mode, similar to <code>Ctrl/Cmd+Shift+V</code> to paste in plaintext mode.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Closing the vault or quitting the app within 2 seconds of editing a file will no longer lose the modifications done within that last 2 seconds.</li>\n<li>The bug where file explorer gains unusual whitespace has been caught and squashed.</li>\n<li>Fixed window size and developer tools were not properly saved when quitting app.</li>\n<li>Toggling highlight will no longer remove bold <code>**</code> signs.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Exposed <code>WorkspaceItem.getRoot()</code> which returns one of <code>Workspace.leftSplit</code>, <code>Workspace.rightSplit</code>, or <code>Workspace.rootSplit</code>. This can be used to distinguish whether a <code>WorkspaceLeaf</code> is in the center area or the sidebars.</li>\n<li>A new event has been added to <code>Workspace.on('quit', callback: (tasks: Tasks) =&gt; any)</code>. This takes a callback with a <code>Tasks</code> object. You can perform any cleanup tasks in here. For any async/promise-based cleanups, such as saving files, add your task to the execution queue using <code>Tasks.add(async () =&gt; { ... })</code> or <code>Tasks.addPromise(promise)</code> so that the app waits until your task is finished before quitting.</li>\n<li>The rendering lifecycle has been tweaked to allow plugins to add sub-components in the renderer post process step. Look for <code>MarkdownPostProcessorContext.addChild</code> for more details.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":16},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Pasting HTML content will now be automatically converted to Markdown. Same for drag and drop. For example, links you drag from web pages will now generate <code>[Display text](https://url)</code> instead of previously just the URL.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Search and replace now has a new default hotkey on macOS <code>Cmd+Option+F</code> to avoid clashing with the native hotkey for hide window.</li>\n<li>Creating new notes from the file explorer or using the hotkey now always open in edit mode.</li>\n<li>When setting up sync on a vault that's older than the synced remote vault, the older files will be ignored and overwritten to avoid a mass rollback.</li>\n<li>Navigation history has been slightly tweaked to be more intuitive, and also remembers scroll sync properly.</li>\n<li>On macOS, closing the last vault and re-activating Obsidian will now re-open the last vault instead of opening the vault switcher.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On macOS, quitting and restarting the app will properly restore the opened vaults.</li>\n<li>Translucency should now work again on app start on macOS.</li>\n<li>Drag and drop a file to open in a pane will now properly push the navigation history so going backwards feels more natural.</li>\n<li>Spellchecker will now split words that are adjacent to CJK characters.</li>\n<li>The &quot;explain search term&quot; button now works properly again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now select multiple files in file explorer using <code>Alt+Click</code>, or multiple consecutive files using <code>Shift+Click</code>.</li>\n<li>You can now reorder starred items.</li>\n<li>You can now <strong>drag files from</strong> various of places:\n<ul>\n<li>Drag a file (or multiple files) from the file explorer, just like before.</li>\n<li>Drag a file from a search result.</li>\n<li>Drag a file from a backlink, or an unlinked reference.</li>\n<li>Drag a file from the starred pane.</li>\n</ul>\n</li>\n<li>You can now <strong>drop files to</strong> various places:\n<ul>\n<li>Drop a file (or multiple files) onto a folder to move it there. You can even do this with files you picked up from anywhere, like a search result. It doesn't have to be from the file explorer.</li>\n<li>Drop a file to a pane's top header section to open the file in that pane.</li>\n<li>Drop a file directly into the editor to insert it as a link. The generated link also follows your preferences, such as relative paths, or using Markdown links.</li>\n<li>Drop a file in another application or in another Obsidian vault to generate an <code>obsidian://</code> link the same way it's generated as &quot;Copy obsidian url&quot;.</li>\n<li>Drop a file to the starred pane to star it.</li>\n</ul>\n</li>\n<li>You can now drag a supported file from your system explorer to a folder in Obsidian's file explorer to import a copy there.</li>\n<li>There is now a dialog with options for page size, landscape mode, and margin options for export to PDF.</li>\n<li>You can now choose the tab size in editor settings.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Quitting the app and restarting will now restore previously open vaults. This will also work on the &quot;relaunch&quot; button after an update has been downloaded.</li>\n<li>On macOS, Obsidian will no longer quit when all windows are closed.</li>\n<li>Pressing <code>Tab</code> will now insert spaces if <code>Use tab to indent</code> is turned off.</li>\n<li>Various visual improvements are added for dragging and dropping panes.</li>\n<li>The app window's title will now indicate the vault name.</li>\n<li>If you have too many ribbon icons, it can now be scrolled to access them all, instead of clipping out the last few icons.</li>\n<li>If the more options menu is too long, it can now be scrolled to access menu options that was previously off-screen.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Sometimes after opening multiple popup windows, all hotkeys stop working. That shouldn't happen anymore.</li>\n<li>With an open note in Obsidian that's been edited outside or by a plugin, sometimes the last newline character disappears. That should no longer happen.</li>\n<li>Fixed some edge cases where custom CSS causes IME positions to overlap the current line.</li>\n<li>Vault switcher should now have more space for certain languages that take more space than others.</li>\n<li>File names with multiple non-breaking spaces will now link properly.</li>\n<li>The about setting tab no longer populates twice when you click on &quot;Check for updates&quot; twice.</li>\n<li>The community plugins page no longer populates twice when you click on a plugin name twice.</li>\n<li>Creating new files will no longer fail if there exists a file called &quot;untitled.md&quot; in lowercase.</li>\n<li>Global search's input box will now expand to take the full width.</li>\n<li>Sync will no longer allow restoring the current version.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The workflow for augmenting CodeMirror has been improved:\n<ul>\n<li><code>Plugin.registerCodeMirror(callback)</code> has been introduced to help plugins hook to CodeMirror instances that are already loaded, and also created in the future. This function is just a helper for <code>Workspace.iterateCodeMirrors(callback)</code> then <code>Workspace.on('codemirror', callback)</code></li>\n<li><code>Workspace.iterateCodeMirrors(callback)</code> has been introduced to help plugins cleanup their CodeMirror events when the plugin unloads.</li>\n<li><code>App.on('codemirror', callback)</code> has been moved to <code>Workspace.on('codemirror', callback)</code>. The old method will be deprecated and will now proxy to the new one. There is no more event system on <code>App</code>.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":22,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":8},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed preview &quot;readable line width&quot; option.</li>\n<li>Fixed preview pane could not fold lists and headings.</li>\n<li>Fixed YAML front matter not shown even when option is turned on.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":21,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li><a href=\"https://publish.obsidian.md/help/Obsidian+Sync\">Obsidian Sync</a> is now available and can now be purchased. It features:\n<ul>\n<li>End-to-end encryption.</li>\n<li>Selective sync.</li>\n<li>Version history.</li>\n</ul>\n</li>\n<li>You can now use the &quot;Move file to another folder&quot; command to move the current file without having to do a drag-n-drop in the file explorer.</li>\n<li>You can now Ctrl/Cmd hover in the file explorer to preview the contents of a file.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Graph view search filter now has a clear button.</li>\n<li>The file explorer will now automatically scroll when dragging files near the top or bottom edge.</li>\n<li>Tag suggestion will now match anywhere in the tag, instead of just from the beginning.</li>\n<li>You can now create internal links in Mermaid by specifying the class <code>internal-link</code> for the node. The app will use the contents of the node as the link. Example: <code>class A internal-link;</code></li>\n<li>Quick switcher aliases now show the actual file path as well.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Link auto-complete should no longer add an extra pair of <code>]]</code> when another link exists on the same line.</li>\n<li>Mermaid text should now finally be properly scaled.</li>\n<li>The notice &quot;Updated x links in y files&quot; now properly shows number of files instead of always showing <code>1</code>.</li>\n<li>Fixed some cases of blurry text caused by the lack of subpixel-antialiasing.</li>\n<li>Fixed <code>[[</code> auto-conversion from chinese characters <code>【【</code>.</li>\n<li>Typing should no longer lag when linked with another editor pane of the same file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fuzzy search related functions <code>prepareQuery</code>, <code>fuzzySearch</code>, <code>renderMatches</code>, <code>renderResults</code>, <code>sortSearchResults</code>, are now available.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":20,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":2},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Quick switcher now auto-completes for aliases as well.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Creating a new file from &quot;no file is open&quot; page now respects the default location option.</li>\n<li>Invalid front matter now shows up as an error in the metadata section of preview mode.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Deleting files and folders now properly remove them from the file explorer.</li>\n<li>Footnotes now work properly in exported PDF files.</li>\n<li>Fixed mermaid graphs don't scale properly when using a HiDPI/retina monitor, or when zooming the app.</li>\n<li>Link suggestion no longer suggests blocks for attachments like images or PDF files.</li>\n<li>Fixed pressing <code>Enter</code> to finish rename a file not working properly when using an IME.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>SuggestModal</code> and <code>FuzzySuggestModal</code> are now available for use.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":19,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":26},"info":"<h2>Improvements</h2>\n<ul>\n<li>Exporting to PDF now respects the &quot;show frontmatter&quot; option.</li>\n<li>Themes/Snippets now excludes dotfiles generated by MacOS.</li>\n<li>Custom CSS is now applied as soon as the app loads.</li>\n<li>Tags in front matter are now split by space if there was any.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed search and replace in edit mode.</li>\n<li>Open themes/snippets folder now works properly.</li>\n<li>Search, backlinks and unlinked mentions should no longer glitch out when collapsing all results.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":25},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now download multiple themes and switch between them. They are now stored in the <code>vault/.obsidian/themes</code> folder. Be sure to disable the legacy option for <code>obsidian.css</code> when you do so!</li>\n<li>You can now add multiple CSS snippets, and choose to enable/disable them individually. They are stored in the <code>vault/.obsidian/snippets</code> folder.</li>\n<li>You can now check for third-party plugin updates and selectively update them.</li>\n<li>In preview mode, there is now a new section displaying the metadata of a file based on its YAML front matter.</li>\n<li>You can now give notes specific CSS classes using the front matter option <code>cssclass</code>. You can also specify multiple ones with the same syntax as tags and aliases, for example, <code>cssclass: class1, class2</code>. Combine this with custom CSS to selectively style notes.</li>\n<li>You can now sort tags in alphabetical order instead of by frequency.</li>\n<li>You can now collapse the front matter section in edit mode.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The custom CSS plugin has been merged into the app, under the &quot;Appearance&quot; setting tab.</li>\n<li>In preview mode, if the front matter fails to parse as YAML, an error message will be displayed in the code block if you had show front matter option enabled.</li>\n<li>Link suggestion will now suggest aliases of a file after you type <code>|</code>.</li>\n<li>Link suggestion no longer shows YAML front matter as a block to refer to.</li>\n<li>When renaming a file, Markdown links will now also change the display text if it matches the file name.</li>\n<li>File explorer has been improved to lag less on big vaults.</li>\n<li>Backlinks and unlinked mentions have been improved to lag less when there are many results.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Highlights are now properly exported to PDF.</li>\n<li>After renaming a file, automatically updated Markdown links will now properly contain the <code>.md</code> extension.</li>\n<li>Choosing a spellcheck suggestion will no longer wipe adjacent characters.</li>\n<li>Creating or renaming a file now properly calculates backlinks to it.</li>\n<li>Embed images now shows up properly in block suggestions.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>moment.js</code> has been replaced with <code>moment-with-locales.js</code>.</li>\n<li>CodeMirror has been updated to v5.58.3.</li>\n<li>A new event <code>layout-change</code> is has been added to <code>Workspace</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":17,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":11,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian now has a native build for Apple M1 (Apple Silicon).</li>\n<li>There's now a build for 32bit Windows and arm64 Windows.</li>\n<li>There's also a build for Linux arm64.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Tags in front matter no longer requires the <code>#</code> character. You can now write <code>tags: [tag1, tag2, tag3]</code>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed unable to type in edit mode after inserting a template or opening command palette or quick switcher.</li>\n<li>Star/unstar file in more options menu has been added back.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now specify <code>aliases</code> in front matter. These will then show up in the <code>[[</code> link suggestion, and auto-complete to <code>[[Filename|alias]]</code>. They will also be picked up in unlinked mentions. For example: <code>aliases: [AI, Artificial Intelligence]</code>. Add double quotes around your alias if it contains special characters.</li>\n<li>You can now specify <code>tags</code> in front matter. These will then show up in the tag pane, as well as in search queries using the <code>tag:</code> operator.  For example: <code>tags: [&quot;#pkm&quot;, &quot;#hype&quot;]</code>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Command palette and Quick switcher will now restore your cursor or selection when exiting.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Graph filter tag operators no longer operate on links to non-existent files.</li>\n<li>The duplicate menu item &quot;Copy obsidian url&quot; has been removed from the more options menu.</li>\n<li>On Windows, you should now be able to drag the window from the top when it's maximized.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>frontmatter</code> is now available in <code>CachedMetadata</code>.</li>\n<li>Some helper functions for front matter parsing are made available: <code>parseFrontMatterEntry</code>, <code>parseFrontMatterStringArray</code>, <code>parseFrontMatterAliases</code> and <code>parseFrontMatterTags</code>.</li>\n<li>The css class <code>mod-root</code> is now always added to the workspace center area.</li>\n<li>Deprecations: (the old name will remain in code for backward compatibility for a while)\n<ul>\n<li><code>Setting.addExtraSetting</code> has been renamed to <code>addExtraButton</code>.</li>\n<li><code>Workspace.getActiveLeafOfViewType</code> has been renamed to <code>getActiveViewOfType</code>.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":11,"day":17},"info":"<h2>Improvements</h2>\n<ul>\n<li>The updater has been improved to properly use system proxy settings when fetching downloads. (Requires installer update)</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fix popups from IMEs for east Asian languages such as Chinese and Japanese not properly positioned for heading with larger font than body text.</li>\n<li>Fixed search not working for double-quote full word match that includes punctuation characters.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":13},"info":"<h2>Improvements</h2>\n<ul>\n<li>A mechanism has been added to deprecate specific versions of third-party plugins known to cause data loss. A notification will be shown to indicate that such a plugin has been disabled.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed right click menu in edit mode.</li>\n<li>Fixed negative path filters in graph search causes tags to be removed.</li>\n<li>Mermaid Gantt charts are now properly sized according to the view size.</li>\n<li>Search results can be scrolled again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":12},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now right click on search results, backlinks and unlinked mentions to show a file menu for some shortcuts.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>A new option has been added for changing the default mode (edit vs preview) when opening new notes.</li>\n<li>Graph filter query has been tweaked to prevent <code>path:</code> and <code>file:</code> filters from removing tags.</li>\n<li>Search queries with double quotes now properly performs full word search if your query starts or ends in a punctuation character.</li>\n<li>Allow mermaid internal links using the <code>/Note</code> internal link format.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Clicking now properly hides context menus, which previously were sometimes left on the page if clicking on editable text.</li>\n<li>Fold all/unfold all now properly updates the fold indicator.</li>\n<li>Graph hover preview is now back.</li>\n<li>Ctrl-click on internal links should now work on MacOS.</li>\n<li>Popups from IMEs for east Asian languages such as Chinese and Japanese should no longer obscure the line you're typing on.</li>\n<li>Internal links now render properly in footnotes.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now right click internal links to see many file options, such as opening in new pane, revealing in file navigation, open with default app, etc.</li>\n<li>Global search will now show recent search queries when the search is empty.</li>\n<li>Global search now has an &quot;x&quot; to clear the search query.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Global search and backlinks pane now save your options for collapse results, show more context and sort order. Global search also saves match case and explain search term.</li>\n<li>Backlinks pane also saves the folding of the <code>Linked mentions</code> and <code>Unlinked mentions</code> sections.</li>\n<li>Several new API are now available for plugins to use.</li>\n<li>Plugin authors can now mark a required version of Obsidian for their releases. They can also provide a list of older versions of their plugin that's compatible to older versions of Obsidian.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed fold all previously did not work in preview mode.</li>\n<li>There was a race condition for saving large files on slower computers which could prevent saving the last few characters typed into the note. That should no longer happen.</li>\n<li>Checklist styles have been fixed, they should no longer have an awkward offset from the left side.</li>\n<li>Hover previews now properly renders embeds.</li>\n<li>Indenting from a numbered list to an unordered list no longer causes <code>undefined</code> to appear.</li>\n<li>Printing to PDF no longer generates clickable <code>app://obsidian.md</code> links for internal links.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":11,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":11,"day":3},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now export notes to PDF.</li>\n<li>You can now fold headings in preview.</li>\n<li>Fold/Unfold all command/hotkey now works in preview as well.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Plugin API: <code>Vault</code> APIs now normalize all input paths.</li>\n<li>You can now see installed versions of third party plugins in the &quot;Third party plugins&quot; section directly.</li>\n<li>The &quot;Use Markdown links&quot; setting has been moved to &quot;Files&quot; tab and has been renamed to &quot;Use Wikilinks&quot; to avoid users unintentionally turning on Markdown mode.</li>\n<li>Search in preview now automatically selects the first result.</li>\n<li><code>&lt;iframe&gt;</code> now has permission to show modal like <code>alert()</code>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Word count now works for languages that previously didn't work, such as Hebrew and Georgian.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":10,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":10,"day":30},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Community plugins page now has a download count, and is sorted using it.</li>\n<li>Clicking on the plugin information now goes to the community plugins page where more details can be found.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Third party plugins now store their plugin data in their respective folder.</li>\n<li>Third party plugins that fail to initialize will now show a notice about the failure.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Lists in slides no longer show the collapse indicator.</li>\n<li>Tables in edit mode no longer shows a weird space in the middle.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":10,"day":29},"info":"<h2>Improvements</h2>\n<ul>\n<li>API now exports <code>View</code>.</li>\n<li>Plugin <code>onInit</code> has been removed to avoid confusion.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Third party plugins should no longer be disabled on reload.</li>\n<li>Clicking on a graph node should no longer cause an error in the developer console.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":10,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a community plugins page to discover and install third party plugins.\n<ul>\n<li>Check out the updated <a href=\"https://github.com/obsidianmd/obsidian-sample-plugin\">sample plugin</a> on how to structure your plugin and how to release.</li>\n<li>See <a href=\"https://github.com/obsidianmd/obsidian-releases\">publishing instructions</a> on how to add your plugin to the list.</li>\n</ul>\n</li>\n<li>You can now uninstall third party plugins.</li>\n<li>More API has been made available.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Block and heading link suggestions are now sorted by best match.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Spellchecker will no longer attempt to spellcheck <code>&lt;</code> and <code>&gt;</code> characters.</li>\n<li>Fixed updating the wrong part of the link in Markdown links when renaming files.</li>\n<li>Fixed text wrapping to next line, then jumping back to the same line when adding space character.</li>\n<li>Sized images will now stay at their specified size, even if the pane is smaller.</li>\n<li>Extra unnecessary scrollbar from heading/block embeds have been removed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":10,"day":26},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The Plugin API alpha is now available! Hype!\n<ul>\n<li>Keep in mind that the plugin API is in <code>alpha</code> status. Any part of the API could introduce breaking changes in a future release.</li>\n<li>For plugin developers, see our <a href=\"https://github.com/obsidianmd/obsidian-sample-plugin\">sample plugin repo</a> and the <a href=\"https://github.com/obsidianmd/obsidian-api\">plugin api</a></li>\n<li>To install a plugin, simply place the plugin files inside the folder <code>MyVault/.obsidian/plugins/my-plugin/</code>.</li>\n<li>For users, currently there is no &quot;app store&quot; for distributing plugins yet. This will come in a future release.</li>\n</ul>\n</li>\n<li>You can now search in preview.</li>\n<li>You can now fold lists in preview. However, the fold state is not saved yet.</li>\n<li>There is now a new command to copy the <code>obsidian://</code> URI for a file.</li>\n<li>A new <code>search</code> action is now available for <code>obsidian://</code> URIs. Here's an example: <code>obsidian://search?vault=my%20vault&amp;query=MOC</code></li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The app is now much quicker to launch for large vaults.</li>\n<li>Local graph now has a screenshot menu item too.</li>\n<li>Mermaid has been upgraded to v8.8.2.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Switching from preview to edit now properly scrolls to the same place you were viewing.</li>\n<li>Fixed resizing panes sometimes glitches and causes other panes to become tiny.</li>\n<li>Fixed unable to change language when checking for updates.</li>\n<li>Fixed <code>ogv</code> video files not properly included.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":10,"day":20},"info":"<h2>Breaking changes</h2>\n<ul>\n<li>Block references now require the <code>^</code> character to be part of the link, like so: <code>[[Filename#^blockid]]</code>.</li>\n<li>Block auto-complete will generate this new format automatically.</li>\n<li>The old format from v0.9.5 <code>[[Filename#blockid]]</code> will stop working.</li>\n<li>A conversion tool is added for existing block references from v0.9.5. Use the Markdown format importer plugin's &quot;Block ID upgrade&quot;. Remember to backup your notes since this operates on the whole vault.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Block auto-complete will also display and search the block ID if one is present.</li>\n<li>Block IDs can now contain the dash character <code>-</code>.</li>\n<li>Auto-complete trigger with the prefix <code>#^</code> such as <code>[[Filename#^</code> now behaves identically to <code>[[Filename^</code>.</li>\n<li>&quot;Toggle checklist status&quot; command/hotkey now adds the checkbox syntax <code>- [ ]</code> for any selected lines that does not already have a checkbox.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Image size syntax now works for internal images using the Markdown standard link format.</li>\n<li>Link auto-complete no longer strip characters after a <code>.</code> in the filename when using Markdown links.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":10,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>\n<p>Block references and block embeds are now available.</p>\n<ul>\n<li>Simply type <code>^</code> when linking to trigger the auto-complete: <code>[[Filename^</code>.</li>\n<li>Use <code>[[^^</code> to auto-complete blocks globally.</li>\n<li>The generated link will look like this: <code>[[Filename#blockid]]</code>.</li>\n<li>Block IDs will be generated using the syntax <code>^blockid</code> when using the auto-complete.</li>\n<li>Alternatively, you can manually create the block ID using any alpha-numeric character.</li>\n<li>The block ID must be located at the end of the paragraph or list item, and must include a space character before the <code>^</code>.</li>\n<li>To identify more complex blocks, like tables, you can add the <code>^blockid</code> as its own after the block you're referring to. There must be an empty line before and after <code>^blockid</code> for this to take effect.</li>\n<li>Quick reminder that this syntax for block reference isn't portable Markdown (no other tools support it yet), so please use some discretion when considering working with other tools!</li>\n</ul>\n</li>\n<li>\n<p>You can now auto-complete headings and blocks globally.</p>\n<ul>\n<li>Be aware that this may be slow if your vault is large.</li>\n<li>Auto-complete blocks <strong>globally</strong> by typing <code>[[^^</code>.</li>\n<li>Auto-complete headings <strong>globally</strong> by typing <code>[[##</code>.</li>\n</ul>\n</li>\n<li>\n<p>There is now a new command for toggling the checkbox state between <code>[ ]</code> and <code>[x]</code>. <code>Ctrl/Cmd+Enter</code> is the default hotkey.</p>\n</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>The community theme page has been re-styled to be easier to use.</li>\n<li>HTML <code>&lt;iframe&gt;</code> now has a sandbox attribute added for extra security.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed removing links to an opened file causes the backlink pane to sometimes keep showing the removed link.</li>\n<li>Fixed inability to see the last few characters when editing table that's longer than screen width.</li>\n<li>Malformed Markdown URLs no longer cause parsing failures.</li>\n<li>Linking an unlinked mention now shows up in linked mention right away.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":10,"day":13},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>In preview mode, internal links to notes that don't exist yet are now given the CSS class <code>is-unresolved</code>, and now shows up in a different color than links to existing notes.</li>\n<li>You can now downsize images using the new syntax:\n<ul>\n<li>For Markdown images, use <code>![AltText|100x100](https://url/to/image.png)</code></li>\n<li>For embeds, use <code>![[image.png|100x100]]</code></li>\n<li>To have the image scale according to its aspect ratio, omit the height <code>![[image.png|100]]</code></li>\n</ul>\n</li>\n<li>Obsidian Publish:\n<ul>\n<li>Backlinks! Turn it on to add the new backlink section at the end of each page.</li>\n<li>Your site can now be styled with custom CSS! Just upload either <code>obsidian.css</code> or <code>publish.css</code>. You can also upload both so you can use your existing <code>obsidian.css</code> and add some extra tweaks for publish in <code>publish.css</code>.</li>\n<li>There's a new mode you can turn on called &quot;sliding windows&quot;. This overhauls your site's navigation to open links beside the current page. Inspired by <a href=\"https://notes.andymatuschak.org/\">Andy Matuschak's website</a></li>\n<li>Page URLs now encodes space characters as <code>+</code> instead of <code>%20</code> for a cleaner look.</li>\n</ul>\n</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Obsidian now recognizes <code>.bmp</code>, <code>.svg</code>, and <code>.tiff</code> images.</li>\n<li>Hover preview now pops up where your cursor is, rather than at the position of the link.</li>\n<li>Improved performance when computing backlinks for large vaults.</li>\n<li>Improved performance when auto-completing links for large vaults.</li>\n<li>Embeds got their styling tweaked to be less prominent and less distracting.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Deleting folders on Linux should no longer give an error message.</li>\n<li>Hover preview now fixed for graph view. It stays up nicely and disappears only when the cursor is off the hover and the graph node.</li>\n<li>Fixed a possibility that the hover preview gets stuck when clicking on the link.</li>\n<li>Fixed some characters not decoded properly when using <code>obsidian://</code> URLs, such as the comma <code>%2C</code>.</li>\n<li>Removed duplicate backlinks for links within footnote definitions.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":10,"day":5},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Clicking on checkbox within an embed block or a hover preview now updates the underlying file.</li>\n<li>Embedded notes now update when the underlying file is changed.</li>\n<li>New &quot;Workspaces&quot; plugin allows saving the entire workspace, including panes with their open files as well as all sidebar configuration. Especially useful if you use a vault for multiple purposes to jump between different pane configurations quickly.</li>\n<li>When using global search, you can now copy the search results file list. This can be optionally formatted as wikilinks and/or as lists.</li>\n<li>Hover preview can now be scrolled.</li>\n<li>Hover preview can now stack, meaning you can hover links inside a hover preview and pop out another preview for that link.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Publish plugin now has an &quot;unchanged&quot; section which can be used to un-publish files.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Local graph search filter no longer filters out the current file, which causes everything else to disappear.</li>\n<li>Resetting graph to default now properly resets forces as well.</li>\n<li>Changing search queries now saves to workspace properly.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":9,"day":30},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a publish plugin that works with Obsidian Publish. For more information, check out the <a href=\"https://publish.obsidian.md/help/Add-on%20services/Obsidian%20Publish\">Obsidian Publish Service</a></li>\n<li>Graph now has an option to tweak when the text fades out.</li>\n<li>You can now mouse hover in graph view with <code>Ctrl/Cmd</code> to bring up the hover preview if the page preview plugin is enabled.</li>\n<li>If your vault is large, there is now a loading progress bar when starting the app, instead of freezing and not functioning until the app properly loads.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Clicking on search results and backlinks now scrolls to the Markdown section containing the first result in preview mode.</li>\n<li>Clicking on search tab now focuses on the search textbox so it can be typed in right away.</li>\n<li>The graph simulation engine has been rewritten to bring even more performance and save battery. Note that the graph simulation engine is responsible for computing where each node moves.</li>\n<li>The graph rendering engine has been tweaked to initialize a bit faster.</li>\n<li>Graph filters have been re-categorized to differentiate between display options and forces. Changing display options now no longer re-activates graph simulation.</li>\n<li>When opening global search with selected text, the query is now properly double-quoted if the query contains space characters.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed styling of backlink/unlinked mentions broken by the previous release.</li>\n<li>Navigating backward/forward should no longer cause the pane type to change from edit/preview to graph, backlinks or outline.</li>\n<li>Slides can now be styled via custom CSS without having to use more specific rules.</li>\n<li><code>obsidian://</code> URIs now fixed for Linux.</li>\n<li>Fixed more instances where preview scroll was reset when scrolling with large images.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":9,"day":24},"info":"<h2>Changes</h2>\n<ul>\n<li>Search queries on graph now applies to all nodes, including tags and links to files that haven't been created yet.</li>\n<li>When hovering graph nodes, the node name now shifts down to avoid being covered by the mouse cursor.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The account page now works again. This did break before and we've taken more steps this time to make sure it won't happen again.</li>\n<li>The vault chooser's &quot;Create vault&quot; functionality has been restored.</li>\n<li>Obsidian URI's shortcut mode <code>obsidian://vault/vaultname</code> now properly recognize URI encoded characters such as Chinese characters.</li>\n<li>Previewing documents with large images that are longer than your your screen no longer causes jumping or flickering when scrolling.</li>\n<li>Hovering graph nodes will now stop hovering when the node moves away from the cursor.</li>\n<li>In some rare situations, the app would freeze when loading, where nothing can be clicked and the app is completely unresponsive. This shouldn't happen anymore.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":9,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Graph view has been completely revamped.\n<ul>\n<li>New options for filtering are now available. You can now:\n<ul>\n<li>Filter files using same syntax as search. This can be especially useful to exclude certain folders like daily notes with <code>path:-&quot;Daily notes&quot;</code>.</li>\n<li>Choose to show <code>#tags</code>.</li>\n<li>Choose to show attachments such as images, audios, and PDFs.</li>\n<li>Choose to hide links to non-existent notes (only show existing files).</li>\n<li>Choose to hide orphan notes (files that do not have links, and is not linked to).</li>\n</ul>\n</li>\n<li>New layout options are available to customize the graph to your vault. You can now:\n<ul>\n<li>Choose to show arrows for links.</li>\n<li>Change the size of nodes and the thickness of links.</li>\n<li>Change the centering force, the repelling force, the link force, and the link distance.</li>\n</ul>\n</li>\n<li>Local graph also has a few new option available. You can now:\n<ul>\n<li>Choose to hide incoming or outgoing links.</li>\n<li>Choose to showing neighbor links. Disabling this option hides links between neighbor notes.</li>\n</ul>\n</li>\n<li>You can now navigate the graph using the keyboard. Arrow keys to pan, <code>+</code> and <code>-</code> to zoom, <code>Shift</code> to speed up movement.</li>\n<li>All graph options, including local graph depth and zoom level, are now persisted through restarts.</li>\n<li>Dragging to pan now has inertia. Zooming has been reworked to be much smoother.</li>\n<li>Graph colors now support custom CSS <code>color: rgba()</code> values as well as <code>opacity: 0.5</code>.</li>\n<li>New graph CSS classes are <code>.color-fill-tag</code>, <code>.color-fill-attachment</code>, <code>.color-fill-unresolved</code>, and <code>.color-arrow</code>.</li>\n<li>Graph simulation is now done in a worker thread. This should make large graphs much more manageable.</li>\n<li>Several optimizations have been implemented to make the graph blazingly fast on vaults of all sizes. Many tricks are commonly used in modern day video games!</li>\n</ul>\n</li>\n<li>Obsidian now supports <code>obsidian://</code> URIs. For the user manual, check out the help doc <code>Advanced use &gt; Using obsidian URI</code>.\n<ul>\n<li>Remember to use <code>%20</code> to encode the space character, and <code>%2F</code> to encode the forward slash <code>/</code>.</li>\n<li><code>obsidian://open?vault=myvault</code> will open the vault &quot;myvault&quot;.</li>\n<li><code>obsidian://open?vault=myvault&amp;file=mynote</code> will open the file &quot;mynote&quot; inside the vault &quot;myvault&quot;/</li>\n<li><code>obsidian://open?path=%2Fabsolute%2Fpath%2Fto%2Fmynote</code> will open the file at the absolute path &quot;/absolute/path/to/mynote&quot; assuming a vault exists for the one of the parent folders.</li>\n</ul>\n</li>\n<li>The two shorthand from v0.8.15 are still available:\n<ul>\n<li>The vault format: <code>obsidian://vault/myvault</code>.</li>\n<li>The vault + file format: <code>obsidian://vault/myvault/mynote</code>.</li>\n<li>The <strong>triple</strong> slash format for absolute paths: <code>obsidian:///absolute/path/to/mynote</code> or on Windows <code>obsidian:///C:\\path\\to\\mynote</code> (forward slash also works).</li>\n</ul>\n</li>\n<li>New CSS classes are added for <code>#tags</code> in the editor for those interested in styling different tags in different colors. For a hypothetical tag <code>#mytag</code>, the class will be <code>.cm-tag-mytag</code>. Unfortunately, this only supports English letters, <code>-</code>, and <code>_</code>, since those are the limitations of CSS class names.</li>\n<li>New CSS classes are now added to <code>&lt;body&gt;</code> to indicate the operating system. They are <code>.mod-macos</code>, <code>.mod-windows</code>, and <code>.mod-linux</code>.</li>\n<li>Markdown importer can now convert Bear style highlight <code>::highlight::</code>.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Global search and edit mode <code>find</code> functionality now copies selected text into the search bar when triggered.</li>\n<li>The vault switcher window now has a language switcher.</li>\n<li>Search should now be much faster if only using <code>file:</code> or <code>path:</code> operators, because the file content does not need to be loaded.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On Windows, the vault switcher should now show vault name instead of the full path, which took a lot of unnecessary space.</li>\n<li>Splitting a new pane sometimes caused the new pane to be very thin. That should now be fixed.</li>\n<li>Clicking on <code>file:///</code> links should now work properly on Linux. This was broken on a previous release.</li>\n<li>On MacOS, sometimes when double clicking the app titlebar to zoom, the window disappears and can't be made to reappear even if restarting the app. This will no longer happen.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":9,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The app now registers the URL scheme &quot;obsidian://&quot;. This will attempt to open a file in any previously opened vaults.\n<ul>\n<li>On MacOS, this requires installer version 0.8.12+ to work.</li>\n<li>To open a vault that you have previously opened, use the format <code>obsidian://vault/vaultname</code>, where vaultname is the name of the folder of the vault.</li>\n<li>To open a file inside a vault, use the format: <code>obsidian://vault/vaultname/path/to/file</code>.</li>\n<li>To open a file with an absolute path, use the <strong>triple</strong> slash format: <code>obsidian:///absolute/path/to/file</code> or on Windows <code>obsidian:///C:\\path\\to\\file</code> (forward slash also works). This will open the file in the most nested vault that's capable of opening this file.</li>\n<li>If the URL does not do anything, then it means the file does not belong to any vault you have previously opened.</li>\n<li>If the vault opens, but does not navigate to the specified note, then it means the file of that path was not found.</li>\n<li>On Linux, you will have to setup an obsidian.desktop file with <code>Exec=obsidian %u</code>. Details see <a href=\"https://unix.stackexchange.com/a/497147\">here</a>.</li>\n</ul>\n</li>\n<li>Alphabetical sorting has been improved.\n<ul>\n<li>Sort is now case insensitive.</li>\n<li>Sort correctly understand accent characters such as &quot;é&quot; to be the same as &quot;e&quot;.</li>\n<li>Numbers are now naturally sorted, so &quot;1&quot;, &quot;2&quot;, and &quot;10&quot; will now sort in the expected order.</li>\n</ul>\n</li>\n<li>Outline items are now collapsible.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Embed can now be rendered up to 5 layers deep.</li>\n<li>Pasting images now use a 14 digit timestamp format &quot;Pasted image 20200914050118.png&quot; instead of a regular number &quot;Pasted image 15.png&quot;.</li>\n<li>Graph view will now prioritize rendering frames instead of performing physics simulation, which previously caused multi-second lags on large graphs.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Frameless titlebar text is not properly center aligned.</li>\n<li>Linking an unlinked mention now properly removes the entry from the unlinked mention section.</li>\n<li>Removed hidden titlebar when fullscreen which caused the top section of the app to not accept clicks.</li>\n<li>Drag and drop panes no longer cause the moved pane to lose CSS styles and pane headers.</li>\n<li>MacOS can now double click the frameless window header to zoom or un-zoom.</li>\n<li>Numbered lists with checkboxes now renders correctly.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":14,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":9,"day":10},"info":"<h2>Changes</h2>\n<ul>\n<li>Auto-complete Markdown links now generates the note's name in the display text instead of the full path.</li>\n<li>Checkboxes are now re-colored to match our theme if your installer version is 0.8.12+.</li>\n<li>We have restored link auto-completion for hitting the <code>#</code> key, because otherwise it wouldn't be possible to auto-complete headings when using Markdown links.</li>\n<li>Latex <code>$</code> symbol will auto-pair when selecting text and hitting the <code>$</code> key.</li>\n<li>Fullscreen will now hide the titlebar.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Open in default app now works once again.</li>\n<li>Command palette can now show more than 5 results.</li>\n<li>The vault switcher window style has been fixed.</li>\n<li>Titlebar text is now properly centered.</li>\n<li>Folder and file suggestion popovers now show in the correct position when the page has scrollbars.</li>\n<li>When linking unlinked mentions, the linked entry should now disappear from unlinked mentions list.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":9,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The entire app is now frameless. This also means you can use custom CSS to change the color/appearance of the top bar.</li>\n<li>We've added buttons for navigating backward/forward on the top left of the app.</li>\n<li>There is now a new plugin called &quot;Translucency&quot;, which will make the app translucent. Linux is unsupported for now. Windows users must also re-install the app using the v0.8.12+ installer to be able to use this.</li>\n<li>Strikethrough <code>~</code> and highlight <code>=</code> will now auto-pair when selecting text and hitting the respective keys.</li>\n<li>There are now new commands for &quot;Edit file title&quot; and for &quot;Copy file path&quot;.</li>\n<li>A new option is available to disable line-wrapping in edit mode.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Link suggestion no longer triggers auto-complete when pressing <code>#</code> or <code>|</code> because it's not always intended. Instead, hit <code>Tab</code> first to auto-complete, then type the character normally.</li>\n<li>Selecting text in preview mode now prevents it from being optimized, where previously the selection would disappear when scrolled out-of-view.</li>\n<li>You can now middle-click on graph nodes to open the note in a new pane.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On Linux, using the mouse backward/forward navigation buttons no longer fires twice.</li>\n<li>Sometimes in edit mode, the collapse/expand triangle overlaps the text. That's now fixed.</li>\n<li>Navigating back to a file that was already deleted shouldn't cause an error anymore.</li>\n<li>Checkboxes with a numbered list now appear on one line instead of wrapping to the next.</li>\n<li>Numbered lists with checkboxes now shows the number instead of hiding it.</li>\n<li>Fixed search operator <code>tag</code> miss every other result within the same file.</li>\n<li>Fixed a rare occurence of scroll lost when typing in a scroll-synced edit/preview configuration.</li>\n<li>Fixed heading not highlighted in preview mode when using the outline plugin if heading is on the last line of the note.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":12,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":9,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Update Electron to v10.1.1.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Checkbox now uses a more modern style thanks to the new Electron update.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Line wrapping used to cause a weird space to appear on the second line when the previous line ends with any kind of formatted text. This is fixed by the new Electron.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":9,"day":1},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Removed extra space at the bottom of the app.</li>\n<li>Account tab should now load properly.</li>\n<li>Embeds should now appear in backlink pane again.</li>\n<li>Backlink pane no longer show a scrollbar when it shouldn't.</li>\n<li>Backlink pane now updates properly when files are changed outside.</li>\n<li>Graph view no longer crashes when loading initially, or when files are changed outside.</li>\n<li>Fixed unlinked mentions links the wrong item.</li>\n<li>Fixed switching from editor to preview doesn't scroll on large documents.</li>\n<li>Fixed scroll-sync lag with edit mode open.</li>\n<li>Fixed scroll-sync not scrolling to the top on the other pane.</li>\n<li>LaTeX inline blocks <code>$$</code> no longer has the space &amp; digit requirements like <code>$</code>.</li>\n<li>WIP translucency plugin disabled, will be re-enabled next release.</li>\n<li>Updated translations.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":8,"day":31},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Linking to headings using <code>[[filename#]]</code> should now properly show suggestions when <code>#</code> is typed, instead of requiring an additional character to be typed first.</li>\n<li>In some rare cases, vaults with many files would freeze when loading up. This should be fixed now.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":31},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Search &amp; backlinks now has an option to sort results, similar to file explorer.</li>\n<li>File sort order now includes sorting by creation time.</li>\n<li>Local graph nodes are now in decremental size from closest to farthest.</li>\n<li>A new search operator <code>tag:#mytag</code> is now available, which will only match tags that are parsed exactly as tags (for example, #mytag inside a code block will be properly ignored).</li>\n<li>A new hotkey has been added to create note in new pane.</li>\n<li>The Zettelkasten prefixer plugin can now set Zettel ID format, similar to daily notes.</li>\n<li>Daily note/Zettelkasten prefixer: Template file now accepts <code>{{date:format}}</code> and <code>{{time:format}}</code> just like the template plugin.</li>\n<li>Frontmatter in preview now has a CSS class to facilitate styling.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Graph view has been greatly optimized. File changes only trigger incremental change detection to re-compute graph instead of a full scan.</li>\n<li>Search and backlinks now refreshes when files in the vault are changed. This update is also done incrementally to minimize performance impact.</li>\n<li>Backlinks pane has now been optimized when switching files or editing note, it will no longer cause lag to the editing experience.</li>\n<li>Opening help vault now wipes the folder first, which prevents older version of the help docs sticking around when they have been renamed.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Cmd/Ctrl-click links and tags in edit mode sometimes requires a 2nd click.</li>\n<li>Consecutive tables now include proper spacing between them instead of being stuck together.</li>\n<li>In the file explorer, you can now click on file names while renaming them without exiting rename mode.</li>\n<li>Fixed footnotes with embedded documents not linking to the right footnote reference when clicked.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":24},"info":"<h2>Changes</h2>\n<ul>\n<li>Hovering the unlink pane button now highlights the pane itself as well.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Clicking on a checkbox should check the correct box instead of the one 3 lines down, oops.</li>\n<li>Clicking an outline pane link would sometimes not work depending on pane configuration. That's fixed now.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":24},"info":"<h2>Changes</h2>\n<ul>\n<li>The cache file that was previously in <code>vault/.obsidian/cache</code> is now moved to the &quot;APPDATA&quot; folder under <code>APPDATA\\Obsidian\\ObsidianCache\\VAULT-ID.json</code>. This should resolve issues with sync applications that caused conflicts with this file. See <a href=\"https://www.electronjs.org/docs/api/app#appgetpathname\">Electron documentation</a> for the precise location of APPDATA on your platform.</li>\n<li>Removed non-functional work-in-progress publish plugin that was accidentally added in v0.8.6.</li>\n<li>Removed console.log of the i18n dictionary that was also accidentally added in v0.8.6.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":24},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Local graph now has an option to specify number of jumps from the current note.</li>\n<li>There is now a new sort algorithm for quick switcher and link suggestion that's faster and more accurate.</li>\n<li>New search operator <code>content:</code> will search the content of the file only.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Excess spaces are now trimmed when creating new vaults.</li>\n<li>Obsidian is now available in French, Italian, Indonesian, Korean, and Romanian.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Reveal in file explorer no longer show up in file explorer itself.</li>\n<li>Fixed template can't be inserted in pinned panes.</li>\n<li>Fixed template error message using wrong translation.</li>\n<li>Fixed spellchecker suggestion inserts into the wrong location when clicking on the first letter.</li>\n<li>Fixed Chinese and Japanese &quot;exact match&quot; not working due to the lack of space characters.</li>\n<li>Fixed Settings &gt; About showing HTML tags.</li>\n<li>Graph nodes with links to self should not contribute to weight.</li>\n<li>Clicking on other panes should no longer navigate graph view.</li>\n</ul>\n<h2>Bugfix related to the parser switch in v0.8.5</h2>\n<ul>\n<li>Clicking on a checkbox should no longer scroll the page.</li>\n<li>Scroll-sync should no longer be janky, flicker, or cause jumps when typing.</li>\n<li>Footnote links should now work again.</li>\n<li>Clicking outline items now navigates and highlights the correct line.</li>\n<li>Fixed parse fail when there are <code>&amp;amp;</code> or other HTML entities.</li>\n<li>Tooltips no longer clip out of view when they're at the edge of the screen.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>A new template plugin is now available. Designate a template folder and insert any of them on command. In the plugin setting, you can tell the plugin what to replace <code>{{date}}</code> and <code>{{time}}</code>  with. <code>{{title}}</code> will be replaced by the title of the current file. You can also insert {{date:FORMAT}} to customize date formatting individually.</li>\n<li>YAML Frontmatter is now recognized. You can also hide it using the option in Settings &gt; Editor &gt; Show frontmatter.</li>\n<li>There's now a new file menu item to &quot;reveal file in file explorer&quot;, which highlights the current file in the file explorer pane.</li>\n<li>You can now choose to auto-complete links in the Markdown standard format. This will automatically encode spaces as <code>%20</code>.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>We've now switched from Markdown-It to Remark to parse Markdown files. This will inevitably change how some of your notes look like, since Remark is not fully CommonMark compliant. This change allows us to accurately calculate link positions within a document to properly render backlinks and to update references when files are renamed.</li>\n<li>Search now searches in file name as well.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Two identical links in the same paragraph now properly shows as two distinct backlinks, instead of showing the first one twice.</li>\n<li>Pressing <code>Tab</code> to autocomplete links no longer inserts an extra pair of <code>]]</code>.</li>\n<li>Footnotes used to link to the wrong place, that should be fixed now.</li>\n<li>Vault switcher should no longer flash blank for a second when first opened up.</li>\n<li>Fixed sometimes the window would overflow, causing the whole app to be scrolled up out of view.</li>\n<li>When vault resides in a folder with special characters, embedded images and media no longer worked. This shouldn't happen anymore.</li>\n<li>Pasting control characters (which are also invalid for file names) in the file rename field no longer causes an exception.</li>\n<li>LaTeX rendering using MathJax should no longer be broken if accidentally changed MathJax renderer using the right-click menu.</li>\n<li>Mermaid graphs that couldn't be rendered due to an error won't scroll the whole app anymore.</li>\n<li>Duplicate embeds, LaTeX, and code blocks now properly renders instead of having the first one disappear.</li>\n<li>Spellcheck correction is now properly applied when using custom CSS themes that reduce line height.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":8,"day":12},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Search improvements:\n<ul>\n<li>If a file has more than one match, the number of matches will be displayed next to the file.</li>\n<li>The collapsed matches that said &quot;... and 8 more matches&quot; can now be expanded to show all results separately.</li>\n<li>Matched text now shows 1 line of surrounding context by default. A new button &quot;Show more context&quot; is added to show up to 5 lines of context instead.</li>\n</ul>\n</li>\n<li>Backlink and unlinked mentions improvements:\n<ul>\n<li>Results can now be collapsed on a per-file basis, just like search results.</li>\n<li>Backlinks and unlinked mentions has a counter for how many total matches when expanded.</li>\n<li>Numerous fixes to recognizing and rendering listed below.</li>\n</ul>\n</li>\n<li>A new command has been added for opening a local graph.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Local graph now re-centers graph when switching file.</li>\n<li><code>![[Embed|Display]]</code> now properly recognizes the link to &quot;Embed.md&quot; instead of &quot;Embed|Display.md&quot;.</li>\n<li>Translations are now complete for Russian, Chinese (traditional).</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Backlinks now properly show context around the matched link, instead of ignoring some space and newline characters, and sometimes showing duplicate words.</li>\n<li>Unlinked mentions that previously matched links or embeds now properly exclude them.</li>\n<li>Fixed graph view plugin accidentally renamed to &quot;File explorer&quot; causing it to enable/disable the file explorer plugin instead.</li>\n<li>Fixed plugin enabled status resets when switching languages.</li>\n<li>Long file names that couldn't be fully displayed used to have a tooltip when hovering that was broken a few versions back. We added it back.</li>\n<li>When clicking on an unlinked local graph, backlink, or outline pane, the pane would previously reset or go blank. That no longer happens.</li>\n<li>LaTeX rendering was broken in 0.8.3 due to an optimization. It should now render properly.</li>\n<li>When deleting a file that's currently open, the outline and backlinks pane no longer closes to &quot;no file is open&quot;.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":8,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a &quot;local&quot; graph view available. This is bound to a file, only showing notes related to the linked pane, similar to how backlinks and outline pane works. Use the &quot;More options&quot; menu to find the new &quot;Open local graph&quot; option. Try putting it in a sidebar!</li>\n<li>Graph view now updates in real time when files are created, removed, or when links are changed.</li>\n<li>Obsidian is now translated to several different languages thanks to our lovely community members. This version comes with full support for English and 中文 (Chinese), and partial support for Deutsch, Français (French), русский (Russian) and Türkçe (Turkish). If you would like to help translate Obsidian to your native language, join our Discord <code>#translations</code> channel.</li>\n<li>The Slides plugin has been revamped and updated. It now supports image/audio/video embeds, LaTeX, code blocks and mermaid graphs.</li>\n<li>The Zettelkasten prefixer plugin now has a template file option.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Renaming folders now properly updates all affected links. Creating or renaming files that causes duplicate names will now update links to absolute links to avoid conflicts.</li>\n<li>Search performance has been improved. It will now match files much faster, where it was previously limited to 600 files per second.</li>\n<li><code>&lt;style&gt;</code> tags are no longer permitted in raw HTML. This is because the HTML standard disallows <code>&lt;style&gt;</code> tags within <code>&lt;body&gt;</code>; they are only permitted in <code>&lt;head&gt;</code>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Switching from edit to preview mode had a brief flash before changes are applied, that no longer is the case.</li>\n<li>The editor no longer inserts an extra pair of <code>]]</code> closing brackets when &quot;smart indent list&quot; is turned off.</li>\n<li>Outline plugin no longer switches to a media file if one is opened in the editor. Now it more accurately just says &quot;No headings found.&quot;</li>\n<li>PDFs that previously had missing characters now render properly.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":30},"info":"<p>Lots of under the hood improvements on this one. Everyone should be made slightly happier, and a few people will be made much happier.</p>\n<h2>Changes</h2>\n<ul>\n<li>Opening very large documents in Preview mode will now work much better. We now only render block elements that are in view, and anything that's outside of the visible scroll area is temporarily hidden for performance (tested on &quot;War and Peace&quot; at 3MB/570k words).</li>\n<li>LaTeX now has full MathJax input library included, which should allow the imported libraries to work.</li>\n<li>Pressing the <code>Enter</code> key in the search query will run the query again even if it hasn't been changed.</li>\n<li>The account tab now has a loading animation, instead of showing a &quot;login&quot; page before quickly flashing to the logged in version.</li>\n<li>Search results are now sorted (by path alphabetic) instead of going through files in a somewhat-random order.</li>\n<li>Tags can now use <code>_</code> (underscore) as part of the name.</li>\n<li>Video and audio embeds are now loaded in chunks as they are played, instead of being fully loaded into memory when they open. This should also fix any performance issues and crashes related to having many media embeds in the same file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Graph view now properly recognizes heading links to the same file.</li>\n<li>Search should now properly show all results, instead of having the last few disappear when scrolling.</li>\n<li>The highlighting for <code>]]</code> was fixed again for some edge cases.</li>\n<li>Panes that overflow to the right side should no longer push other panes around due to a CSS bug.</li>\n<li>Spellcheck dictionary overflow in settings should no longer happen.</li>\n<li>The outline when clicking a LaTeX expression in preview mode has been removed.</li>\n<li>Long words and URLs now wrap correctly, instead of overflowing and requiring scrolling to see.</li>\n<li>Daily notes settings page should show the format correctly now the first time when you open it.</li>\n<li><code>Ctrl/Cmd+D</code> used to not work in Vim mode because it was bound to another operation; that should now work properly to scroll down half a page.</li>\n<li>Unsupported files, most notably <code>obsidian.css</code>, should no longer show up in quick switcher.</li>\n<li>Some parts of the interface previously allowed text selection, which was confusing. That should no longer happen.</li>\n<li>Fixed an editor crash issue caused by using a checklist inside a footnote.</li>\n<li>Word count for large files should no longer cause lag.</li>\n<li>Changing custom CSS no longer causes the editor to enter a broken state until the app is reloaded.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There's now a new Outline plugin, which works in the same way as the backlinks pane. An &quot;unlinked&quot; sidebar pane will show the outline of the current file, while a &quot;linked&quot; pane will always show the outline of the linked pane.</li>\n<li>Open with Default App plugin now also adds &quot;Show in Folder&quot; option which will open the system file manager and highlight the file.</li>\n<li>You can now scroll beyond the last line of the file.</li>\n<li>HTML tags with <code>style</code> properties are now allowed to be added to elements, style all the things!</li>\n<li>HTML <code>iframe</code> tags are now allowed, which can be used to embed various external pages like YouTube, Google Maps, etc.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Graph view now has smoother fading animations when hovering with mouse.</li>\n<li>Search regex now uses multiline mode, which means <code>^</code> will now match beginning of line and <code>$</code> will now match end of line.</li>\n<li>Link auto-complete and quick switcher would match the file name as a priority, instead of always matching the full path. This should improve the match ordering for searcher that contain characters in the parent folder, such as searching for &quot;task&quot; in &quot;test/task.md&quot; which previously matched &quot;[t]est/t[ask]&quot; instead of &quot;test/[task]&quot;.</li>\n<li>The HTML sanitizer is now a lot faster, making large documents more performant.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Switching between edit mode and preview mode no longer loses your scroll position from the top, so you won't have to scroll all the way down again.</li>\n<li>Global search fixes:\n<ul>\n<li>&quot;quoted string&quot; did not properly match full words when containing punctuation or whitespace characters, such as &quot;- [ ]&quot;. It should work now.</li>\n<li>/regex/ previously required two backslashes to escape characters, for example, <code>/\\[\\]/</code> previously didn't work, requiring <code>/\\\\[\\\\]/</code>. Now you don't need to add the second backslash.</li>\n<li>When clicking on a search result, sometimes the highlights were off by a few characters. This was caused by Windows-style line endings &quot;\\r&quot;, and should no longer cause any trouble.</li>\n<li>Search results sometimes didn't show all results when scrolling. Also sometimes the results would flicker and jump around. That should stop happening now.</li>\n<li>Fixed search operator <code>ignore-case:</code> previously made the search case sensitive instead of what it says it does, oops.</li>\n</ul>\n</li>\n<li>Link autocomplete should no longer generates a leading <code>/</code> for relative links.</li>\n<li>Fixed <code>]]</code> not properly styled in headings, which made them appear really small.</li>\n<li>Table headers are now properly aligned using table alignment options.</li>\n<li>Fixed editor horizontal scrollbar hidden behind text, so it could not be interacted with.</li>\n<li>Fixed <code>$$</code> latex blocks couldn't contain single dollar signs <code>$</code>.</li>\n<li>Backlinks pane now no longer cause lag when switching documents in a vault with heavy linking.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Major new feature: Search has been massively improved and expanded! Check this out:\n<ul>\n<li>Words in the search query separated by space will be searched independently in each file.</li>\n<li><code>&quot;Quoted strings&quot;</code> can be used to perform full word match. <code>&quot;test&quot;</code> will not match the word <code>testing</code>. Use backslash <code>\\&quot;</code> to escape double quotes and <code>\\\\</code> to escape backslash.</li>\n<li>Regular expressions (regex) can now be used in search. Use forward slash to denote a regular expression. For example: <code>/[a-z]{3}/</code>.</li>\n<li>Boolean operations can now be used. Use <code>OR</code> to match one or another. Use <code>-</code> to negate a query. The space character is used for boolean &quot;and&quot;.</li>\n<li>Parenthesis can be used to group boolean operations. For example <code>(a OR b) (c OR d)</code>.</li>\n<li>Several special operators are available. Some operators allow nesting queries using parenthesis, for example: <code>file:(&quot;to be&quot; OR -&quot;2B&quot;)</code>.\n<ul>\n<li><code>file:</code> will perform the following subquery on the file name. For example: <code>file:&quot;.jpg&quot;</code>.</li>\n<li><code>path:</code> will perform the following subquery on the file path, absolute from the root. For example: <code>file:&quot;Daily Notes/2020-07&quot;</code>.</li>\n<li><code>match-case:</code> and <code>ignore-case:</code> will override the case sensitive match logic for the following subquery.</li>\n</ul>\n</li>\n<li>There are now options in the search interface to provide different types of results:\n<ul>\n<li><code>Collapse results</code> will toggle between just showing matching note names and showing the lines in which matches appear. These extended results can be toggled for each note by clicking on the folding triangle next to the file name.</li>\n<li><code>Match Case</code> will do what it says, but note that it can be overridden on a per-search basis as per above.</li>\n<li><code>Explain Search Terms</code> will show you what the search is actually looking for in plain terms, so you can debug complex searches.</li>\n</ul>\n</li>\n<li>And search results are now optimized to only render results visible in the scrollable box. This means no more lag when there are a lot of search matches.</li>\n<li>You can also star search queries for quick navigation using the &quot;Starred&quot; plugin.</li>\n</ul>\n</li>\n<li>There is a new option for link suggestions to auto-complete paths in relative format, vault-absolute format, or our default &quot;shortest unique path&quot;. This option can be found in Settings &gt; File.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Daily Notes plugin now adds commands to go to previous and next day's note, if they exist. You will only see these in the Command Palette if you are in a daily note. A daily note for these purposes is defined as &quot;matching the date format set in the daily notes plugin settings,&quot; so so any notes that don't use the specified date format won't be navigated to.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Excessive padding for media embeds (images, audio, video) have been slimmed down.</li>\n<li>There was a bug in the recognition of tags with numbers wherein some would be shown as tags in preview but not edit mode. That is fixed now.</li>\n<li>And we fixed the thing where toggle highlight command would just add more <code>==</code> instead of toggling as the name would suggest.</li>\n<li>Mermaid graphs would sometimes have boxes clip the last few letters of the text. That shouldn't happen anymore.</li>\n</ul>\n","major_release":false}]