[{"version":{"major":1,"minor":8,"patch":9,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":2,"day":28},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-02-28-desktop-v1.8.9/\">Obsidian Desktop v1.8.9</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Onboarding: Improved clarity around managed and self-managed passwords for Obsidian Sync.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":2,"day":28},"info":"<h2>No longer broken</h2>\n<ul>\n<li>File changes made shortly after opening the app now properly save to File Recovery.</li>\n<li>Fixed numbered lists getting numbered incorrectly when nested inside a bulleted list.</li>\n<li>Clicking on a stacked tab in reading mode will now properly scroll the tab into view.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":8,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":2,"day":25},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-02-25-desktop-v1.8.8/\">Obsidian Desktop v1.8.8</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Android: Fixed regression causing large vaults to take significantly longer to load and save the cache (bug since Chromium 130).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":2,"day":25},"info":"<h2>Improvements</h2>\n<ul>\n<li>Updated translations.</li>\n<li>Improved app performance when a tree view (e.g. File explorer) is displaying a large number of items.</li>\n<li>Updated app settings to reflect changes to the Commercial license.</li>\n<li>List auto-numbering now preserves custom starting numbers.</li>\n<li>Obsidian Sync: Added a warning before connecting to a remote vault if the vault is already managed by a third-party sync service that could cause conflicts.</li>\n<li>When &quot;Smart indent lists&quot; is disabled, the editor no longer automatically renumbers lists.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed regression causing large vaults to take significantly longer to load and save the cache (bug since Electron 33).</li>\n<li>Live preview now correctly renders <code>- - -</code> as a horizontal rule.</li>\n<li>Notes with corrupted fold information can now be opened.</li>\n<li>Tables inside embeds will now render full width.</li>\n<li>Checklist items inside loose lists are indented correctly.</li>\n<li>Clicking inside a PDF view now focuses the view.</li>\n<li>Folding a list item in reading mode now persists when switching to edit mode.</li>\n<li>If properties are hidden, pressing <code>Down Arrow</code> from the inline title focuses the editor.</li>\n<li>Creating a new vault via the &quot;Quick start&quot; button now opens <code>welcome.md</code>.</li>\n<li>Link suggestions now include files with extensions registered by plugins.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":7,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2025,"month":2,"day":18},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-02-18-desktop-v1.8.7/\">Obsidian Desktop v1.8.7</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Android: The onboarding flow now has the option to use an existing folder as a vault.</li>\n<li>Fixed File Recovery and Sync crashing when iOS was in Lockdown Mode.</li>\n<li>&quot;Toggle left sidebar&quot; and &quot;Toggle right sidebar&quot; commands now work on phones.</li>\n<li>Fixed regression with sidebar pinning not being available on tablet devices.</li>\n<li>Fixed bug where pressing and holding on results in Global Search and Backlinks did not show the menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2025,"month":2,"day":18},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved the &quot;Insert horizontal rule&quot; command to behave more intuitively when used on a non-empty line.</li>\n<li>The title bar is now visible while the app is loading, allowing the window to be dragged and minimizing, maximizing, and closing on Windows and Linux.</li>\n<li>Outgoing Links: Right-clicking on links now shows the file menu.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue with adjacent numbered lists being considered part of the same list and having incorrect list numbers applied.</li>\n<li>Fixed issue where <code>Shift-Enter</code> inside a list did not add the correct indentation.</li>\n<li>Fixed missing CSS variable <code>--font-mermaid</code> for setting a custom font in Mermaid graphs.</li>\n<li>Web viewer: Clicking on results in the Web history view will open in the background if &quot;Always focus new tabs&quot; is turned off in Editor settings.</li>\n<li>Web viewer: Fixed issue with &quot;Clear web viewer data&quot; not fully removing the stored session data.</li>\n<li>Web viewer: Fixed issue with built-in Ad blocker not properly capturing web requests.</li>\n<li>Web viewer: Fixed bug where &quot;Save to vault&quot; failed without displaying an error.</li>\n<li>Bookmarks: Clicking a bookmarked URL will now open it in your external browser by default, unless you have Web viewer configured to open external links.</li>\n<li>Fixed regression in Mermaid causing some text to get chopped off when the window's zoom level was not 100%.</li>\n<li>Fixed page preview appearing unexpectedly after using Graph view then pressing <code>Command/Ctrl</code>.</li>\n<li>Fixed issue where dragging and dropping files into a property field caused old values to reappear.</li>\n<li>Fixed right-clicking on history navigation buttons unintentionally triggering navigation.</li>\n<li>Fixed bug where page preview would immediately hide when opening it from a pop-out window.</li>\n<li>Settings: Fixed issue where the attachment folder field didn’t display the selected folder name.</li>\n<li>Fixed issue where closing a vault with pop-out windows would not reopen when relaunching Obsidian.</li>\n<li>Outline: Fixed scroll position issues when &quot;Auto-reveal current section&quot; was enabled and rapidly clicking different headings.</li>\n<li>Fixed <code>Option-Shift-M</code> hotkey not working.</li>\n<li>Fixed reading mode not properly folding headings when opening a file.</li>\n<li>Fixed changes to the folding API that caused some plugins to malfunction.</li>\n<li>Fixed issue where opening a file in a new split or new window didn’t focus the editor.</li>\n<li>Selecting a tab from the tabs menu will now properly focus the tab.</li>\n<li>All Properties: Fixed &quot;Rename&quot; menu item not being available if you select a property with <code>Alt</code> (<code>Option</code> on macOS).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":7,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":2,"day":14},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed regression with sidebar pinning not being available on tablet devices.</li>\n<li>Fixed bug where pressing and holding on results in Global Search and Backlinks did not show the menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":6,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":2,"day":12},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-02-12-desktop-v1.8.6/\">Obsidian Desktop v1.8.6</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed File Recovery and Sync crashing when iOS was in Lockdown Mode.</li>\n<li>&quot;Toggle left sidebar&quot; and &quot;Toggle right sidebar&quot; commands now work on phones.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":2,"day":12},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved the &quot;Insert horizontal rule&quot; command to behave more intuitively when used on a non-empty line.</li>\n<li>The title bar is now visible while the app is loading, allowing the window to be dragged and minimizing, maximizing, and closing on Windows and Linux.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where dragging and dropping files into a property field caused old values to reappear.</li>\n<li>Web viewer: Fixed bug where &quot;Save to vault&quot; failed without displaying an error.</li>\n<li>Fixed right-clicking on history navigation buttons unintentionally triggering navigation.</li>\n<li>Fixed bug where page preview would immediately hide when opening it from a pop-out window.</li>\n<li>Settings: Fixed issue where the attachment folder field didn’t display the selected folder name.</li>\n<li>Fixed issue where closing a vault with pop-out windows would not reopen when relaunching Obsidian.</li>\n<li>Outline: Fixed scroll position issues when &quot;Auto-reveal current section&quot; was enabled and rapidly clicking different headings.</li>\n<li>Fixed <code>Option-Shift-M</code> hotkey not working.</li>\n<li>Fixed reading mode not properly folding headings when opening a file.</li>\n<li>Fixed changes to the folding API that caused some plugins to malfunction.</li>\n<li>Fixed issue where opening a file in a new split or new window didn’t focus the editor.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":5,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":2,"day":3},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-02-03-desktop-v1.8.5/\">Obsidian Desktop v1.8.5</a>.</p>\n<ul>\n<li>Android: The onboarding flow now has the option to use an existing folder as a vault.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":2,"day":3},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue with adjacent numbered lists being considered part of the same list and having incorrect list numbers applied.</li>\n<li>Fixed issue where <code>Shift-Enter</code> inside a list did not add the correct indentation.</li>\n<li>Fixed missing CSS variable <code>--font-mermaid</code> for setting a custom font in Mermaid graphs.</li>\n<li>Web viewer: Clicking on results in the Web history view will open in the background if &quot;Always focus new tabs&quot; is turned off in Editor settings.</li>\n<li>Web viewer: Fixed issue with &quot;Clear web viewer data&quot; not fully removing the stored session data.</li>\n<li>Web viewer: Fixed issue with built-in Ad blocker not properly capturing web requests.</li>\n<li>Bookmarks: Clicking a bookmarked URL will now open it in your external browser by default, unless you have Web viewer configured to open external links.</li>\n<li>Fixed regression in Mermaid causing some text to get chopped off when the window's zoom level was not 100%.</li>\n<li>Fixed page preview appearing unexpectedly after using Graph view then pressing <code>Command/Ctrl</code>.</li>\n</ul>\n<h2>Third-party libraries</h2>\n<ul>\n<li>Updated Mermaid to 11.4.1.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":4,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2025,"month":1,"day":31},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-01-31-desktop-v1.8.4/\">Obsidian Desktop v1.8.4</a>.</p>\n<ul>\n<li>iOS: Fixed bug causing app to show a black screen after install.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2025,"month":1,"day":31},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug where pressing <code>Enter</code> inside a blockquote would not continue the blockquote onto the next line.</li>\n<li>Fixed bug where Canvas preview image would sometimes fail to display.</li>\n<li>Fixed bug causing some plugins to not focus the correct tab when they open a file.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":3,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2025,"month":1,"day":30},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-01-30-desktop-v1.8.3/\">Obsidian Desktop v1.8.3</a>.</p>\n<h2>Shiny new things</h2>\n<p>We've added a new experience when you first install the app. This guided flow should help new mobile users create a vault and understand how to have their notes synced across all their devices according to their needs.</p>\n<h2>Improvements</h2>\n<ul>\n<li>The file explorer context menu now shows:\n<ul>\n<li>a folder's file and folder count</li>\n<li>a file's creation time and modified time</li>\n</ul>\n</li>\n<li>We no longer wait for iCloud to finish syncing your configuration files. If a configuration file was offloaded, it will be redownloaded and you will be prompted to reload the app once the file was been synced.</li>\n<li>Added a command to open the tab switcher. This can be bound to the pull down action.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The active file will always be highlighted in the tab switcher.</li>\n<li>Fixed active file sometimes not getting reset when closing sidebar view.</li>\n<li>On iOS, tapping the status bar now always scrolls to the top of the active file. And scrolls to the top of the sidebar if one is active.</li>\n<li>Long-pressing on tabs in the tab switcher will no longer drag the tab preview image.</li>\n<li>Fixed Android keyboard auto-correction inserting extra text.</li>\n<li>iOS: Fixed rare bug where a folder would be created, but not detected by Obsidian until the app is rebooted.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":8,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2025,"month":1,"day":30},"info":"<h2>Highlights</h2>\n<ul>\n<li>Web viewer, a new core plugin, lets you open external links within Obsidian. This makes it easier to read linked content without leaving the app and improves multitasking for web research. The plugin is disabled by default and must be enabled manually in settings.</li>\n<li>Sync now has a new view option, &quot;Hide my changes,&quot; which hides your own file changes in a shared Obsidian sync vault.</li>\n<li>File Explorer now includes an option to automatically reveal the active file.</li>\n<li>Added the &quot;Download attachments for current file&quot; command, which downloads all externally embedded images and replaces the external links with internal embeds.</li>\n<li>Added the &quot;Insert footnote&quot; command. Footnote autocomplete now provides a fallback to create a new footnote if no match is found.</li>\n<li>Tags view now includes a search filter.</li>\n<li>Outline now has an &quot;Auto-scroll to current section&quot; option.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>When modifying a numbered list, the numbers are now updated automatically.</li>\n<li>Recently used commands now appear at the top of the command palette.</li>\n<li>Editor suggestions now scroll back to the top when input changes.</li>\n<li>Middle-clicking the tab forward/back navigation buttons now opens the file in a new tab.</li>\n<li>Added a &quot;Comment&quot; option to the editor context menu under the &quot;Format&quot; submenu.</li>\n<li>Improved handling of files with invalid frontmatter:\n<ul>\n<li>Reading mode now shows an error message at the top of the file.</li>\n<li>The &quot;Add property&quot; command now shows an error instead of removing invalid frontmatter.</li>\n</ul>\n</li>\n<li>Canvas groups can now have empty labels, which remain visible while editing.</li>\n<li>Canvas cards now stay mounted while being actively edited, even when zoomed out.</li>\n<li>Sync version history now renders a preview image when viewing a Canvas file.</li>\n<li>The &quot;Search current file&quot; search bar now displays the total number of results.</li>\n<li>Improved rendering of bookmarked URLs in the quick switcher.</li>\n<li>Pressing the <code>Down</code> arrow key in search now removes the cursor from the search bar, making it easier to navigate results.</li>\n<li>The &quot;Insert template&quot; command now sorts templates by file path and displays folder names.</li>\n<li>Right-clicking anywhere in the File Explorer now shows a context menu.</li>\n<li>File Explorer now includes a menu option to create a new folder with the selected items.</li>\n<li>Individual values from list properties can now be copied using the context menu or <code>Command/Ctrl + C</code>.</li>\n<li>Right-clicking anywhere in the Local Properties view now shows the property menu.</li>\n<li>Dragging a file over a collapsed folder in File Explorer now automatically expands the folder.</li>\n<li>Sort options are now available in the properties menu.</li>\n<li><code>&lt;img&gt;</code>, <code>&lt;video&gt;</code>, <code>&lt;audio&gt;</code> and <code>&lt;source&gt;</code> tags with relative <code>src</code> paths are now rendered in Live Preview and Reading mode.</li>\n<li>The tab close button is now hidden if the tab is too small.</li>\n<li>In Sync History, clicking an active item now expands its entry.</li>\n<li>The callout context menu now includes an option to remove callout formatting.</li>\n<li>The &quot;Show backlinks in document&quot; preference is now saved for each tab in the workspace.</li>\n<li>The &quot;Show ribbon&quot; setting is now saved in <code>appearance.json</code> instead of <code>app.json</code>.</li>\n<li>Page previews on hover are now supported in tab headers of notes and attachments.</li>\n<li>Obsidian Publish now includes a new command, &quot;Open in live site,&quot; to open the current live version of a note.</li>\n<li>Improved the screen shown when connecting to a sync remote vault.</li>\n<li>The Sync plugin is now enabled by default to improve visibility in settings. Added a new command, &quot;Sync: Set up sync.&quot;</li>\n<li>File Explorer now automatically deselects files after they are moved into a collapsed folder.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Live Preview now renders reference-style links correctly.</li>\n<li>The &quot;Tab indent size&quot; setting now controls the visual width of tabs/indents.</li>\n<li>Fixed renaming headings and block IDs showing the incorrect number of modified files.</li>\n<li>Graph view no longer considers Canvas files as attachments.</li>\n<li>Fixed search sort order preference not always being saved.</li>\n<li>Layout and config changes now always save before quitting Obsidian.</li>\n<li>Fixed a rare bug where &quot;Insert template&quot; failed if the cursor was at the start of a file and the template content began with a horizontal rule.</li>\n<li>Fixed a bug where right-clicking the property icon while the property name was empty would hide the entire row.</li>\n<li>Fixed <code>Alt-Enter</code> not working if the cursor overlapped with the embed start <code>![[</code>.</li>\n<li>Fixed an issue where the app switched to the default theme after removing an inactive theme.</li>\n<li>Canvas now shows additional context menu options when multiple file cards are selected.</li>\n<li>Fixed missing margin on code blocks and callouts inside embeds.</li>\n<li>Fixed &quot;Rename file&quot; not working if a sidebar view was active.</li>\n<li>The media selection prompt no longer allows file creation when no results match the input.</li>\n<li>Pressing <code>Shift-Enter</code> in text property input now correctly uses the current input text value.</li>\n<li>Fixed link resolution when a filename ends with a Greek character.</li>\n<li>Footnote IDs are now case-insensitive.</li>\n<li>Fixed flickering when selecting text in PDFs.</li>\n<li>Embedded headings now correctly render Markdown formatting (e.g., <code>## *Hello*, World</code>).</li>\n<li>Increased contrast for code color and added CSS variables for code block borders.</li>\n<li>Clicking the &quot;Copy&quot; button in a callout no longer switches it to source mode.</li>\n<li>Added a &quot;Retry&quot; button when failing to load remote vaults due to a poor network connection.</li>\n<li>Fixed some Japanese characters rendering incorrectly when using the default font.</li>\n<li>Fixed <code>rem</code> units in pop-out windows not matching the main window.</li>\n<li>Fixed an issue where inline footnotes were not always processed by the metadata cache.</li>\n<li>Fixed CSS specificity of task checkbox position in editable lines to avoid conflicting with rendered checkboxes in source mode (e.g. callouts).</li>\n<li>Property value inputs now respect the spellcheck setting.</li>\n<li>Fixed Search sometimes forgetting the sort order after using &quot;Search in all files.&quot;</li>\n<li>Fixed &quot;Rename heading&quot; and &quot;Rename block ID&quot; not working when triggered from an embed.</li>\n<li>Fixed the &quot;Excluded files&quot; screen not properly saving.</li>\n<li>Updated the description of &quot;Tab indent size&quot; to better match its behavior.</li>\n<li>Fixed a bug where editing an embedded heading (e.g., <code>[[file#heading]]</code>) from Page Preview modified the heading text.</li>\n<li>Fixed MathJax not rendering inside embedded headings.</li>\n<li>Fixed a bug where commands did not work correctly when navigating from a note to an attachment. For example, <code>Command/Ctrl + F</code> sometimes did not work in PDF view.</li>\n<li>Fixed PDF view's &quot;Copy link to selection&quot; sometimes applying the selection to the wrong text node.</li>\n<li>Pressing <code>Enter</code> in a multi-line list item now continues the list properly.</li>\n<li>Fixed &quot;Toggle comment&quot; sometimes placing the cursor in the wrong position.</li>\n<li>Fixed an issue where closing a pop-out window at certain times prevented events like saving the workspace from firing.</li>\n<li>Fixed a bug where opening a note with folded headings didn't restore folds correctly if a heading contained a code block.</li>\n<li>Fixed Graph view errors when setting &quot;force&quot; options to <code>0</code>.</li>\n<li>Fixed page previews not working reliably in Graph view:\n<ul>\n<li>Hovering over nodes now reliably opens page previews.</li>\n<li>Hovering then pressing the modifier key also opens the page preview.</li>\n<li>Hovering over multiple nodes in quick succession now properly updates the preview.</li>\n</ul>\n</li>\n<li>Clicking a link in the sidebar (without pressing a modifier) now correctly focuses the tab.</li>\n<li>Fixed an issue where double-clicking a node label in Canvas switched the node to edit mode.</li>\n</ul>\n<h2>Third-party libraries</h2>\n<ul>\n<li>Updated Electron to 33.3.2.</li>\n<li>Upgraded Prism.js to 1.29.0.</li>\n<li>Upgraded Turndown to 7.2.0.</li>\n<li>Upgraded Mermaid to 11.3.0.</li>\n<li>Upgraded CodeMirror to the latest version.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":8,"patch":3,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":1,"day":28},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-01-28-desktop-v1.8.3/\">Obsidian Desktop v1.8.3</a>.</p>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":1,"day":28},"info":"<h2>Improvements</h2>\n<ul>\n<li>Recently used commands now appear at the top of the command palette.</li>\n<li>The editor suggestions now scroll back to the top on input changes.</li>\n<li>Middle-clicking on the tab forward/back navigation buttons now opens the file in a new tab.</li>\n<li>Added a &quot;Comment&quot; option to the editor context menu under the &quot;Format&quot; submenu.</li>\n<li>Improved handling of files with invalid frontmatter:\n<ul>\n<li>Reading mode shows an error message at the top of the file.</li>\n<li>The &quot;Add property&quot; command now shows an error instead of removing invalid frontmatter.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed line renumbering issue when pasting multi-line list items. Subsequent numbers now update correctly.</li>\n<li>Pressing <code>Enter</code> in a multi-line list item now continues the list properly.</li>\n<li>Fixed regression where the &quot;Open in new window&quot; command caused files to fail to open.</li>\n<li>Fixed &quot;Toggle comment&quot; command sometimes placing the cursor in the wrong position.</li>\n<li>Fixed hover preview sometimes appearing in the wrong position.</li>\n<li>Fixed issue where closing a pop-out window at certain times prevented events like saving the workspace from firing.</li>\n<li>Fixed issue where the &quot;Toggle backlinks in document&quot; command threw an error.</li>\n<li>Fixed bug where opening a note with folded headings didn’t restore folds correctly if a heading contained a code block.</li>\n<li>Fixed graph view errors when setting &quot;force&quot; options to <code>0</code>.</li>\n<li>Fixed page preview not working reliably in Graph view:\n<ul>\n<li>Hovering over nodes now reliably opens page previews.</li>\n<li>Hovering then pressing the modifier key also opens the page preview.</li>\n<li>Hovering over multiple nodes in quick succession now properly updates the preview.</li>\n</ul>\n</li>\n<li>Clicking a link in the sidebar (without pressing a modifier) now focuses the tab as expected.</li>\n<li>Canvas: Fixed issue where double-clicking a node label switched the node to edit mode.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":2,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":1,"day":22},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-01-22-desktop-v1.8.2/\">Obsidian Desktop v1.8.2</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Android devices not being able to create a new vault via the new onboarding flow.</li>\n<li>Fixed Android vault switcher not being able to create a new vault.</li>\n<li>Fixed Android keyboard auto-correction inserting extra text.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":1,"day":22},"info":"<h2>Improvements</h2>\n<ul>\n<li>When a numbered list is modified, the numbers are now automatically updated.</li>\n<li>Added a new File Explorer option to auto-reveal the active file.</li>\n<li>Added &quot;Insert footnote&quot; command. The footnote autocomplete also provides a fallback to create a new foot note if there is no match.</li>\n<li>The &quot;Bookmark...&quot; menu item now appears when clicking the &quot;...&quot; (more options) button in the Web Viewer.</li>\n<li>Canvas groups can now have empty labels, which will remain visible during editing.</li>\n<li>Canvas cards will stay mounted while actively being edited, even when zoomed out.</li>\n<li>Sync version history now renders a preview image when viewing a Canvas file.</li>\n<li><code>&lt;source&gt;</code> HTML elements now support relative links.</li>\n<li>The &quot;Search current file&quot; search bar now displays the total number of results.</li>\n<li>Improved rendering of bookmarked URLs in the quick switcher.</li>\n<li>Search: Pressing the &quot;Down&quot; arrow key now removes the cursor from the search bar, making it easier to navigate results using arrow keys.</li>\n<li>Tags view: Added a search filter.</li>\n<li>Templates: The &quot;Insert template&quot; screen now sorts templates by file path and displays folder names.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed several IME-related issues:\n<ul>\n<li>In Canvas, typing after <code>1.</code> no longer causes extra characters.</li>\n<li>On macOS, the Chinese IME prompt now renders in the correct position.</li>\n</ul>\n</li>\n<li>Fixed the &quot;Copy search results&quot; menu item creating invalid links to <code>.canvas</code> files.</li>\n<li>Fixed errors when rendering HTML media elements without a <code>src</code> attribute.</li>\n<li>Added a &quot;Retry&quot; button for Sync failures when connecting to remote vaults.</li>\n<li>Fixed instances where editor commands failed while editing a card in Canvas.</li>\n<li>Improved the loading experience for Obsidian Sync when connecting to a remote vault.</li>\n<li>Plugin and theme screens now show an error state if there is no internet connection.</li>\n<li>Fixed the &quot;Add property&quot; command not focusing the property input when the Local Properties view was previously closed.</li>\n<li>Fixed the Tags View not updating collapse indicators (<code>&gt;</code> symbols) when pressing &quot;Show nested tags.&quot;</li>\n<li>Fixed an issue where double-clicking PDF highlights caused them to temporarily disappear.</li>\n<li>Fixed an issue where YouTube links with timestamps didn’t play at the correct time.</li>\n<li>Fixed &quot;Download attachments for current file&quot; command mischaracterizing some images file extensions.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":1,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2025,"month":1,"day":7},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2025-01-07-desktop-v1.8.1/\">Obsidian Desktop v1.8.1</a>.</p>\n<h2>Shiny new things</h2>\n<p>We've added a new experience when you first install the app. This guided flow should help new mobile users create a vault and understand how to have their notes synced across all their devices according to their needs.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Long-pressing on tabs in the tab switcher will no longer drag the tab preview image.</li>\n<li>iOS: Fixed rare bug where a folder would be created, but not detected by Obsidian until the app is rebooted.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2025,"month":1,"day":7},"info":"<h2>Improvements</h2>\n<ul>\n<li><code>&lt;img&gt;</code>, <code>&lt;video&gt;</code> and <code>&lt;audio&gt;</code> tags with relative <code>src</code> paths are now rendered in Live Preview and Reading mode.</li>\n<li>The &quot;Show ribbon&quot; setting is now saved in appearance.json instead of app.json.</li>\n<li>Added dedicated context menu item to open external link in web viewer.</li>\n<li>Added page preview to tab headers of notes and attachments.</li>\n<li>Outline view has a new option: &quot;Auto-scroll to current section&quot;</li>\n<li>Publish: New command &quot;Open in live site&quot; to open the current live version of the note.</li>\n<li>Web viewer: New command &quot;Save to vault&quot; to convert the current webpage to Markdown and save it into your vault.</li>\n<li>Web viewer: Added a loading bar.</li>\n<li>The &quot;Download attachment&quot; command now supports <code>data:</code> base64 URIs.</li>\n<li>Improved screen when connecting to Sync remote vault.</li>\n<li>The Sync plugin is now enabled by default to improve its visibility in Settings. Added a new command &quot;Sync: Set up Sync.&quot;</li>\n<li>File Explorer: Files are automatically deselected after being moved into a collapsed folder.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue causing some pages in the web viewer to fail to load.</li>\n<li>Property value inputs now respect your spellcheck setting.</li>\n<li>Fixed web viewer failing to load case-sensitive web-pages.</li>\n<li>Fixed errors in console when navigating in the web viewer while the current page is still loading.</li>\n<li>Search: Fix search sometimes forgetting the sort order after using the &quot;Search in all files&quot; command.</li>\n<li>Fixed &quot;Download attachment&quot; command mischaracterizing SVG images.</li>\n<li>Fixed &quot;Rename heading&quot; and &quot;Rename block ID&quot; not working when fired from an embed.</li>\n<li>Fixed &quot;Excluded files&quot; modal not properly saving.</li>\n<li>Fixed &quot;Duplicate&quot; menu item not working in old installers.</li>\n<li>Updated the description of &quot;Tab indent size&quot; to better match its behavior.</li>\n<li>Fixed bug where editing an embedded heading (e.g. <code>[[file#heading]]</code>) from Page Preview would cause the heading text to be modified.</li>\n<li>Fixed Mathjax not rendering inside embedded heading.</li>\n<li>Fixed bug where commands did not work as expected when navigating from a Markdown view to a non-Markdown view. For example, <code>Control/Command+F</code> would sometimes not work inside a PDF View.</li>\n<li>Fixed PDF View's &quot;copy link to selection&quot; sometimes putting the selection on the wrong text node.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":0,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":12,"day":18},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2024-12-18-desktop-v1.8.0/\">Obsidian Desktop v1.8.0</a>.</p>\n<h3>Improved</h3>\n<ul>\n<li>The file explorer context menu now shows:\n<ul>\n<li>a folder's file and folder count</li>\n<li>a file's creation time and modified time.</li>\n</ul>\n</li>\n<li>We no longer wait for iCloud to finish syncing your configuration files. If a configuration file was offloaded, it will be redownloaded and you will be prompted to reload the app once the file was been synced.</li>\n<li>The active file will always be highlighted in the tab switcher</li>\n<li>Added a command to open the tab switcher. This can be bound to the pull down action.</li>\n<li>Fixed active file sometimes not getting reset when closing sidebar view.</li>\n<li>On iOS, tapping the status bar now always scrolls to the top of the active file. And scrolls to the top of the sidebar if one is active.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":8,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":12,"day":18},"info":"<h3>New</h3>\n<ul>\n<li>Web viewer, a new core plugin, lets you open external links within Obsidian. This simplifies reading linked content without leaving the app and makes multitasking on web research projects easier. This plugin is disabled by default, and needs to be enabled manually in settings.</li>\n<li>Added a &quot;hide my changes&quot; button to hide your own file changes from the Sync view in a shared Obsidian Sync vault.</li>\n</ul>\n<h3>Improved</h3>\n<ul>\n<li>New command &quot;Download attachments for current file&quot; downloads all externally embedded images and replaces the external links with internal embeds.</li>\n<li>You can now copy individual values from list properties via the context menu or <code>Command/Ctrl + C</code>.</li>\n<li>Right clicking anywhere in the local properties view now shows property menu.</li>\n<li>File Explorer now displays a context menu when you right-click in the tree view.</li>\n<li>File Explorer now includes a menu option to create a new folder with selected items.</li>\n<li>Dragging a file over a collapsed folder in the file explorer will now automatically expand the folder.</li>\n<li>Sort options are now available in the properties menu.</li>\n<li>Tab close button will now be hidden if the tab is too small.</li>\n<li>In the Sync history view, clicking on an active item now expands its entry.</li>\n<li>The callout context menu now includes the option to remove the callout formatting.</li>\n<li>The &quot;Show backlinks in document&quot; preference is now saved on a per-file basis.</li>\n</ul>\n<h3>Bug fixes</h3>\n<ul>\n<li>Live Preview now renders reference-style links correctly.</li>\n<li>Tab size setting now controls the visual width of the tab/indent.</li>\n<li>Fixed renaming headings and block IDs showing the incorrect number of modified files.</li>\n<li>Graph view will no longer consider Canvas files as &quot;Attachments.&quot;</li>\n<li>Fixed search sort order preference not always being saved.</li>\n<li>Layout and config changes will now always be saved before quitting Obsidian.</li>\n<li>Fixed rare bug where &quot;insert template&quot; fails if cursor is at the start of a file and the template content begins with a horizontal rule.</li>\n<li>Don't allow right-clicking on the property icon if the property name is empty.</li>\n<li>Fixed <code>Alt-Enter</code> not working if cursor overlaps with the embed start <code>![[</code>.</li>\n<li>Fixed issue where the app switched to the default theme after removing an inactive theme.</li>\n<li>Canvas now shows additional context menu options when multiple file cards are selected.</li>\n<li>Fix missing margin on code blocks and callouts inside embeds.</li>\n<li>Fixed &quot;Rename file&quot; not working if sidebar view is active.</li>\n<li>The media selection prompt no longer allows for file creation when no results match the current input.</li>\n<li>Shift-enter in text property input enter should use the current input text value.</li>\n<li>Fix link resolution when filename ends with a Greek character.</li>\n<li>Footnote IDs are now case-insensitive.</li>\n<li>Fix flickering when selecting text in PDFs.</li>\n<li>The Markdown in an embedded heading will now be rendered correctly (e.g. <code>## *Hello*, World</code>).</li>\n<li>Increased the contrast of code color, and added CSS variables for code block borders.</li>\n<li>Clicking the &quot;Copy&quot; button in a callout no longer switches it to source mode.</li>\n<li>Added a &quot;Retry&quot; button when failing to load remote vaults due to poor network connection.</li>\n<li>Fixed issue with some Japanese characters rendering incorrectly when using the default font.</li>\n<li>Fix REM units in pop-out windows not matching main window.</li>\n<li>Fix issue where inline footnotes are not always processed by the metadata cache.</li>\n<li>Fixed CSS specificity of task checkbox position in editable lines to avoid conflicting with rendered checkboxes in source mode (e.g. callouts).</li>\n</ul>\n<h3>Third-party Libraries</h3>\n<ul>\n<li>Upgraded prism.js to 1.29.0.</li>\n<li>Upgraded Turndown to 7.2.0.</li>\n<li>Upgraded Mermaid to 11.3.0.</li>\n<li>Upgraded Codemirror to latest version.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":7,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":11,"day":18},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2024-11-18-desktop-v1.7.7/\">Obsidian Desktop v1.7.7</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Share Extension not working on iOS 18.</li>\n<li>Fixed drag and drop in the file explorer and outline view not working on iOS.</li>\n<li>Fixed scroll position getting lost when the sidebar is collapsed.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":11,"day":18},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed position of fold indicators in reading mode.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><a href=\"https://obsidian.md/download\">Installer</a> has been updated to Electron 32.2.5. This includes the fix for Developer Tools not remembering dark mode.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":6,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":11,"day":12},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2024-11-12-desktop-v1.7.6/\">Obsidian Desktop v1.7.6</a>.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed position of fold indicators in reading mode.</li>\n<li>Fixed Markdown viewport menu showing when dragging the cursor.</li>\n<li>Fixed iOS bug where Outline view didn’t update immediately after switching files.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":11,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed Canvas performance issue where media files were remounted during panning.</li>\n<li>Fixed issue with property editor where property names would overlap with the property values.</li>\n<li>Clicking on a link in page preview will no longer switch the preview to edit mode.</li>\n<li>Fixed regression where Obsidian URI left the target window minimized.</li>\n<li>Fixed issue with parser using too much memory to parse larger Markdown files. This could cause Obsidian to crash when opening very large Markdown files.</li>\n<li>Fixed File Explorer not highlighting the active file on initial load.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":5,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":11,"day":4},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2024-11-04-desktop-v1.7.5/\">Obsidian Desktop v1.7.5</a>.</p>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":11,"day":4},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Updated the behavior of the &quot;Add internal link&quot; command so the cursor is placed at the end of the link text, and the link suggestion pop-up appears.</li>\n<li>Fixed issues where Sync Sidebar timestamps would not reflect changes made locally.</li>\n<li>Improved render performance of Canvas when there are many nodes on the screen.</li>\n<li>Fixed issues where the attachment folder would be displayed incorrectly in settings.</li>\n<li>Fixed regression where the &quot;Add tag&quot; command was not causing the tag suggestions to appear.</li>\n<li>Fixed bug where Sandbox vault would fail to load if the &quot;Start here&quot; file was missing.</li>\n<li>File Explorer: &quot;Reveal in file navigation&quot; now waits for the view to load.</li>\n<li>Fixed bug where tree components (such as the Outline view) would be slow to refresh on Android.</li>\n<li>Fixed bug where switching between Obsidian and other apps would cause the navigation bar and the toolbar to both be active.</li>\n<li>Fixed &quot;Installing theme&quot; notice not disappearing when installing a legacy theme.</li>\n<li>Fixed middle-click not closing tabs.</li>\n<li>Fixed bug where Graph view options would sometimes get overridden when opening a new graph view.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The installer has been updated to use Electron v32 (requires downloading <a href=\"https://obsidian.md\">the latest installer</a>).</li>\n<li>Fixed vim <code>langmap</code> failing to load properly.</li>\n<li>Added a new debug mode for developers. To enable, run <code>app.debugMode(true);</code> in developer tools. When active, inline source maps will not be stripped from loaded plugins.</li>\n<li>Fixed MarkdownCodeBlockProcessor adding an extra newline when in reading mode.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":4,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":10,"day":16},"info":"<p>Includes all new functionality and bug fixes up to <a href=\"/changelog/2024-10-16-desktop-v1.7.4/\">Obsidian Desktop v1.7.4</a>.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>Added a new tab switcher.</li>\n</ul>\n<h2>Improvements</h2>\n<h3>Performance</h3>\n<ul>\n<li>Improved app load time for iOS, iPadOS, and Android.</li>\n<li>iOS: The option to skip iCloud loading will now appear earlier in the startup process.</li>\n<li>The app is now more responsive while loading iCloud vaults.</li>\n<li>The sidebar animation is now slightly faster.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Keyboard suggestions now appear for email and password inputs.</li>\n<li>The Android back button now closes the active page in settings.</li>\n<li>Moving the cursor by pressing and holding no longer activates links.</li>\n<li>Added a loading state to the &quot;Log out&quot; button.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where the pull-down action would activate too easily.</li>\n<li>Fixed bug where &quot;Close all tabs&quot; did not always close all the tabs.</li>\n<li>Fixed issue where the menu handle would cover text if the menu is scrollable.</li>\n<li>Fixed bug where Obsidian Vault would fail to load vaults if you log in from the initial vault selection screen.</li>\n<li>Fixed issue where the active state sometimes gets stuck when tapping on an interactive element.</li>\n<li>Fixed issue where table menus didn't show their options.</li>\n<li>Fixed display of dialog headers with long titles. Titles now get truncated to fit the screen.</li>\n<li>Fixed context menus on tablets not being scrollable.</li>\n<li>Settings buttons now show when they are active.</li>\n<li>Fixed issue where the screen would not have enough space when the keyboard is on screen and Stage Manager is active.</li>\n<li>Fixed issue where the keyboard would remain visible when a menu appears.</li>\n<li>Fixed spacing issue with the bottom toolbar when using a physical keyboard on small devices.</li>\n<li>Pressing &quot;Return&quot; when editing a setting now ends editing and hides the keyboard.</li>\n<li>Tapping on a video embed no longer brings up the keyboard.</li>\n<li>The &quot;Export as image&quot; command no longer appears in the command prompt.</li>\n<li>Fixed issue where selecting a sidebar item would not restore focus to the main view.</li>\n<li>Fixed a crash issue caused by the mobile tab switcher interacting with some plugins.</li>\n<li>Fixed a bug where tapping on the mobile toolbar for the first time would sometimes close the keyboard.</li>\n<li>Improved the appearance of some Obsidian Sync screens.</li>\n<li>Fix issue where an extra loading bar would appear for a couple frames as the splash screen is hiding.</li>\n</ul>\n<h3>Android</h3>\n<ul>\n<li>Updated haptics to match OS conventions for light, medium, and heavy interactions.</li>\n<li>Status bar and navigation bar now match the app background color.</li>\n<li>Android: Fixed tapping on tag causing the sidebar to open and immediately close.</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Fixed jitter when dismissing the keyboard on iOS.</li>\n<li>Improved screen resizing when the keyboard appears.</li>\n<li>Fixed issue where the video thumbnail would be blank until you press play.</li>\n</ul>\n<h3>Tablet</h3>\n<ul>\n<li>Fixed horizontal scrolling in community plugins with long descriptions.</li>\n<li>The community plugin sort button now matches the desktop version.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":7,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":10,"day":16},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Sync: the new Sync History view shows a list of edits across the vault, useful when <a href=\"https://help.obsidian.md/Obsidian+Sync/Collaborate+on+a+shared+vault\">collaborating on a shared vault</a>. Activate it using the &quot;Sync: Show Sync history&quot; command.</li>\n<li>You can now click inside a page preview to edit it without opening the note.</li>\n</ul>\n<h2>Improvements</h2>\n<h3>Performance</h3>\n<ul>\n<li>Views now load only when visible, improving startup performance and memory usage. This might cause issues with some plugins. We have <a href=\"https://docs.obsidian.md/Plugins/Guides/Understanding+deferred+views\">published a guide</a> to help developers update their plugins.</li>\n<li>Renaming files is now faster in large vaults.</li>\n<li>Canvas: Improved performance when panning. There should no longer be a flicker when cards enter and exit the viewport. If you're still seeing related issues, please try switching to default theme.</li>\n<li>Added a new screen in settings (General → Advanced) to show the total app load time. You can also enable a toggle to get a notified when startup takes too long, including details for debugging.</li>\n<li>Fixed choppy scrolling between linked Markdown views.</li>\n</ul>\n<h3>Editable page previews and footnotes</h3>\n<ul>\n<li>Added a right-click menu for footnotes to delete both the footnote and its reference.</li>\n<li>You can now create new footnotes by clicking on the hover preview of a footnote ID.</li>\n<li>Pressing <code>Esc</code> now instantly closes the page preview while editing.</li>\n<li>Page previews will stay open even if the window loses focus or the command palette appears.</li>\n</ul>\n<h3>Obsidian URI</h3>\n<ul>\n<li>Improvements to Obsidian URI <code>new</code>:\n<ul>\n<li>Allows the use of <code>clipboard</code> instead of <code>content</code> to insert the contents of the clipboard.</li>\n<li>Allows the use of <code>prepend</code> instead of <code>append</code> to add to the top of the file.</li>\n<li><code>prepend</code> and <code>append</code> will both attempt to merge properties.</li>\n</ul>\n</li>\n<li>Daily Notes: New <code>daily</code> Obsidian URI action to automatically open or create your daily note.</li>\n</ul>\n<h3>Misc.</h3>\n<ul>\n<li>Obsidian Publish collaborators can now edit content-related site options, including the order of sidebar items.</li>\n<li>Obsidian Sync: You can now filter the activity log.</li>\n<li>Updated to Electron v31.6.0.</li>\n<li>Spellcheck is now disabled for inline tags, and inside prompts like the quick switcher and command palette.</li>\n<li>Added support for <code>x.com</code> embeds in addition to <code>twitter.com</code>.</li>\n<li>Right-clicking in the gutter of a Markdown view now lets you quickly toggle line numbers or readable line width.</li>\n<li>The &quot;Make copy of&quot; menu item has been renamed to &quot;Duplicate&quot; on macOS to match OS conventions.</li>\n<li>Frontmatter is now hidden inside embedded editors such as Canvas file nodes and page preview.</li>\n<li>Dragging a <code>.webloc</code> or <code>.url</code> file into the editor creates a Markdown link with the filename as the display text.</li>\n<li>Hovering over a notice keeps it on screen until you move the mouse away.</li>\n<li>The &quot;Close all other tabs&quot; command no longer closes pinned tabs.</li>\n<li>The &quot;Close all tabs in tab group&quot; command is no longer available in sidebars.</li>\n<li>&quot;Insert Markdown link&quot; and &quot;Insert internal link&quot; commands now support multiple cursors.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where &quot;clear&quot; would overlap text inside prompts like the quick switcher.</li>\n<li>Fixed bug where search queries using <code>line:</code>, <code>block:</code>, and <code>task:</code> only returned matching files instead of the matching content.</li>\n<li>Pressing <code>ArrowDown</code> when the inline title is focused now properly focuses the editor if the property editor is hidden.</li>\n<li>Fixed issue where renaming a file would mangle Markdown links if the link destination was inside angle brackets.</li>\n<li>Fixed issue where moving a PDF view to a pop-out window caused errors.</li>\n<li>Fixed issue where &quot;Export to PDF&quot; created visual artifacts next to external links in right-to-left text.</li>\n<li>Fixed bug where some commands would cause the editor autocomplete to appear unexpectedly.</li>\n<li>Fixed bug where Obsidian Sync could deactivate itself when syncing to a device with &quot;Sync core plugins&quot; disabled.</li>\n<li>Fixed issue with the PDF view showing the wrong icon in the search bar.</li>\n<li>Fixed issue with inline YouTube previews not showing for some links.</li>\n<li>Context menus now display correctly in right-to-left mode.</li>\n<li>Fixed issue where links in footnotes appeared twice in the outgoing links view.</li>\n<li>Fixed bug where canvas files could become corrupted if they contained a file node with a custom property type.</li>\n<li>Long filenames no longer display an ellipsis at the end when being renamed.</li>\n<li>Fixed issue where clicking on a filename while renaming it would cancel the rename.</li>\n<li>The editor context menu no longer shows <em>Formatting</em> options when the selection is within a link or tag.</li>\n<li>Fixed issue where using the &quot;Fold all&quot; command on a long Markdown file incorrectly folded lines inside code blocks.</li>\n<li>Fixed bug where the link autocomplete sometimes generated invalid Markdown links without the <code>.md</code> file extension.</li>\n<li>Fixed an unresponsive area in the top corner of the screen when a notification was present.</li>\n<li>Fixed issue where popover scroll position reset when the popover was repositioned on the screen.</li>\n<li>Fixed issue where formatting commands were not always applied to table cell selections.</li>\n<li>Fixed bug where clicking on a tag in the Tag view would sometimes bring up the search suggestion box.</li>\n<li>Fixed bug where SVG files would not always show in page previews.</li>\n<li>Fixed issue where &quot;Log out&quot; wouldn't work if the server thought you were already logged out.</li>\n<li>Fixed issue where the PDF view's &quot;copy link to selection&quot; did not include display text if &quot;Use wikilinks&quot; was turned off.</li>\n<li>Fixed issue where the &quot;&gt;&quot; character after a bare link was incorrectly parsed as a quote block.</li>\n<li>Fixed bug where items were not always visible after filtering in the Outline view.</li>\n<li>Fixed issue where search highlights were not cleared when the current Outline view filter was cleared.</li>\n<li>Fixed the &quot;Insert link&quot; command creating incorrect text selections.</li>\n<li>Fixed an issue where &quot;Export to PDF...&quot; sometimes exported white text.</li>\n<li>Fixed a bug causing some editor suggestions from plugins to not update.</li>\n<li>Fixed keyboard navigation issues between the inline title, properties, and editor.</li>\n<li>Fixed &quot;Insert internal link&quot; not triggering autocomplete.</li>\n<li>Fixed cut/copy/paste not working when editing bookmark titles.</li>\n<li>Fixed a bug where creating a Markdown embed sometimes showed &quot;undefined&quot; as the display text.</li>\n<li>Fixed mouse back/forward buttons being processed twice in popout windows.</li>\n<li>Obsidian Sync: Fixed &quot;Show diff&quot; toggle not always working in Sync History.</li>\n<li>Clicking a property search result no longer focuses the File Properties view if frontmatter is visible in the document.</li>\n<li>Fixed styling issues with invalid frontmatter when &quot;Properties in document&quot; is set to &quot;source.&quot;</li>\n<li>Clicking &quot;Check for updates&quot; no longer causes layout shifts.</li>\n<li>Fixed a bug where Obsidian would not always wait for pending filesystem operations before quitting.</li>\n<li>Live preview now only escapes special characters (not letters and numbers).</li>\n<li>Fixed bug where escape characters at the start of a list item disappeared in Live Preview.</li>\n<li>Fixed issue where files couldn’t be moved into folders with a file of the same name but different capitalization.</li>\n<li>Fixed issue where links with custom display text under a table confused the Markdown parser.</li>\n<li>Vim: The latest bugfixes from our vim library (<code>codemirror-vim</code>) have been added. This includes fixes for arrow navigation on wrapped lines.</li>\n<li>Editor commands no longer trigger when the tab title is focused.</li>\n<li>Fixed URI action always getting delivered to the main window instead of the active pop-out window.</li>\n<li>Fixed clipboard URI actions not working when a pop-out window is active.</li>\n<li>Fixed issue with community themes only showing light or dark themes when the current theme is set to adapt to system.</li>\n<li>Fixed issue where sidebar tabs would stay focused after collapsing the sidebar.</li>\n<li>Fixed <code>Shift-ArrowUp</code> in the editor causing the inline title to get focused.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Plugin installation now automatically strips sourcemaps, making plugins smaller and faster to load.</li>\n<li>Theme developers: REM units are now synced with the base font size.</li>\n<li>Lucide icons have been updated to 0.446.0.</li>\n<li>Fixed <code>requestUrl</code> failing silently when the URL fails to resolve.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":7,"patch":4,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":10,"day":8},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.7.4.</li>\n</ul>\n<h2>Mobile</h2>\n<ul>\n<li>Android: Fixed tapping on tag causing the sidebar to open and immediately close.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":10,"day":8},"info":"<h2>Improvements</h2>\n<ul>\n<li>The &quot;Close all tabs in tab group&quot; command is no longer available in sidebars.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Editor commands no longer trigger when the tab title is focused.</li>\n<li>Fixed URI action always getting delivered to the main window instead of the active pop-out window.</li>\n<li>Fixed clipboard URI actions not working when a pop-out window is active.</li>\n<li>Fixed pinned icons not appearing on tabs until the tab is focused.</li>\n<li>Fixed issue with community themes only showing light or dark themes when the current theme is set to adapt to system.</li>\n<li>Fixed issue where sidebar tabs would stay focused after collapsing the sidebar.</li>\n<li>Fixed <code>Shift-ArrowUp</code> in the editor causing the inline title to get focused.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Lucide icons have been updated to 0.446.0.</li>\n<li>Fixed <code>requestUrl</code> failing silently when the URL fails to resolve.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":3,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":9,"day":24},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.7.3.</li>\n<li>iOS: The option to skip iCloud loading will now appear earlier in the startup process.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":9,"day":24},"info":"<h2>Improvements</h2>\n<ul>\n<li>If a plugin takes a while to load at startup, a message will appear and give you the option to disable the plugin and restart the app.</li>\n<li>The startup debug screen now shows how long individual plugins took to load.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed sidebar views not always updating to reflect the latest active file.</li>\n<li>Fixed extra history entries appearing in the view navigation list.</li>\n<li>Fixed <code>append</code> and <code>prepend</code> URI actions adding extra newlines when the file content is empty.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":2,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":9,"day":19},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.7.2.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fix issue where an extra loading bar would appear for a couple frames as the splash screen is hiding.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":9,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Views now load only when visible, improving startup performance and memory usage. This might cause issues with some plugins, but we've published <a href=\"https://docs.obsidian.md/Plugins/Guides/Understanding+deferred+views\">a guide</a> for plugin developers.</li>\n<li>Improvements to Obsidian URI <code>new</code>\n<ul>\n<li>Allows the use of <code>clipboard</code> instead of <code>content</code> to insert the contents of the clipboard.</li>\n<li>Allows the use of <code>prepend</code> instead of <code>append</code> to add to the top of the file.</li>\n<li><code>prepend</code> and <code>append</code> will both attempt to merge properties.</li>\n</ul>\n</li>\n<li>Daily Notes: New <code>daily</code> Obsidian URI action to automatically open or create your daily note.</li>\n<li>Renaming files is now faster in large vaults.</li>\n<li>Obsidian Sync: You can now filter the activity log.</li>\n<li>The startup debugging screen now shows the number of views loaded and deferred at startup.</li>\n<li>Minor tweaks were made to the status bar padding.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where hover previews didn’t disappear after creating a footnote.</li>\n<li>Fixed a bug where Obsidian would not always wait for pending filesystem operations before quitting.</li>\n<li>Canvas: Improved performance when panning. There should no longer be a flicker when cards enter and exit the viewport. If you're still seeing related issues, please try switching to default theme.</li>\n<li>The startup debugging screen now includes plugin versions in the clipboard result.</li>\n<li>Live preview now only escapes special characters (not letters and numbers).</li>\n<li>Fixed bug where escape characters at the start of a list item disappeared in Live Preview.</li>\n<li>Fixed issue where files couldn’t be moved into folders with a file of the same name but different capitalization.</li>\n<li>Fixed issue where links with custom display text under a table confused the Markdown parser.</li>\n<li>Vim: The latest bugfixes from our vim library (<code>codemirror-vim</code>) have been added. This includes fixes for arrow navigation on wrapped lines.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":1,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":8,"day":27},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.7.1.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved app load time for both iOS and Android.</li>\n<li>The app is now more responsive while loading iCloud vaults.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed a crash issue caused by the mobile tab switcher interacting with some plugins.</li>\n<li>Fixed a bug where tapping on the mobile toolbar for the first time would sometimes close the keyboard.</li>\n<li>Improved the appearance of some Obsidian Sync screens.</li>\n<li>Fixed jitter when dismissing the keyboard on iOS.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":8,"day":27},"info":"<h2>Improvements</h2>\n<ul>\n<li>Added a new screen in settings (General → Advanced) to show the total app load time. You can also enable a toggle to get a notified when startup takes too long, including details for debugging.</li>\n<li>Page previews will stay open even if the window loses focus or the command palette appears.</li>\n<li>Spellcheck is now disabled for inline tags.</li>\n<li>Pressing <code>Esc</code> now instantly closes the page preview while editing.</li>\n<li>Dragging a <code>.webloc</code> or <code>.url</code> file into the editor creates a Markdown link with the filename as the display text.</li>\n<li>Hovering over a notice keeps it on screen until you move the mouse away.</li>\n<li>Added a right-click menu for footnotes to delete both the footnote and its reference.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the &quot;Insert link&quot; command creating incorrect text selections.</li>\n<li>Fixed an issue where &quot;Export to PDF...&quot; sometimes exported white text.</li>\n<li>Fixed a bug causing some editor suggestions from plugins to not update.</li>\n<li>Fixed keyboard navigation issues between the inline title, properties, and editor.</li>\n<li>Fixed &quot;Insert internal link&quot; not triggering autocomplete.</li>\n<li>Fixed cut/copy/paste not working when editing bookmark titles.</li>\n<li>Fixed a bug where clicking &quot;create footnote&quot; could create multiple footnotes.</li>\n<li>Fixed editing nested page previews.</li>\n<li>Fixed a bug where creating a Markdown embed sometimes showed &quot;undefined&quot; as the display text.</li>\n<li>Fixed mouse back/forward buttons being processed twice in popout windows.</li>\n<li>Obsidian Sync: Fixed &quot;Show diff&quot; toggle not always working in Sync History.</li>\n<li>Clicking a property search result no longer focuses the File Properties view if frontmatter is visible in the document.</li>\n<li>Fixed styling issues with invalid frontmatter when &quot;Properties in document&quot; is set to &quot;source.&quot;</li>\n<li>Clicking &quot;Check for updates&quot; no longer causes layout shifts.</li>\n<li>Fixed math rendering in footnotes.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Plugin installation now automatically strips sourcemaps, making plugins smaller and faster to load.</li>\n<li>Theme developers: REM units are now synced with the base font size.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":0,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":8,"day":8},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.7.0.</li>\n</ul>\n<h2>Shiny new things</h2>\n<ul>\n<li>Added a new mobile tab switcher.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Keyboard suggestions now appear for email and password inputs.</li>\n<li>The Android back button now closes the active page in settings.</li>\n<li>Moving the cursor by pressing and holding no longer activates links.</li>\n<li>The sidebar animation is now slightly faster.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where the pull-down action would activate too easily.</li>\n<li>Fixed bug where &quot;Close all tabs&quot; did not always close all the tabs.</li>\n<li>Fixed issue where the menu handle would cover text if the menu is scrollable.</li>\n<li>Fixed bug where Obsidian Vault would fail to load vaults if you log in from the initial vault selection screen.</li>\n<li>Fixed issue where the active state sometimes gets stuck when tapping on an interactive element.</li>\n<li>Fixed issue where table menus didn't show their options.</li>\n<li>Fixed display of dialog headers with long titles. Titles now get truncated to fit the screen.</li>\n<li>Fixed context menus on tablets not being scrollable.</li>\n<li>Added a loading state to the &quot;Log out&quot; button.</li>\n<li>Settings buttons now show when they are active.</li>\n<li>Fixed issue where the screen would not have enough space when the keyboard is on screen and Stage Manager is active.</li>\n<li>Fixed issue where the keyboard would remain visible when a menu appears.</li>\n<li>Fixed spacing issue with the bottom toolbar when using a physical keyboard on small devices.</li>\n<li>Pressing &quot;Return&quot; when editing a setting now ends editing and hides the keyboard.</li>\n<li>Tapping on a video embed no longer brings up the keyboard.</li>\n<li>The &quot;Export as image&quot; command no longer appears in the command prompt.</li>\n<li>Fixed issue where selecting a sidebar item would not restore focus to the main view.</li>\n</ul>\n<h3>Android</h3>\n<ul>\n<li>Updated haptics to match OS conventions for light, medium, and heavy interactions.</li>\n<li>Status bar and navigation bar now match the app background color.</li>\n</ul>\n<h3>iOS</h3>\n<ul>\n<li>Improved screen resizing when the keyboard appears.</li>\n<li>Fixed issue where the video thumbnail would be blank until you press play.</li>\n</ul>\n<h3>Tablet</h3>\n<ul>\n<li>Fixed horizontal scrolling in community plugins with long descriptions.</li>\n<li>The community plugin sort button now matches the desktop version.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":7,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":8,"day":8},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Sync includes a new view that shows a collection of synchronized files. Activate it using the &quot;Sync: Show Sync history&quot; command.</li>\n<li>You can now click inside a page preview to edit in-place.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now create new footnotes by clicking on the hover preview of a footnote ID.</li>\n<li>Spellcheck is now disabled inside prompts like the quick switcher and command palette.</li>\n<li>Added support for <code>x.com</code> embeds in addition to <code>twitter.com</code>.</li>\n<li>Right-clicking in the gutter of a Markdown view now lets you quickly toggle line numbers or readable line width.</li>\n<li>The &quot;Make copy of&quot; menu item has been renamed to &quot;Duplicate&quot; on macOS to match OS conventions.</li>\n<li>Obsidian Publish collaborators can now edit content-related site options, including the order of sidebar items.</li>\n<li>The &quot;Close all other tabs&quot; command no longer closes pinned tabs.</li>\n<li>Frontmatter is now hidden inside embedded editors such as Canvas file nodes and page preview.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed choppy scrolling between linked Markdown views.</li>\n<li>Fixed issue where &quot;clear&quot; would overlap text inside prompts like the quick switcher.</li>\n<li>Fixed bug where search queries using <code>line:</code>, <code>block:</code>, and <code>task:</code> only returned matching files instead of the matching content.</li>\n<li>Pressing <code>ArrowDown</code> when the inline title is focused now properly focuses the editor if the property editor is hidden.</li>\n<li>Fixed issue where renaming a file would mangle Markdown links if the link destination was inside angle brackets.</li>\n<li>Fixed issue where moving a PDF view to a pop-out window caused errors.</li>\n<li>Fixed issue where &quot;Export to PDF&quot; created visual artifacts next to external links in right-to-left text.</li>\n<li>Fixed bug where some commands would cause the editor autocomplete to appear unexpectedly.</li>\n<li>Fixed bug where Obsidian Sync could deactivate itself when syncing to a device with &quot;Sync core plugins&quot; disabled.</li>\n<li>Fixed issue with the PDF view showing the wrong icon in the search bar.</li>\n<li>Fixed issue with inline YouTube previews not showing for some links.</li>\n<li>Context menus now display correctly in right-to-left mode.</li>\n<li>Fixed issue where links in footnotes appeared twice in the outgoing links view.</li>\n<li>Fixed bug where canvas files could become corrupted if they contained a file node with a custom property type.</li>\n<li>Long filenames no longer display an ellipsis at the end when being renamed.</li>\n<li>Fixed issue where clicking on a filename while renaming it would cancel the rename.</li>\n<li>The editor context menu no longer shows <em>Formatting</em> options when the selection is within a link or tag.</li>\n<li>Fixed issue where using the &quot;Fold all&quot; command on a long Markdown file incorrectly folded lines inside code blocks.</li>\n<li>Fixed bug where the link autocomplete sometimes generated invalid Markdown links without the <code>.md</code> file extension.</li>\n<li>Fixed an unresponsive area in the top corner of the screen when a notification was present.</li>\n<li>Fixed issue where popover scroll position reset when the popover was repositioned on the screen.</li>\n<li>Fixed issue where formatting commands were not always applied to table cell selections.</li>\n<li>Fixed bug where clicking on a tag in the Tag view would sometimes bring up the search suggestion box.</li>\n<li>Fixed bug where SVG files would not always show in page previews.</li>\n<li>Fixed issue where &quot;Log out&quot; wouldn't work if the server thought you were already logged out.</li>\n<li>Fixed issue where the PDF view's &quot;copy link to selection&quot; did not include display text if &quot;Use wikilinks&quot; was turned off.</li>\n<li>&quot;Insert Markdown link&quot; and &quot;Insert internal link&quot; commands now support multiple cursors.</li>\n<li>Fixed issue where the &quot;&gt;&quot; character after a bare link was incorrectly parsed as a quote block.</li>\n<li>Fixed bug where items were not always visible after filtering in the Outline view.</li>\n<li>Fixed issue where search highlights were not cleared when the current Outline view filter was cleared.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":7,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":7,"day":18},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.6.7.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":7,"day":18},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed app freezing when closing a pop-out window while Obsidian Sync is syncing the active file.</li>\n<li>Fixed memory leak when disabling plugins that register custom ribbon buttons.</li>\n<li>Fixed an issue where old file history was missing from the sync history view after renaming a file.</li>\n<li>Fixed collapse indicators displaying the wrong direction next to right-to-left text.</li>\n<li>Fixed overlap of indicators and bullets with right-to-left text.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":7,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":7,"day":11},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.6.7.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":7,"day":11},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed app freezing when closing a pop-out window while Obsidian Sync is syncing the active file.</li>\n<li>Fixed collapse indicators displaying the wrong direction next to right-to-left text.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":6,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":7,"day":9},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.6.6.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2024,"month":7,"day":9},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed memory leak when disabling plugins that register custom ribbon buttons.</li>\n<li>Fixed overlap of indicators and bullets with right-to-left text.</li>\n<li>Fixed an issue where old file history was missing from the sync history view after renaming a file.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":5,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2024,"month":6,"day":25},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.6.5.</li>\n<li>Removed &quot;Open in new window&quot; context menu items from bookmarks.</li>\n<li>Removed &quot;Open to the right&quot; context menu item from bookmarks on smaller devices.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2024,"month":6,"day":25},"info":"<h2>Improvements</h2>\n<ul>\n<li>The installer has been updated to use Electron v30.1.2. To upgrade, install visit the <a href=\"https://obsidian.md/download\">Obsidian download page</a> and reinstall Obsidian.</li>\n<li>Added a new advanced section at the bottom of &quot;File and links&quot; settings page. This section includes a button for manually rebuilding the metadata cache if the cache gets corrupted or out of sync with the filesystem.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed date and time input being cut off.</li>\n<li>Fixed extra border between vertical splits in the sidebar.</li>\n<li>Fixed bug where Graph view could constantly save and reload.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":6,"patch":4,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2024,"month":6,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Added mobile tap effect to buttons in the &quot;New tab&quot; view.</li>\n<li>The &quot;Toggle ribbon&quot; setting now appears inside <code>Settings → Appearance</code> for tablets.</li>\n<li>Notices are now slightly wider on phones.</li>\n<li>Hover effects now activate when moving a trackpad cursor over elements on tablet.</li>\n<li>Fixed the &quot;Go to first line&quot; command sometimes giving focus to the &quot;Add property&quot; button.</li>\n<li>Removed the &quot;Close others in tab group&quot; command on phones.</li>\n<li>Fixed tooltips sometimes briefly flashing when tapping on a tab.</li>\n<li>Fixed scrolling via an external device not working on iOS.</li>\n</ul>\n","major_release":false}]