[{"version":{"major":0,"minor":14,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":4,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Updated installer to Electron 18.0.3 which fixes several bugs that were in Electron 17.\n<ul>\n<li>Fixed performance issues with resizing the app.</li>\n<li>Fixed window border issues on Windows.</li>\n<li>Fixed developer tools performance snapshot issues.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>When selecting text and converting into a fenced code block, newline characters are now automatically added.</li>\n<li>The insert callout command will now wrap any selected text into the callout body content instead of replacing it.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Reduced lag caused by big exclusion filters with Obsidian Sync.</li>\n<li>Fixed headings in lists causing indentation guides to misalign.</li>\n<li>Fixed monospaced font not applied.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":31},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Font settings can now list all fonts installed in the system (requires installer update to v0.14.4).</li>\n<li>You can now assign multiple fonts to each font option, and the first available font will be used.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync should now no longer create duplicate files when renaming a file while it is still syncing.</li>\n<li>Obsidian Sync now has a fully customizable sync folder exclusion system. This allows you to add exclusions to folders even if they don't exist locally.</li>\n<li>Auto-completing three backticks for code blocks now adds a newline automatically to avoid suddenly parsing the rest of the note as code.</li>\n<li>Toggle bold/italics will now smartly skip over the closing markers when at the end of the block, instead of adding more marker symbols.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed on Linux the app doesn't properly watch for changes in the config folder.</li>\n<li>Fixed headings in lists not properly styled in Live Preview.</li>\n<li>Fixed duplicate event handlers for embeds, callouts, and tables blocks in Live Preview.</li>\n<li>Fixed app crashes on startup for platforms that doesn't have a configured documents folder.</li>\n<li>Fixed x-callback-url not properly taking into account existing <code>?</code> query parameters.</li>\n<li>Fixed move file dialog lags in vaults with lots of folders.</li>\n<li>Fixed <code>&lt;webview&gt;</code> unable to open pages externally in the browser.</li>\n<li>Fixed downloading or updating plugins without css causes one to appear with the contents &quot;Not found&quot;.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>CSS variables related to fonts have been renamed.\n<ul>\n<li><code>--default-font</code> is now <code>--font-default</code> (but it will fallback to <code>--default-font</code>)</li>\n<li><code>--interface-font</code> is now <code>--font-interface</code>.</li>\n<li><code>--editor-font</code> is now <code>--font-text</code> and will cover both editing and reading.</li>\n</ul>\n</li>\n<li>There is now a <code>--font-interface-theme</code> and <code>--font-text-theme</code> dedicated for themes to set the fonts.</li>\n<li>Each theme and snippet is now put into its own <code>&lt;style&gt;</code> tag to avoid issues with imports not working.</li>\n<li><code>app</code> is now officially available as a global variable.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":28},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now move, rename or locate your vaults directly from the vault switcher.</li>\n<li>There is now a new in-app help page with links to the online help docs, Discord, forum, as well as the sandbox vault.</li>\n<li>The local help vault has been replaced with a sandbox vault.</li>\n<li>You can now set the font for the interface and the editor directly under appearance settings. Note that some themes may override this font setting.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved Live Preview clicking experience for callouts and embeds.</li>\n<li>Improved <code>&lt;iframe&gt;</code> for some websites that disallows being iframed.</li>\n<li>There's now a command to open context menu for the current cursor location.</li>\n<li>Vim mode up/down now goes into rendered code blocks, embeds, callouts, or tables in Live Preview instead of skipping them.</li>\n<li>Pasting and dropping images or media files that are already located in the vault will now link to it directly instead of duplicating the file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Chinese IME on Windows causes selection issues when using punctuation characters.</li>\n<li>Fixed multi-line block math in blockquotes not working in Live Preview.</li>\n<li>Fixed clicking on checkbox in callouts not working in Live Preview.</li>\n<li>Fixed unindent always keeps one extra space when use tabs is turned off.</li>\n<li>Fixed Quick Switcher not respecting relative path for creating new files.</li>\n<li>Fixed unable to select text within embeds in Live Preview.</li>\n<li>Fixed memory leak when closing local graph view.</li>\n<li>Fixed using the editor search or replace commands doesn't auto-fill selected text when search or replace is already open.</li>\n<li>Fixed issue where the currently focused pane would lose focus when trying to focus a pane that can't be focused.</li>\n<li>Fixed Audio Recorder's webm files can't be seeked and doesn't show total time.</li>\n<li>Fixed pasting images on macOS is inconsistent between Firefox, Chrome and Safari.</li>\n<li>Fixed folding not loading properly sometimes when using horizontal rules.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Callouts now has its metadata (the part in <code>![type|metadata]</code>) put into its html as <code>data-callout-metadata</code>.</li>\n<li><code>&lt;webview&gt;</code> tags are now allowed to be used to embed external content for plugins (Electron/desktop app only).</li>\n<li>Updated DOMPurify, Turndown, Mermaid, PIXI.js, and Prism.js.</li>\n<li>Obsidian URI's <code>new</code> action now has an optional <code>append</code> flag and an optional <code>overwrite</code> flag. If <code>append</code> is set, it will append to an existing file if one is found. If <code>override</code> is set, it will overwrite an existing file if one is found, but only if <code>append</code> isn't set.</li>\n<li>Obsidian URI's <code>new</code> and <code>hook-get-address</code> actions can now optionally accept <code>x-success</code> as part of the <code>x-callback-url</code> specifications, and will return a <code>name</code>, <code>url</code>, and <code>file</code> (<code>file://</code>) as the returned URL parameters.</li>\n<li><code>Menu</code> constructor no longer requires <code>App</code> to be passed in.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":1,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":3,"day":21},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v0.13.33.</li>\n<li>Fixed large PDFs not rendering.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>Fixed keyboard always dark in light mode.</li>\n<li>Fixed sometimes the toolbar icons renders above the toolbar.</li>\n<li>Fixed clicking on links while editing not working, allow tap and hold to edit a link.</li>\n</ul>\n<h2>Android</h2>\n<ul>\n<li>Fixed status bar always dark in light mode.</li>\n<li>Fixed remote resources from http links not working.</li>\n<li>Fixed file created/modified times being negative (shows up as year 1969) when using a 32-bit processor.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":0,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2022,"month":3,"day":19},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v0.14.2.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>You can now share text, links, image, and other attachments directly to the Obsidian app.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":3,"day":17},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Starred files now support hover page preview.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed consecutive tables in Live Preview are rendered together.</li>\n<li>Fixed queries in callouts not working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":16},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Live Preview now supports basic Markdown tables previewing.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved indenting/unindenting lists in blockquotes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed embeds in collapsed callout blocks aren't rendered properly.</li>\n<li>Fixed embeds after a callout block not recognized in Live Preview.</li>\n<li>Fixed math block spanning the whole line breaks out of the callout block.</li>\n<li>Fixed callouts with a nested embed to its own file causes app to freeze.</li>\n<li>Fixed callouts looks ugly in exported PDF when app is in dark mode.</li>\n<li>Fixed folded callouts stay folded in exported PDF.</li>\n<li>Fixed callouts disappear in Live Preview sometimes if another identical callout is present later in the page.</li>\n<li>Fixed folding in Live Preview unfolds instantly if the text selection was placed in the folded block.</li>\n<li>Fixed hover page preview on Markdown links not working.</li>\n<li>Fixed copy code block button not showing in reading view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":14},"info":"<h2>Callouts</h2>\n<p>Obsidian Markdown now allows you to create callout blocks (sometimes called &quot;admonitions&quot;). Callouts are written as a blockquote, inspired by the &quot;alert&quot; syntax from Microsoft Docs.</p>\n<p>A big shoutout to <code>@javalent</code> from the community for creating and maintaining the Admonitions plugin, from whom we've gotten a ton of help and inspiration!</p>\n<p>For compatibility reasons, if you're also using the Admonitions plugin, you should update it to at least v8.0.0 to avoid problems with the new callout system.</p>\n<p>Callouts will also be supported natively on Obsidian Publish.</p>\n<p>See our documentation for more on <a href=\"https://help.obsidian.md/How+to/Use+callouts\">how to use callouts</a>.</p>\n<p>Example:</p>\n<pre><code class=\"language-markdown\">&gt; [!INFO]\n&gt; Here's a callout block.\n&gt; It supports **Markdown** and [[wikilinks]].\n</code></pre>\n<h2>Indentation guides</h2>\n<p>Indentation guides (sometimes known as relationship lines) are now available in Live Preview and Reading view.</p>\n<p>They can be turned off in editor settings.</p>\n<h2>Improvements</h2>\n<ul>\n<li>In Live Preview, fold icons will now only show up when hovering the same line as the fold indicator.</li>\n<li>In Live Preview, you can now hold <code>Ctrl/Cmd+Alt</code> when clicking on links to edit them.</li>\n<li>When right clicking links, there is now an option to open the link.</li>\n<li>When right clicking links to a file that doesn't exist yet, there is now an option to create the file.</li>\n<li>Improved <code>Enter</code> handling in blockquotes and lists.</li>\n<li>Improved Live Preview rendering when switching between different blocks of embed/rendered code.</li>\n<li>Tasks with checkmark characters other than <code>x</code> will now no longer have the strikethrough formatting applied.</li>\n<li>Improved editor spacing to better align with Reading view.</li>\n<li>When failing to save a file, Obsidian will attempt to save a copy in File Recovery.</li>\n<li>Prevent accidentally renaming files to start with <code>.</code> causing it to disappear.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed vaults on network drives don't load images properly.</li>\n<li>Fixed block IDs with uppercase letters couldn't be linked properly.</li>\n<li>Fixed scroll-sync between Live Preview and Reading view for large blocks and nested lists.</li>\n<li>Fixed cycle bullet list/checklist command not working well when the line is indented.</li>\n<li>Fixed Quick switcher sometimes opens the file in the wrong pane.</li>\n<li>Fixed navigating to headings, blocks, or search results sometimes requires two clicks to work in dual-pane mode.</li>\n<li>Fixed editor sometimes runs into an error while saving, but shows a notice about another file.</li>\n<li>Fixed Audio recorder always inserts audio link at the end of the file, rather than where the cursor is.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Plugin inline sourcemaps are now stripped for performance unless the debug startup time option is enabled.</li>\n<li>Fixed using <code>position: relative</code> on lists in reading mode causes scroll sync to be completely broken.</li>\n<li>Indentation guides in the editor are styled using the CSS class <code>cm-indent</code>, and will gain <code>cm-active-indent</code> for the indent closest to the selected line.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":33,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":3,"day":10},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed wrong release built in 0.13.32.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":32,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":9},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed typing with IME causes text duplication on Windows and Linux.</li>\n<li>Fixed lag caused by file explorer in large vaults due to a Chromium bug.</li>\n<li>Fixed Obsidian starts up with a blank window for a split second.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":31,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":3,"day":8},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Major engine upgrade from Electron 16 to 17.  This version fixes issues with emoji rendering in Electron 16.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed headings in legacy editor not properly sized.</li>\n<li>Fixed unable to open help vault.</li>\n<li>Fixed comment <code>%%</code> parsing regression in edit mode.</li>\n<li>Fixed cursor jumps back with some IMEs in Live Preview.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":30,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":3,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Major engine upgrade from Electron 13 to 16.\n<ul>\n<li>This will require downloading the latest installer from our website and installing over.</li>\n<li>Updated macOS app icon.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed pasting images from websites.</li>\n<li>Fixed search and replace commands not working when search is already open.</li>\n<li>Fixed search in reading view always override search hotkeys from another pane.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":29,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":5},"info":"<h2>Improvements</h2>\n<ul>\n<li>Slightly improved typing performance in global search.</li>\n<li><code>Ctrl</code>+dropping to link external files from Finder on macOS no longer works due to a system limitation, and has been remapped to <code>Option</code>+drop.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed sometimes hover previews show up empty.</li>\n<li>Fixed embedding indented list items sometimes render as code.</li>\n<li>Fixed pasting image files not working on macOS sometimes.</li>\n<li>Fixed embedding list items with children using different list symbols (for example <code>-</code> vs <code>*</code>) not working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":28,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":1},"info":"<h2>Improvements</h2>\n<ul>\n<li><code>Enter</code> on empty line now exits blockquotes again, and <code>Shift+Enter</code> has been improved to work as &quot;soft line wrap&quot; where it will smartly add indentation to keep you in the same list/blockquote but on the next line.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed outgoing links unlinked mention section stopped working.</li>\n<li>Fixed dollar signs in wikilinks parsed as math.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":27,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":2,"day":28},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added new &quot;Cycle bullet/checkbox&quot; command that cycles between regular bullet, checkbox, and checked checkbox.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Reduced chance of Obsidian Sync overwriting instead of merging when a rare race condition happens.</li>\n<li>Improve Obsidian Sync's handling of templated daily notes created on other devices (will require next mobile release to fully apply).</li>\n<li>Pressing <code>Enter</code> in an empty blockquote now extends the blockquote instead of exiting it. <code>Shift+Enter</code> can be used to exit the blockquote.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed embeds in Live Preview blocks have an extra padding at the bottom.</li>\n<li>Fixed using many embeds and images in Live Preview sometimes causes click position detection to misbehave.</li>\n<li>Fixed outgoing links crash when encountering a link named &quot;constructor&quot;.</li>\n<li>Fixed middle click in editor doesn't open in new pane.</li>\n<li>Fixed drag and drop in outline pane not working when pane is scrolled.</li>\n<li>Fixed LaTeX and inline code not properly sized in headings.</li>\n<li>Fixed Live Preview HTML blocks not respecting normal HTML white-spacing rules and rendering extra whitespace by default, causing newline characters to be rendered.</li>\n<li>Fixed <code>Ctrl/Cmd+G</code> stopped working in document search.</li>\n<li>Fixed various Markdown syntax toggle commands like bold and italics misbehaving when working across multiple lines.</li>\n<li>Fixed multiple possible memory leak in editor when closing panes.</li>\n<li>Fixed a bug in list block ID parsing which caused links and embeds to resolve the parent list item instead of the specific child item.</li>\n<li>Fixed sometimes the context menu appears multiple times on screen.</li>\n<li>Fixed unable to see last few characters of long tables in legacy editor.</li>\n<li>Triple clicking text will now select the whole sentence without the ending newline character.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Theme developers: you can also now use variables for heading font sizes with <code>--h1</code>, <code>--h2</code>, etc. We've also moved heading font sizes from <code>cm-header-x</code> to <code>HyperMD-header-x</code> to avoid certain elements not being properly up-sized like LaTeX and inline code.</li>\n<li>There is a new <code>deleted</code> event on <code>MetadataCache</code> now.</li>\n<li><code>DataAdapter.stat</code> now returns the OS <code>mtime</code> and <code>ctime</code> for folders.</li>\n<li>Obsidian's icon library now supports all icons from <code>lucide</code>, a currently maintained fork of <code>feather-icons</code> with 547 supported icons. No need to import <code>feather-icons</code> anymore. You can browse them at <a href=\"https://lucide.dev/\">Lucide.dev</a></li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":0,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":2,"day":22},"info":"<h2>Core update</h2>\n<p>Includes all new functionality and bug fixes up to Obsidian Desktop v0.13.24.\nThis update also allows all new cm6-compatible plugins to run.</p>\n<p><strong>Live Preview</strong>\nWhile this feature works pretty well already, it hasn't been fully mobile optimized, so there could still be some usability issues when using with a touch-only device, such as editing embeds and code blocks.\nIn the meantime, feel free to use Source Mode when that happens. You can do that by long-holding the 3 dot button on the top right and hitting &quot;Toggle Live Preview/Source mode&quot; (or run a command from the pull down menu or bottom toolbar).</p>\n<p><strong>Vim mode</strong>\nSupport for vim mode is now available, but must be enabled on a per-device basis on mobile. It is not really usable on a mobile device without an external keyboard.</p>\n<p><strong>Others</strong>\nDrag and drop features from desktop is now generally available across the app, and can be triggered by long-holding items. This includes drag and drop files and folders, starred items, and outline items.</p>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":26,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":2,"day":18},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed several themes broken due to the new <code>&lt;img&gt;</code> placeholders.</li>\n<li>Fixed reading view images without width/height gaining a null width/height attribute when the paragraph is edited.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":25,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":2,"day":18},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Clicking on links in Live Preview will now open them directly.\n<ul>\n<li>Previously <code>Ctrl/Cmd+Click</code> to open link is now simply a click.</li>\n<li>Previously <code>Ctrl/Cmd+Shift+Click</code> to open link in new pane is now <code>Ctrl/Cmd+Click</code>, just like everywhere else in the app.</li>\n</ul>\n</li>\n<li>Embedding list items will now show any sub list items when rendering.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Embeds to files that don't yet exist will automatically load the file once it's created. This avoids issues with images that syncs in after opening the note it was embedded in.</li>\n<li>Word count now properly counts apostrophes.</li>\n<li>Renamed &quot;Swap line up/down&quot; commands to &quot;Move line up/down&quot;.</li>\n<li>Obsidian Publish now has an option to hide page title headings.</li>\n<li>Added persistent notice to the help vault to remind users not to save data in it, since the help vault can be reset.</li>\n<li>Added additional confirmation for opening <code>file:///</code> links.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed several issues with IME in the new editor.</li>\n<li>Fixed code blocks tagged with <code>markdown</code> as the language causes Live Preview to misbehave.</li>\n<li>Fixed mermaid state diagrams not properly sized.</li>\n<li>Fixed command palette performance issue.</li>\n<li>Fixed export to PDF doesn't expand embedded notes and instead show a scrollbar.</li>\n<li>Fixed local <code>file:///</code> links stopped working.</li>\n<li>Fixed macOS caret character misbehaving when used as a deadkey in some keyboard layouts.</li>\n<li>Fixed hitting <code>Shift+End</code> twice not going to the end of the paragraph.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Theme developers: our new editor has received an upgrade where previous <code>&amp;ZeroWidthSpace;</code> characters, used as placeholders for computing cursor positions, have been switched to 0-width <code>&lt;img&gt;</code> elements. We recommend double-checking that your theme does not contain global <code>img { ... }</code> CSS rules to avoid breaking the editor.</li>\n<li><code>TFile.unsafeCachedData</code> has been removed and is now stored in a private inaccessible <code>WeakMap</code> to avoid accidental use of this unsafe data.</li>\n<li>There is now a new <code>requestUrl</code> API function that returns an object with the http response <code>status</code>, <code>headers</code>, as well as getters for <code>arrayBuffer</code>, <code>json</code>, and <code>text</code>. This is a more advanced version of the <code>request</code> API. (Requires API version 0.13.25)</li>\n<li>The <code>request</code> and the new <code>requestUrl</code> functions can now accept a body of type ArrayBuffer.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":24,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":2,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Reduced the chances of Obsidian Sync duplicating the contents of a note when it encounters a conflicting new note which is modified both locally and remotely. It will now keep the latest version when this happens. (This patch is only fully effective when all of your devices are upgraded to this version)</li>\n<li>Slightly improved editor performance.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed editing large documents causes embeds to be broken.</li>\n<li>Fixed indented code blocks adds large gap sometimes.</li>\n<li>Fixed heading fold broken when multiple space characters are used after <code>#</code>.</li>\n<li>Fixed plugins unable to load when using esbuild's new esmodule format.</li>\n<li>Fixed toggling checklists only adds list bullet when no lists exist.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":23,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":1,"day":27},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed external URLs with <code>%</code> encodings stopped working but wasn't fully fixed last release.</li>\n<li>Fixed renaming files with <code>$</code> signs sometimes causes links to be generated incorrectly.</li>\n<li>Fixed link suggestion crashes when using Markdown links.</li>\n<li>Fixed link suggestion showing &quot;no results found&quot; when only one exact match found.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":22,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":1,"day":24},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed external URLs with <code>%</code> encodings stopped working.</li>\n<li>Fixed external URLs in embed blocks not working in Live Preview.</li>\n<li>Fixed line numbers misaligned with embed blocks in Live Preview.</li>\n<li>Fixed list bullets misaligned vertically in Live Preview.</li>\n<li>Fixed a case of Live Preview lag when large base64-encoded images are inserted.</li>\n<li>Fixed sometimes a zero width space character is inserted when replacing some text around fold indicators. They showed up as a red dot.</li>\n<li>Fixed sometimes choosing a link suggestion to a block without an ID in the same document causes the cursor to be misplaced.</li>\n<li>Fixed up/down keys misbehaving in Live Preview's word-wrapped lines when the previous/next real line is a hidden block.</li>\n<li>Updating plugins no longer scrolls the plugin list back to the top.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added an option in community plugin pane to help debug slow plugin startup times.</li>\n<li>Fixed <code>editorLivePreviewField</code> not dynamically updated when Live preview is turned on/off.</li>\n<li>Added <code>data-type</code> to tab header elements.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":21,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":1,"day":17},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed legacy editor crashes when using frontmatter.</li>\n<li>Fixed <code>Ctrl/Cmd+G</code> hotkey doesn't work in reading mode.</li>\n<li>Fixed <code>Ctrl/Cmd+G</code> does not override open graph view command.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Introduced <code>apiVersion: string</code> and <code>requireApiVersion(version: string): boolean</code> to help with API version requirements. Plugin authors can use this function to limit functionality that depends on new Obsidian APIs to avoid crashing on older versions of Obsidian.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":20,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":1,"day":17},"info":"<h2>Improvements</h2>\n<ul>\n<li>The new editor now supports the <code>cssclass</code> frontmatter property.</li>\n<li>Live Preview will now detect whether the editor is focused to apply syntax hiding.</li>\n<li>Community plugin search filter will now also match by author.</li>\n<li>Added shortcuts for plugin settings and hotkeys in the community plugins list.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed clicking on checklists and fold indicators causes the cursor/selection to be affected.</li>\n<li>Fixed resizing panes causes buggy selection rendering until selection is changed.</li>\n<li>Fixed fold indicator spacing sometimes misalign due to fonts applied by themes.</li>\n<li>Fixed gutter line numbers not showing for embeds and custom code blocks.</li>\n<li>Fixed memory leak when closing Markdown panes.</li>\n<li>Fixed vim mode undo/redo combines multiple edits.</li>\n<li>Fixed up/down arrow keys don't navigate properly around list bullets.</li>\n<li>Fixed up/down arrow keys don't navigate properly when at the end of a word-wrapped line.</li>\n<li>Fixed unindenting numbered lists sometimes generates &quot;undefined&quot;.</li>\n<li>Fixed auto number lists generates individual undo/redo entries for each line.</li>\n<li>Fixed toggle numbered lists always generate <code>1</code> as the number.</li>\n<li>Fixed typing inline code causes the rest of the document to become code.</li>\n<li>Fixed underline not applied to external links when in lists, headings, or blockquotes.</li>\n<li>Fixed two identical embed in the same file causes Live Preview to misbehave.</li>\n<li>Fixed linking to a block without a block id from an earlier position in the same note causes the link to be badly formatted.</li>\n<li>Fixed in-editor search removes highlight when only a single match is found.</li>\n<li>Added <code>Ctrl/Cmd+G</code> (and <code>Ctrl/Cmd+Shift+G</code>) for selecting next/previous search occurrence when using in-editor search.</li>\n<li>Fixed opening some <code>file:///</code> paths on Linux causes Obsidian to freeze until the new process exits.</li>\n<li>Fixed Markdown importer unable to convert tags with some character sets like CJK characters.</li>\n<li>Fixed undo close pane still opens a new pane even when the current pane is empty.</li>\n<li>Fixed copy external URL menu action doesn't properly encode special characters.</li>\n<li>Fixed linking an unlinked mention loses its original casing.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fixed sometimes empty duplicate <code>&lt;span&gt;</code> elements show up before or after widgets, causing issues when using css <code>padding</code> or <code>:before/:after</code>.</li>\n<li>The debug info command now includes the OS information.</li>\n<li>There is now a new <code>editorLivePreviewField: StateField&lt;boolean&gt;</code> that can be used to check whether Live Preview is enabled in the editor.</li>\n<li>Fixed out-of-bound <code>{line,ch}</code> pairs causes error with new editor.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":19,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":1,"day":5},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed automatic numbering of lists doesn't stop at the end of the list and accidentally changes the numbers of lists further down the document.</li>\n<li>Fixed sometimes undo/redo combines multiple consecutive operations like typing and pasting into a single change.</li>\n<li>Fixed when redoing a change, the cursor would be put in the wrong spot afterwards.</li>\n<li>Fixed sometimes bad HTML causes Live Preview to crash with an error.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":1,"day":2},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved fold indicators in new editor. They will now appear closer to the line's text rather than all the way at the left edge.</li>\n<li>New hotkeys for in document search: &quot;Search All&quot; (<code>Alt+Enter</code>) and &quot;Replace All&quot; (<code>Ctrl/Cmd+Alt+Enter</code>).</li>\n<li>In Live Preview, you can now click a code block's language flair (top right) to copy the code block.</li>\n<li>New editor's vim mode now experimentally supports search highlighting and multiple cursors.</li>\n<li>You can now use <code>Ctrl/Cmd+Shift+Enter</code> in quick switcher to create a new note and open it in a new pane.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed the fold all command sometimes not working.</li>\n<li>Fixed <code>Shift+Up/Down</code> in Live Preview doesn't select hidden blocks properly.</li>\n<li>Fixed backlink and unlinked reference count indicator not properly updated when a link is removed.</li>\n<li>Fixed middle click and <code>Ctrl/Cmd+Click</code> embedded note's &quot;open link&quot; button in Live Preview causes weird behavior.</li>\n<li>Fixed middle click links, file explorer items, and search results stopped working.</li>\n<li>Fixed unable to click external links with formatting styles like bold or italics in editing view.</li>\n<li>Fixed sometimes the bullet dot renders as weird letters.</li>\n<li>Fixed console error when OS language doesn't support spellchecker.</li>\n<li>Word count now properly count contractions as one word.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added <code>.cm-active</code> to gutter elements as well.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":17,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":29},"info":"<h2>Improvements</h2>\n<ul>\n<li>Improved list bullet rendering to avoid jumping in Live Preview.</li>\n<li>Improved behavior when pressing <code>Enter</code> in lists and blockquotes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed new editor's spellchecker dictionary options not working.</li>\n<li>Fixed two consecutive footnote references causes any text in between to be underlined.</li>\n<li>Fixed unable to type <code>&lt;</code> and <code>&gt;</code> in Hungarian keyboard layout on mac.</li>\n<li>Removed emacsy toggle for mac in new editor.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Heads up to theme developers: the <code>.list-bullet</code> CSS has been reworked. It will now keep the original character and superimpose the dot using the <code>:after</code> pseudo-element.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":24},"info":"<h2>Improvements</h2>\n<ul>\n<li>Switching between files will now keep the undo/redo history for the last 20 files, unless the file was changed externally. Not available for the legacy editor.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed readable line length not properly applied when line wrapping is turned on.</li>\n<li>Search will now properly unfold folded areas when highlighting the match.</li>\n<li>Fixed wikilinks at the beginning of the line causes it to inherit styles from the previous line.</li>\n<li>Fixed a rare case of data loss due to race condition caused by clicking on a link and triggering the loading of the additional syntax highlighting library.</li>\n<li>Fixed gutter alignment for empty lines above headings.</li>\n<li>Fixed mermaid diagrams overflowing.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":15,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":23},"info":"<h2>Improvements</h2>\n<ul>\n<li>Edit mode now supports headings in lists.</li>\n<li>Embedded content generated by plugin custom handlers (like image in Admonitions and Dataview) are now rendered in both Live Preview and Reading view. This will be a temporary addition until we can come up with a proper Markdown rendering API that handles nestable rendering contexts better.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li><code>Ctrl/Cmd+C</code> now copies the whole line again if there is no selection.</li>\n<li>Fixed several parsing issues with formatting symbols in wikilinks.</li>\n<li>Fixed an issue where the <code>Tab Size</code> setting could change how indented lists are interpreted in edit view. This will now always recognize a tab character as 4 spaces, as required by Markdown's specifications.</li>\n<li>Fixed a crash when pressing up (or using <code>k</code> in vim mode) on a <code>---</code> separator that's out of screen.</li>\n<li>Fixed a crash that happens sometimes when pressing page up or page down (or the equivalent commands in vim mode).</li>\n<li>Fixed some plugins could cause line wrapping to fail and grow the width of the editor.</li>\n<li>Code blocks will now line wrap in reading view, to stay consistent with editing view.</li>\n<li>Fixed code block's language flair stopped showing up when indented in Live Preview.</li>\n<li>Fixed math blocks inside blockquotes and lists are rendered outside.</li>\n<li>Improved parsing of footnote references and definitions.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>getSectionInfo()</code> is now implemented for custom code blocks in Live Preview.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":14,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":12,"day":21},"info":"<h2>Improvements</h2>\n<ul>\n<li>When changing default edit mode between Live Preview and Source mode, the new setting will now be automatically applied to all panes.</li>\n<li>Fixed default edit mode, which will now use Live Preview when not using Legacy editor.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed Live Preview sometimes unable to drop at the end of the document.</li>\n<li>Fixed reading view clips out the first line of the document when in document search is active.</li>\n<li>Drag and drop external files from the file system now preserves file extension in the display text if creating an external link.</li>\n<li>Fixed some plugins CSS causes Live Preview's selections to break.</li>\n<li>Fixed when using in document search or clicking on a global search result, the search highlight is sometimes hidden due to Live Preview.</li>\n<li>Fixed using in document search and replace does not highlight the next match when replacing.</li>\n<li>Fixed sometimes selecting multi-line text results in a weirdly rendered selection box.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":17},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed line wrapping not working with panes smaller than 700px.</li>\n<li>Fixed unresolved links in Live Preview not taking into account link aliases.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":17},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a new Core plugin called &quot;Editor status&quot; which adds a status bar item showing you the current editor mode. You can also use it to toggle the editor mode.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Internal links to non-existent files will now look dimmer than regular links.</li>\n<li>Fixed drop cursor is invisible in dark mode, also fixed drop cursor doesn't position correctly when document is scrolled.</li>\n<li>Fixed IME on MacOS sometimes causes duplicate characters to be entered.</li>\n<li>Fixed vim mode <code>g</code>  related keys causes vim mode to crash until app is restarted.</li>\n<li>Middle click now opens internal links in new panes.</li>\n<li>Removed very faint background colors on external links.</li>\n<li>Fixed pressing <code>Enter</code> on an indented line does not keep the indent properly.</li>\n<li>Fixed long tables broken again due to an engine upgrade.</li>\n<li>Fixed tables has a weird extra spacing after the last <code>|</code> character.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Word count will now no longer re-calculate on every change, but instead re-compute at most twice every second, to spare some CPU time.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The <code>changed</code> event on MetadataCache now contains the file contents as well as the parsed metadata object.</li>\n<li>There is now two helper functions for <code>HTMLElement</code>: <code>isShown()</code> which tells you whether this element is shown, and <code>onNodeInserted</code> which can add a callback for when the element is shown. These statuses depend on the element to be attached to the DOM and require not having any parent or ancestor with the css <code>display: none</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added basic RTL (right-to-left) text support. The option can be found in Settings &gt; Editor.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Fixed pasting from websites causes duplicate text to be inserted.</li>\n<li>Fixed sometimes the list bullet, or the checkbox shows up duplicated when selecting text.</li>\n<li>Improved the onboarding modal for selecting whether to use legacy editor or live preview.</li>\n<li>Relaunching after changing the legacy editor option now properly saves the option value, without having to wait for one second.</li>\n<li>When switching out of legacy editor, all edit panes will automatically use the default edit mode, rather than always staying in source mode.</li>\n<li>Fixed some actions like indenting and unindenting sometimes moves the cursor to unintended spots.</li>\n<li>Fixed an issue where selections look really bad if the first line of the document has a list.</li>\n<li>Internal links that start with <code>#</code> for heading sections will now hide the <code>#</code> when not selected to avoid confusion with tags.</li>\n<li>Fixed vim mode scrolling commands like <code>zz</code>, <code>zt</code> and <code>zb</code>.</li>\n<li>Fixed blocks like embeds and custom code blocks aren't properly included in the fold if they're at the end of the fold section.</li>\n<li>Fixed re-focusing on the editor sometimes causes the selection to jump to the beginning of the file.</li>\n<li>Improved inline footnotes parsing.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed tooltips wrap text in awkward spots.</li>\n<li>Fixed outgoing links unlinked mentions cuts off items that has a dot in the file name.</li>\n<li>Fixed changing image alt text does not update in reading view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":13},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Restored legacy editor to be default for now.</li>\n<li>Fixed gutter elements (line numbers and fold indicators) misalignment.</li>\n<li>Fixed Live Preview sometimes run into situations where it stops being parsed and highlighted halfway down the document.</li>\n<li>Fixed drag and drop text duplicates instead of moves selected text.</li>\n<li>Fixed several operations such as pasting, undo/redo, drag and drop, etc, causes duplicate characters or phrases to linger in the document.</li>\n<li>Fixed <code>Ctrl/Cmd+Shift+Z</code> stopped working for undo.</li>\n<li>Fixed full line embeds has an extra line after it.</li>\n<li>Improved external images rendering when on its own line.</li>\n<li>Empty headings will now keep the <code>#</code> characters in view to help see that it's an empty heading.</li>\n<li>Inline LaTeX will no longer be accidentally recognized when the ending sign is followed by a digit like <code>$10</code>.</li>\n<li>Fixed several commands that sometimes mis-position the selection after the command executes.</li>\n<li>Spellchecking is now properly applied to wiki links.</li>\n<li>Fixed some themes and plugins accidentally introduces margins, causing editor selections to misbehave.</li>\n<li>Fixed vim mode jumps by two lines sometimes.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Reverted editing/reading icon state. We will try to improve this in a future version.</li>\n<li>Improved Markdown formatting commands like bold and italics detection when selecting the outside layer.</li>\n<li>Markdown formatting commands now ignores whitespace characters at the beginning or ending of the selection when being applied.</li>\n<li>Backlink in document can now be turned on by default in the settings page of the core plugin &quot;Backlinks&quot;.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Sync now has a bulk restore functionality for deleted files.</li>\n<li>&quot;Preview mode&quot; has been renamed to &quot;Reading view&quot; to avoid confusion.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Live Preview is now enabled by default. To switch to the old CodeMirror 5 based editor, toggle the &quot;Legacy Editor&quot; option.</li>\n<li>You can now set the default editing mode to Live Preview or Source Mode.</li>\n<li>Vim mode is now available for both Live Preview and Source mode.</li>\n<li>Completed task lists are now crossed out and greyed out to match reading view.</li>\n<li>Improved handling of up/down arrow keys interacting with blocks like embeds and code blocks.</li>\n<li>Improved selection when clicking on previewed blocks.</li>\n<li>Improved selection when selecting across hidden Markdown formatting syntax.</li>\n<li>Fixed drag and drop does not show caret where the drop will occur, and also sometimes inserts garbage content when dragging within the editor.</li>\n<li>Improved detection of inline HTML blocks.</li>\n<li>Improved blockquote handling.</li>\n<li>Fixed deleting auto-matched brackets like  <code>[</code> with backspace not deleting the closing counterpart <code>]</code>.</li>\n<li>Fixed HTML comments could cause a crash in the editor parser.</li>\n<li>Fixed clicking or selecting the end of the file selects to the beginning when there is a block at the end.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed code block has an extra indent on the first line in reading view.</li>\n<li>Quick Switcher will now create new files relative to the file of the current active pane when new file option is set to be relative to current file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Breaking change: the <code>data-task</code> css class has been moved to the line element, rather than being on each piece of <code>&lt;span&gt;</code>.</li>\n<li>The API for CodeMirror 6 has now been opened up. To deeply integrate with CodeMirror 6, you will be required to write an <code>Extension</code> to augment the editor. More details and tutorials will be available later.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":12,"day":3},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Spell checker languages can now be changed on Windows and Linux. On MacOS, the system native spell checker is used, which automatically detects the language.</li>\n<li>Spell checker will now skip over things that shouldn't be spell checked, such as code blocks, links, and math blocks.</li>\n<li>Improved code block syntax highlighting colors.</li>\n<li>Fixed fold all command not folding inner folds.</li>\n<li>Fixed heading folds does not load sometimes, causing the fold state to be lost.</li>\n<li>Fixed frontmatter not foldable.</li>\n<li>Fixed image links with titles. Fixed links surrounded by <code>&lt;&gt;</code> not linking properly.</li>\n<li>Improved bottom padding handling when backlink in document is enabled.</li>\n<li>Fixed editor suggestions continue to show up after switching documents.</li>\n<li>Fixed indent soft-wrapping mis-calculating tab sizes.</li>\n<li>Fixed bare links with <code>&lt;&gt;</code> disappears.</li>\n<li>Fixed rendered code blocks could overflow the editor.</li>\n<li>Fixed characters past the line wrapping threshold not selectable using the mouse, happens with long tables, or with line wrapping disabled.</li>\n<li>Internal links rendered by plugins are now handled within rendered code blocks.</li>\n<li>Improved handling of list bullet when the cursor is at the beginning of the line.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Global search panes will no longer continuously run in the background when the pane is not in view.</li>\n<li>Fixed overflowing tooltips.</li>\n<li>Fixed drag and drop internal links on Windows looks weird.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":25},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Inline LaTeX is now supported and rendered.</li>\n<li>HTML blocks, including iframes are now rendered.</li>\n<li>Added <code>data-task</code> for all tokens on a list item with checkbox to facilitate css styling.</li>\n<li>Improved gutter alignment for fold icon and line numbers.</li>\n<li>Added code syntax highlighting for source mode and live preview (including legacy editor).</li>\n<li>Improved code block styling when cursor isn't active.</li>\n<li>Implemented <code>Ctrl/Cmd+Click</code> on Markdown links.</li>\n<li>Fixed Markdown links with &quot;title&quot; not working correctly.</li>\n<li>Removed hard-coded <code>Ctrl/Cmd+G</code> search hotkey.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Fixed legacy editor not properly scrolled to the top when switching document.</li>\n<li>Improved handling of custom panes when plugins are no longer installed.</li>\n<li>There is now a &quot;Copy share link&quot; in the community plugin's information page.</li>\n<li>Leftover panes from disabled plugins will no longer be automatically closed. They will now show up as an un-recognized pane, and if the plugin is re-enabled, they will work again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":22},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now use drag and drop to re-arrange heading sections from the Outline pane.</li>\n<li>You can also drop an outline item into the editor to generate a heading link.</li>\n</ul>\n<h2>Live preview improvements</h2>\n<ul>\n<li>Folding state is now properly saved.</li>\n<li>Fixed embed, image, or code blocks related page reflows making selection and interactions stop working.</li>\n<li>Fixed sometimes the page becomes plaintext with no highlights halfway.</li>\n<li>Fixed switching document does not scroll back to the top.</li>\n<li>Fixed document keeps scrolling up when selecting the last few lines.</li>\n<li>Fixed clicking on search results from global search, backlinks and outline pane not properly highlighting the matching location.</li>\n<li>Removed hardcoded editor folding hotkeys.</li>\n<li>Fixed unable to extract heading on macOS due to context menu also selecting word.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed clicking on an external link freezes the app for engine versions using Electron 12.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":19},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Fixed mouse drag selection jumpiness.</li>\n<li>Improved IME handling.</li>\n<li>Fixed link aliases broken.</li>\n<li>Fixed rendered images still showing link.</li>\n<li>Fixed dynamically resized blocks such as <code>query</code> causes selection to stop working after they resize.</li>\n<li>Fixed indentation width not updating when swapping CSS themes.</li>\n<li>Fixed block quotes always have background and border in source mode.</li>\n<li>Fixed external <code>file:///</code> images not working.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Plugin and theme download counts now have thousands separators.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":19},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Backlink in document is now available for Live preview, which can be toggled in the pane menu.</li>\n<li>Mermaid and query blocks are now rendered.</li>\n<li>Some custom code blocks from plugins are now rendered.</li>\n<li>Implemented auto-pairing of brackets for Markdown formatting symbols such as <code>$</code>, <code>=</code>, <code>~</code> and <code>%</code>.</li>\n<li>Improved handling of block quotes.</li>\n<li>Improved image size handling.</li>\n<li>Improved Markdown link styling.</li>\n<li>Fixed image alt text not live updated.</li>\n<li>Fixed empty lines in code blocks.</li>\n<li>Fixed <code>Option+ArrowUp/Down</code> keys on MacOS not performing native cursor functions.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Added <code>show-plugin</code> Obsidian URI action. Example: <code>obsidian://show-plugin?id=admonition</code></li>\n<li>Added notice for indexing large files taking too long to help debug indexing stuck issues.</li>\n<li>Obsidian now live-reloads the app and appearance options when the configuration files are changed on disk, to avoid issues with sync solutions overwriting each other with older versions.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed some syntax not highlighting for code blocks in preview mode while in dark mode.</li>\n<li>Preview should now render reference style Markdown links and images correctly.</li>\n<li>Obsidian Sync should no longer sync dot files and dot folders within plugin folders when community plugin sync is turned on.</li>\n<li>Fixed legacy editor's replace all function.</li>\n<li>Fixed adapter rename fail to work for dot files.</li>\n<li>Fixed copy from preview mode sometimes doesn't copy all the text.</li>\n<li>Fixed toggle strikethrough always adds more <code>~~</code> instead of removing.</li>\n<li>Pressing <code>Enter</code> when in an empty nested block quote will now only exit one level of block quote.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":11,"day":12},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Added <code>list-bullet</code> css class for theme styling.</li>\n<li>Fixed multiple cursors were added with <code>Ctrl/Cmd+Click</code> rather than <code>Alt+Click</code>.</li>\n<li>Fixed mermaid not rendering properly in preview.</li>\n<li>Improved block LaTeX rendering, fixed consecutive blocks not rendering.</li>\n<li>Fixed last line of document can't be selected when LaTeX blocks are in the document.</li>\n<li>External link icon should no longer be shown for embedded images.</li>\n<li>Fixed having a URL in image alt text breaks parsing.</li>\n<li>Fixed barelinks in footnotes disappears.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":11},"info":"<h2>Live preview improvements</h2>\n<ul>\n<li>Separators (<code>---</code>) are now implemented.</li>\n<li>Headings will now always show the <code>#</code> characters when the cursor is on that line.</li>\n<li>Fixed wikilink embeds not working with aliases or sizes using the <code>|</code> character.</li>\n<li>Fixed embedded documents not live updated.</li>\n<li>Implemented embeds using Markdown embed syntax.</li>\n<li>Improved visuals of list items by replacing list bullet character with a dot.</li>\n<li>Checklists now have their list bullet hidden.</li>\n<li>Fixed two wikilinks with alias on the same line causes the first one to disappear.</li>\n<li>Fixed empty wikilinks disappears.</li>\n<li>Added external link icon.</li>\n<li>Checkbox now has a <code>data-task</code> attribute added.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The insider build toggle in Settings &gt; About is now back.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":13,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":11,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Live Preview (also known as &quot;WYSIWYG&quot; mode) is now available for insider testing.\n<ul>\n<li>To enable it, go to <code>Settings &gt; Editor &gt; Experimental Live Preview</code>. Changing this option requires a restart to take effect.</li>\n<li><strong>The live preview mode is highly experimental and many bugs are expected. Please report bugs in the Discord server under the <code>insider-desktop</code> channel.</strong></li>\n<li>Once you turn on this option, there is a command to toggle source mode as well as a pane menu option.</li>\n<li>Current features\n<ul>\n<li>Hide Markdown formatting syntax.</li>\n<li>Embedded notes, images, audio, video, PDFs and notes using the wikilink syntax will show a preview in the editor.</li>\n<li>Embedded images using the Markdown syntax from external sources will show previewed.</li>\n<li>Block (<code>$$</code>) LaTeX will show a preview. Inline LaTeX will be implemented in a future release.</li>\n<li>Checklists will be replaced with a checkbox. Clicking on it will toggle the check status.</li>\n</ul>\n</li>\n<li><strong>Not implemented yet and coming soon</strong>\n<ul>\n<li>Embeds using Markdown link syntax.</li>\n<li>Inline LaTeX.</li>\n<li>HTML blocks.</li>\n<li>Custom code blocks (including plugin rendered blocks like Admonition and Dataview).</li>\n<li>Improved list bullets (and hide bullet with checklists).</li>\n<li>Tables.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Added <code>webp</code> image support.</li>\n<li>Obsidian Sync\n<ul>\n<li>The remote vault selection dialog has been reworked to prevent accidentally connecting to a different remote vault, causing unintentional vault merges.</li>\n<li>A warning has also been added to confirm the merging of local and remote vaults when the local vault already contains files.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Copy code block button now also shows up on code blocks without a language.</li>\n<li>Fixed tabs becoming spaces within code blocks in preview mode.</li>\n<li>Fixed tab size not respected in preview mode.</li>\n<li>Fixed right clicking on search result matches not working.</li>\n<li>Fixed backlink in preview mode not updated when switching to an empty note.</li>\n<li>Fixed embeds in exported PDF documents not showing page title.</li>\n<li>Fixed code blocks in exported PDF documents sometimes contain duplicate characters when copied to clipboard when using Obsidian's dark mode.</li>\n<li>Fixed code blocks in exported PDF not wrapping.</li>\n<li>Fixed app zoom hotkeys stops working after opening a PDF document.</li>\n<li>Changing font size will no longer cause the cursor in the editor to behave erratically.</li>\n<li>Fixed navigating to headings, block IDs, and search results sometimes not scrolling down properly.</li>\n<li>Fixed navigating in local graph sometimes causes the navigation history to skip over a file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now an <code>append</code> function for both the <code>Vault</code> and the <code>Adapter</code> APIs.</li>\n<li>There is now a function to sanitize HTML called <code>sanitizeHTMLToDom</code> which returns a <code>DocumentFragment</code> of the sanitized HTML content.</li>\n<li>You can now <code>setInstructions</code> for an <code>EditorSuggest</code>.</li>\n<li>There is now a <code>wordAt</code> function on the <code>Editor</code> interface.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":5,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2021,"month":11,"day":8},"info":"<h2>Core update</h2>\n<p>Includes all new functionality and bug fixes up to Obsidian Desktop v0.12.19</p>\n<ul>\n<li>Improved graph view animations.</li>\n<li>Heading rename.</li>\n<li>New theme store.</li>\n<li>Slash commands.</li>\n<li>New plugin APIs now available for the latest plugins to use.</li>\n<li>Tons of bug fixes.</li>\n</ul>\n<p><strong>Editor</strong></p>\n<ul>\n<li>There are now new commands for copying, pasting, and opening the context menu, which can be assigned to the toolbar or the pull down menu for convenience.</li>\n<li>Upgraded CodeMirror 6 which should come with many bug fixes and performance improvements.</li>\n<li>Copy and paste is now handled just like the desktop app.</li>\n</ul>\n<p><strong>Obsidian Sync</strong></p>\n<ul>\n<li>Fixed version history page not showing size and device info.</li>\n<li>Restoring files using version history will no longer error out with &quot;This version is already the latest version&quot;.</li>\n</ul>\n<h2>Android</h2>\n<ul>\n<li><strong>If you're using Android 11+, you will be prompted for the new file access permission.</strong> This is unfortunately required by the latest Play Store policy.</li>\n<li>Android vaults should no longer show duplicates if you've selected a vault in <code>Documents/Obsidian</code>.</li>\n<li>Renaming a vault on Android should no longer cause it to disappear from the list.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>The iOS app will now wait for iCloud to sync back configuration files before opening the vault to prevent load failures. This fixes the &quot;plugin failed to load&quot; popups that happens sometimes.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":19,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":10,"day":15},"info":"<h2>Improvements</h2>\n<ul>\n<li>Rename heading now has a command in addition to the previous context menu action.</li>\n<li>Improved theme statistic handling.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed editor suggestions for links and tags sometimes not working due to a race condition.</li>\n<li>Fixed current theme delete button sometimes shows in the next line.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":10,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed link suggestions sometimes disappears with large vault.</li>\n<li>Fixed heading rename doesn't work if there was no link to the heading.</li>\n<li>Fixed empty sidebar does not save collapsed state properly.</li>\n<li>Fixed theme manager sometimes showing no theme installed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":17,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":10,"day":6},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The theme store has received a massive upgrade! The interface has been completely revamped, now with download counts, sorting options, and a button to update each theme.</li>\n<li>There is now a new core plugin called &quot;Slash commands&quot;. Activating it will allow you to type <code>/</code> while editing to trigger any command.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Updated CodeMirror 5 with several bug fixes.</li>\n<li>Updated Mermaid.js with several bug fixes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Removed hardcoded navigation shortcuts <code>Alt+Left/Right</code>.</li>\n<li>Fixed large pages with multiple queries causes some queries to stop working.</li>\n<li>Fixed some search operators when used in combination causes wrong results.</li>\n<li>Fixed rare case of workspace leaving an empty space in the sidebar that can't be closed.</li>\n<li>Fixed sync's setting history modal has the incorrect title of &quot;deleted files&quot;.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Command palette now renders the plugin name and command name in separate elements to facilitate CSS styling.</li>\n<li>Plugins that crash after <code>onLayoutReady</code> will now show a message to help debug.</li>\n<li>New <code>EditorSuggest</code> is now accessible to the API to provide in-line suggestions, like auto-complete. This is what powers the link auto-complete, tag auto-complete, and slash commands.</li>\n<li><code>Keymap</code> has now been exposed with <code>isModEvent</code> to help check if the user is holding <code>Ctrl/Cmd</code> or pressing the middle mouse button. This is used as a convention to &quot;open in new pane&quot;.</li>\n<li>There are now 3 new workspace events:\n<ul>\n<li><code>editor-change</code> fired when an editor has received changes. This event happens fairly frequently so please be mindful of performance when using it.</li>\n<li><code>editor-paste</code> fired before the editor handles a paste event. If you handle the paste event, you should call <code>evt.preventDefault()</code> to let the next handler know that it's been handled.</li>\n<li><code>editor-drop</code> fired before the editor receives a drop event. Works the same was as the paste event.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":9,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added a command to undo closed panes. Default hotkey is <code>Ctrl/Cmd+Shift+T</code>.</li>\n<li>Added copy code block button in preview mode.</li>\n<li>There is now a tooltip when hovering links that has a different display text (or alias).</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Empty panes will be removed on startup if the plugin that created it has been uninstalled or disabled.</li>\n<li><code>{{date}}</code> and <code>{{time}}</code> will now work in daily notes and zettelkasten prefixer. Previously you needed to add the format <code>{{date:format}}</code></li>\n<li>Creating new files from in note composer will now show an error if it contains illegal characters.</li>\n<li>You can now use <code>Ctrl/Cmd</code>+click or middle-click the icon or the command palette item to open daily note/new zettelkasten in a new pane.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed clicking on external links in hover previews not working.</li>\n<li>Fixed creating new files/renaming files not registered in recent files.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now access to the following bundled libraries: PDF.js, Mermaid, Prism, MathJax. Each library does things a bit differently but we now expose functions to load them if they weren't loaded already: <code>loadPdfJs</code>, <code>loadMermaid</code>, <code>loadPrism</code>, <code>loadMathJax</code>.</li>\n<li><code>request</code> can now set HTTP headers.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":8,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now select text and right click to search for it globally.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed rename heading not working when using links from the same document.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":8,"day":23},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added rename heading utility in editor context menu, which will rename the heading and update links.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Note composer's &quot;extract heading&quot; function now has a command and can be assigned to a hotkey.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Removed timelapse button from local graph.</li>\n<li>Fixed Enter key for CJK input methods in several places when confirming a selection.</li>\n<li>Note composer will no longer accidentally create files with leading or trailing empty spaces.</li>\n<li>Fixed Obsidian Publish upload interface unable to check and uncheck folders when collapsed.</li>\n<li>Fixed can't check for updates when auto-update is turned off.</li>\n<li>Fixed undo pasting also undoes the previous characters typed.</li>\n</ul>\n","major_release":false}]