[{"version":{"major":0,"minor":6,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":24},"info":"<p>This is a small release to fix some bugs that made the Graph view unusable.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>There is now an &quot;Insider Build&quot; option. If you purchased a Catalyst license (any tier), you have access to early builds. The setting to turn this on is in Settings =&gt; About. Information on Catalyst licenses can be found <a href=\"https://obsidian.md/pricing\">on our website</a>.</li>\n<li>In the Graph view, hovering an item now shows the note name. This means that even when you zoom way out you can still see which notes are where without being overwhelmed.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>The Graph view will stop rendering when nothing on screen is changing. This probably won't make a difference to most people, but those of us with 2k+ notes will see a performance improvement.</li>\n<li>The Graph view now also includes embedded links.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On the open Vault dialogue, deleting a Vault will now delete it, not open it as though to make you feel guilty for wanting to delete it.</li>\n<li><code>ctrl-b</code> will now no longer step on OS- level movement hotkeys.</li>\n<li>Sometimes you could click through a note to the Graph view behind. This turns out to be a very counterintuitive way of doing Random Note, and we stopped that from happening.</li>\n<li>The Graph view would render the names of nodes behind other notes, which made them hard to read. They are now out front where they belong.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":24},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The Graph View got some love. It should be much faster now, and zoomable!</li>\n<li><code>Ctrl/Cmd-click</code> on a node in the graph view now opens in a new pane.</li>\n<li>You can now choose where a file is created when a link to an empty file is clicked. It will be in the root folder of your vault by default, but you can choose somewhere else.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>There's a new UI for settings. Plugin Settings and Community Themes are now in their own separate section, and easier to find.</li>\n<li>You can now turn back off the &quot;Always update links&quot; setting if you want.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We unbroke the thing we broke where you couldn't click on a vault to choose it again. Clicks are meaningful again.</li>\n<li>Minor bugs squashed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":22},"info":"<p>Just a quick bug fix because there was a potential for data loss. But, we couldn't help adding a new feature as well.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>There's now a Custom CSS picker that lets you choose from several community built themes. It's in Settings =&gt; Plugins, the gear next to the Custom CSS switch.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>There was a rare but dangerous bug wherein a race condition could cause two different autosaves to collide, resulting in blanking out a note. That should not happen any more.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":22},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The big news this release: We now support multiple vaults! You can now have windows open to different places, each with their own custom settings and CSS. Details on how to use this feature are in [[Work with multiple vaults]].</li>\n<li>Now when typing a link, if you press <code>|</code> (that's bar/pipe, not L or 1), it will autocomplete and allow you to start typing display text immediately.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Most of the changes this release are on the back end, working on new features.</li>\n<li>Because of the new Vault functionality, the dialogue to open new or existing vaults has been moved out of Settings into its own thing just above the Settings button.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We made a bunch of minor bug fixes and quality of life improvements. Things that were previously subtle or hidden in the interface are now revealed, tastefully. Places text could previously not be selected, are now selectable. Lines showing up in strange places are now replaced with informative text.</li>\n<li>Also we fixed a lot of typos in the docs. Plugins are no longer &quot;disabed&quot; by default.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":18},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The big news: We've implemented linking to headings! Start typing a link like you would normally. Once you highlight the note you want from the list, press <code>#</code> instead of <code>Enter</code> and you'll see a list of headings in that file. Press <code>#</code> again for each subheading, and <code>Enter</code> to complete the link.</li>\n<li>Related to that, if you make a link with heading specified for an embed, it will show just that section in preview mode. The hover preview will also show just that section.</li>\n<li>The OTHER big news: You can now follow links with the keyboard. By default, follow the link under the cursor with <code>alt-Enter</code>, and open in a new panel with <code>Ctrl-alt-Enter</code>, but of course these are customizable in [[Keyboard shortcuts]].</li>\n<li>You can now now search AND replace, <code>Ctrl+H</code> by default.</li>\n<li>Daily notes now have the option of using a template note. Set this in the plug-in settings.</li>\n<li>We also added commands to toggle the left and right side bars. No hotkey set by default.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Link suggestion now has fuzzy search. No more trying to remember what order words came in when you named that file.</li>\n<li>Both the link suggestion and the quick switcher highlight matches as you type. Yes the colors for these can be changed in CSS.</li>\n<li>When you use the Navigate Back command to return to a document, we now restore your scroll location and cursor selection.</li>\n<li>Markdown links with relative paths like <code>[link](../Note.md)</code>  now work. The path is relative to the file you're making the link in.</li>\n<li>Improved the [[Format your notes]] examples to include some of the lesser-used formats to satisfy certain CSS developers who shall remain nameless.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Long note titles are no longer truncated with ellipses, so you can actually see what you're typing when you edit them.</li>\n<li>Long headings are no longer compressed to unreadable in page preview.</li>\n<li>Star and Unstar commands are now a single toggle command.</li>\n<li>We fixed that weird table layout issue that would cause columns to resize poorly.</li>\n<li>We fixed starred notes not appearing after you delete one of them.</li>\n<li>In the sidebar, you can now close a removed pane after disabling a plugin.</li>\n<li>Linking an unlinked file no longer navigates to that file at the same time. If that makes no sense to you, you probably never saw the bug. Don't worry about it, it's fixed now.</li>\n<li>Graph view now runs a single instance in the background. This means you won't lag out the application by opening it multiple times.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":15},"info":"<p>A quick release to fix a couple of things.</p>\n<h2>Changes</h2>\n<ul>\n<li>The is the big one: we changed all <code>Shift+Click</code> to <code>Ctrl/Cmd+Click</code> to open in new pane. Update your muscle memory now!</li>\n<li>There is now an &quot;About&quot; page in the Settings that will tell you what version you're on.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The Starred File plugin no longer halfway shows up when it's disabled.</li>\n<li>We remembered to put in the release notes this time!</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":15},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There's a new plugin: starred files. Starred files will appear in a &quot;Starred&quot; section in the left panel.</li>\n<li>Another new plugin: Open random note. It does what it says!</li>\n<li>We've implemented highlighting for block math, surround it with <code>$$</code>. We also now show math in preview.</li>\n<li>There's now code highlighting for code fences with the language specified, i.e.<code> ```js</code>. Just add the language name after the first set of backticks.</li>\n<li>You can now view and embed webm/mp4/ogg videos and gifs.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>The default font is smaller.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed page preview getting stuck when switching between files.</li>\n<li>We also fixed backlinks not updating when switching between panes.</li>\n<li>Unlinked mentions no longer include the current file. Inception avoided.</li>\n<li>Search in files now shows matches for filenames as well as content.</li>\n<li>We fixed some file name conflict issues, which had the danger of overwriting extant files.</li>\n<li>And we fiixed sometimes not being able to delete an empty folder.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":13},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now make custom hotkeys in settings.</li>\n<li>There are now new commands in the Command Palette for toggle preview, splitting panes, open settings, and more.</li>\n<li>The file explorer now has a &quot;make a copy&quot; option in the file menu.</li>\n<li>For the Daily Note and the ZK prefixer, you can now set the folder path to save to.</li>\n<li>You can also now change the date format for the Daily Note.</li>\n<li>The ZK Prefixer will now automatically increment the minute if the file already exists.</li>\n<li>The editor now has an option to show line numbers, which is helpful for vim mode.</li>\n<li>Footnotes now work in preview.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>In the Graph View, now hovering the circle will highlight the node (it used to only highlight when hovering file name).</li>\n<li>The external link icon in preview is back.</li>\n<li>Clicking on a backlink match now jumps to the matched line.</li>\n<li>We now keep scroll location when toggling between editor and preview.</li>\n<li>When doing a Roam import, we now convert Roam {{[[TODO]]}} and {{[[DONE]]}} to Markdown checkboxes.</li>\n<li>The editor now uses variable-width font instead of monospace by default (you can use custom css to do monospace if you prefer).</li>\n<li>We changed the multi-cursor trigger from <code>ctrl+click</code> to <code>ctrl+alt+click</code> so it doesn't surprise people.</li>\n<li>Search now wraps lines at end of word instead of character.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed heading folding getting reset when clicking on the editor.</li>\n<li>Load speed is now drastically increased for large vaults.</li>\n<li>New folder placeholder name no longer show up as &quot;[object Object] Untitled&quot;.</li>\n<li>Horizontal split no longer causes an extra empty pane to open vertically on the left.</li>\n<li>Long urls now properly wrap rather than taking up their own line.</li>\n<li>We fixed internal links not being clickable in editor if it's the first thing in a list item.</li>\n<li>Things like [[]] no longer highlight everything behind it in the editor.</li>\n<li>Things between dollar signs like $text$ no longer get highlighted.</li>\n<li>Similarly, an arrow ==&gt; is now recognized as not a highlight.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li><strong>Open multiple files side by side</strong>. See how you can now work with multiple notes.</li>\n<li><strong>New Markdown editor</strong>!\n<ul>\n<li>You can now use <code>Ctrl+B</code> and <code>Ctrl+I</code> to bold and italicize selected text.</li>\n<li>List markers (including task list) are created for you when you press <code>Enter</code>.</li>\n<li>You can now fold headings and lists.</li>\n<li>Brackets and Markdown syntax are now auto-paired for you.</li>\n</ul>\n</li>\n<li><strong>Sort files</strong> in file explorer. You can sort by both file name and last modified time.</li>\n<li>Search within file. <code>Ctrl+F</code> to open the search, and use <code>F3</code> to jump to next match, or <code>Shift+F3</code> to the previous match. <code>Esc</code> to exit search.</li>\n<li>Improved search performance for large vaults. Stress-tested with 10,000 Markdown files.</li>\n<li><code>Ctrl+Shift+F</code> to jump straight to search. Start typing right away!</li>\n<li>New plugin: <strong>Zettelkasten prefixer</strong>.</li>\n<li>New plugin: <strong>Daily notes</strong>.</li>\n<li>Better onboarding! You can now create an emty vault if you don't have one, and import the help docs (yes, this folder) to your vault.</li>\n<li>Obsidian now auto-updates to the newest version on restart.</li>\n<li><code>obsidian.css</code> will now be live loaded and changes are reflected in real time, hopefully making it faster to make CSS themes!</li>\n</ul>\n<h2>Changes</h2>\n<p>There are some changes we've made to Obsidian. Might take some time to get used to -- but we think it's for the better!</p>\n<ul>\n<li>By default, the 2-pane preview layout is gone. If you want to restore to that view, <code>Shift+Click</code> the preview button on the title bar. <code>Click</code> will turn the current view into preview.</li>\n<li>Note title bar is now much smaller, allow you to see more text (and longer titles)! It's especially nice when you work with multiple notes.</li>\n<li>We removed back and forward navigation buttons now that you can have multiple files open. You can still use the shortcuts (<code>Ctrl/Cmd+Alt+Left/Right</code>) to navigate though.</li>\n<li>Plugin list is moved into settings. You don't need to access it that often anyway.</li>\n<li>Action buttons like graph view and quick switcher are moved to the top, leaving only settings at the bottom.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Markdown formatting in task list items will break preview.</li>\n<li>Fixed nested task lists not working.</li>\n<li>Fixed cannot delete empty folders.</li>\n<li>Fixed adding duplicate file extensions (e.g. <code>.png</code> when dropping file into another folder).</li>\n<li>Fixed a single &quot;#&quot; being recognized as a tag.</li>\n<li>Subfolder changes are now watched recursively on Linux.</li>\n<li>Fixed files and folders that start with <code>.</code> were not ignored, e.g. <code>.git</code> or <code>.gitignore</code>.</li>\n<li>Fixed window size not preserved across sessions.</li>\n<li>Fixed multiple audio recorder icons appear when you repeatedly enable and disable the plugin.</li>\n<li>Removed Electron help menu items.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":4,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":4},"info":"<ul>\n<li>Layout: you can now resize the left and right panels.</li>\n<li>File explorer: you can now set a folder as the &quot;attachment folder&quot;. Further pasted images, dropped images, and recorded audio files will be stored here.</li>\n<li>Command palette: show all available commands when no search query is entered.</li>\n<li>Command palette: enable plugin by default.</li>\n<li>Attachments: now <code>.jpeg</code> files are also supported.</li>\n<li>File explorer: more compact layout to fit more content. Long file names will not wrap; a tooltip with its full name will appear.</li>\n<li>Quick switcher: you can now create files by typing its name into the switcher. You can even type in <code>Folder/Page</code> to create <code>Page.md</code> under <code>Folder</code>. But for now <code>Folder</code> might exist under vault for this to work.</li>\n<li>Internal link: add warning about existing links when deleting a file.</li>\n<li>Search &amp; backlinks: longer context around the matched text.</li>\n<li>File explorer: fix renaming <code>Example</code> to <code>example</code> will cause duplicate files to show up in Windows.</li>\n<li>Embed files: fix having one embedded file hides everything  that comes after it in that paragraph.</li>\n<li>Task list: fix formatting in the task item will render the item twice in preview.</li>\n<li>Link suggestion: fix folder name not getting searched.</li>\n<li>Link: fix custom scheme URLs like <code>x-devonthink://</code> not working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":4,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":27},"info":"<h3>Shiny new things</h3>\n<ul>\n<li>Command palette. Access commands by typing!</li>\n<li>Backlinks: links are now updated when you rename a file, either from the title bar or from the file explorer.</li>\n<li>Backlinks: hover over an unlinked mention, and you'll get the option to link that mention and turn it into a proper [[Internal link]].</li>\n<li>Navigation: go backward/forward. Added as buttons to the title bar, and you can also access it via command palette and shortcuts (<code>Ctrl+Alt+Left/Right</code>).</li>\n<li>Editor: read mode. Accessible via command palette (type &quot;trm&quot; to find it).</li>\n<li>Quick switcher &amp; command palette: they now support fuzzy search.</li>\n</ul>\n<h3>No longer broken</h3>\n<ul>\n<li>Editor: fix <code>Ctrl+click</code> doesn't create new note.</li>\n<li>Editor: fix unreadable Markdown and white cursor bug.</li>\n<li>If you've moved the vault, instead of refusing to work the app now prompts for another location.</li>\n<li>Graph view fix links that end in <code>.md</code> would break the graph.</li>\n<li>Backlinks: fix unlinked mentions need a space after it in order to match.</li>\n<li>Backlinks: fix <code>[[Page title|Display]]</code> showing up as unlinked mentions instead of links.</li>\n<li>Backlinks: fix full file path like <code>[[Folder/Sub-folder/Page]]</code> not showing up as links.</li>\n<li>Custom CSS: fix cannot disable the plugin if <code>obsidian.css</code> is not present.</li>\n<li>Quick switcher: fix issue where navigating to &quot;Page name&quot; would wipe it if there's a folder called the same name in the same directory.</li>\n<li>Fix line wrapping issues in title bar, embeds, and Backlinks panel.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":3,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":21},"info":"<ul>\n<li>Tag: tags are now supported, with auto-complete support.</li>\n<li>Tag pane plugin, displays all the tags sorted by number of occurrences.</li>\n<li>Format: checkboxes (task list in GitHub flavored Markdown) is now supported.</li>\n<li>Page preview: hover a link in preview to see its content without going there. Ctrl+hover to activate in editor. Disabled by default.</li>\n<li>New plugin: custom CSS. Uses <code>obsidian.css</code> in the vault root if present.</li>\n<li>New plugin: button to open file with default app.</li>\n<li>Graph view: links and neighboring nodes are highlighted when hovering a node, while other nodes are faded out.</li>\n<li>Graph view: better connected nodes now appear bigger.</li>\n<li>Quick switcher: show most recent files when no search is entered.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":2,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":13},"info":"<ul>\n<li>Backlinks: show unlinked mentions as well.</li>\n<li>Preview: support embed Markdown files as well (with <code>![[page name]]</code>).</li>\n<li>Link: an extra click is no longer required to create a new note.</li>\n<li>Link: links to non-existent files are no longer red.</li>\n<li>Link: click an internal link while holding Ctrl or Cmd to follow it.</li>\n<li>Graph: fix previous note title still showing after switching to graph view.</li>\n<li>Slides: fix tables not working in presentation view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":10},"info":"<ul>\n<li>Plugin: backlinks. Show number of backlinks for the current file in status bar.</li>\n<li>Plugin: word count. Show word current of current file.</li>\n<li>Preview pane is now collapsible.</li>\n<li>Light mode.</li>\n<li>Graph view: you can now drag your mouse to pan.</li>\n<li>Copy paste: support pasting in clipboard images (e.g. screenshots).</li>\n<li>Copy paste: support pasting in local images on your hard drive (will be copied to vault folder).</li>\n<li>Copy paste: support pasting in images from your browser (will be downloaded to vault folder).</li>\n<li>Drag-and-drop: support drag and drop images from browser.</li>\n<li>Drag-and-drop: support drag and drop images from other folders (will be copied to vault folder).</li>\n<li>Link: fixed internal links not recognized on app start.</li>\n<li>File explorer: file deletion now asks for confirmation.</li>\n<li>File explorer: now you can move files into the vault folder for organization.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":5},"info":"<ul>\n<li>Linux version first release.</li>\n<li>Slides plugin: use <code>---</code> to separate your slides and start presenting right away.</li>\n<li>Audio recorder plugin: record audio and save as attachment (it gets automatically appended to the end of your current file).</li>\n<li>If you have a file at <code>Folder/Another folder/My note.md</code> and &quot;My note&quot; is a unique name, <code>[[My note]]</code> and <code>[[my note]]</code> internal links will now resolve. It used to be that only the complete link will be resolved.</li>\n<li>Last opened tab and plugin enabled status are now saved in config.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":2},"info":"<ul>\n<li>Graph view: navigate to file when clicking on a node.</li>\n<li>Graph view: collision detection to avoid overlap.</li>\n<li>Graph view: allow scroll to see the entire picture.</li>\n<li>Graph view: better link placement.</li>\n<li>Graph view: scroll to center on load.</li>\n<li>Graph view: visually distinguish non-existent linked nodes.</li>\n<li>Graph view: hide orphan nodes for now.</li>\n<li>App: fix app loads at a small fixed size.</li>\n<li>App: fix developer tools being visible when app first loads.</li>\n<li>Explorer: warn about duplicate file names when renaming.</li>\n<li>Explorer: warn about forbidden characters in file names.</li>\n<li>Sidebar: sidebar title should not be select-able.</li>\n<li>Sidebar: click current tab again to collapse.</li>\n<li>Sidebar: add collapse button to each panel.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":3,"day":30},"info":"<p>Initial release.</p>\n<p>Notable features include:</p>\n<ul>\n<li>Choose vault and list all the compatible files.</li>\n<li>[[Internal link]] with auto-complete.</li>\n<li>Image (<code>.png</code>) and audio (<code>.mp3</code>) file embed with <code>![[filename.png]]</code> [[embedding]] syntax.</li>\n<li>Plugin system.</li>\n</ul>\n","major_release":false}]