[{"version":{"major":0,"minor":12,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":5,"day":3},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Command palette can now be configured to have &quot;pinned&quot; commands that appear at the top.</li>\n<li>Obsidian Publish now has a search filter in the upload dialog.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync no longer runs into a possible race condition which sometimes causes file to be recognized as deleted. This has only been observed happening on Obsidian Mobile so far.</li>\n<li>Vastly improved Obsidian Sync boot up speed. It will now also avoid re-scans of attachments when they haven't been changed.</li>\n<li>Obsidian Sync will now log the reason for connection errors to help with debugging.</li>\n<li>Embedding other notes with a heading or a block target will no longer render the whole note when the target cannot be found.</li>\n<li>On macOS, the trigger to change font size will now use the pinch-to-zoom gesture instead of <code>Cmd+Scroll</code>.</li>\n<li>Improved performance when sidebars are hidden.</li>\n<li>Caching/speed improvements for rendering images and other media files.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed headings took too much space when line-wrapping.</li>\n<li>Fixed editor had a larger gap on the right side due to an improper CodeMirror upgrade.</li>\n<li>Fixed exiting the hotkey customization pane while the app is waiting for a hotkey causes keys to stop working.</li>\n<li>Fixed link suggestion not working with capital letters when over 10k files + aliases.</li>\n<li>The fold indicator in metadata section is now correctly aligned.</li>\n<li>Fixed bound command not preventing default when command doesn't execute, causing confusion.</li>\n<li>Fixed some plugins didn't show up when a sort filter is applied.</li>\n<li>Removed Ctrl/Cmd+M hotkey for minimizing the app, which was previously assigned by default from Electron.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>You can now specify an <code>editorCallback</code> or <code>editorCheckCallback</code> in a command that will register your command as an editor command, which will allow it to be added to the editor toolbar on mobile.</li>\n<li><code>Adapter</code> now has a <code>stat</code> function.</li>\n<li>There is now a <code>Platform</code> object that can be used to determine whether the app is on mobile, along with some other platform information.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":18,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":4,"day":30},"info":"<ul>\n<li>Includes all new functionality and bug fixes of Obsidian Desktop v0.12.2.</li>\n<li>\n<h2>Shiny new things</h2>\n<ul>\n<li>You can now share the current open file to other apps in the more options menu if you have &quot;Open in default app&quot; core plugin enabled.</li>\n<li>Fixed new panes didn't appear right away when you enable core plugins, like outline and starred, and required a restart.</li>\n<li>You can now see the app's version in the About setting tab.</li>\n</ul>\n</li>\n<li><strong>Mobile Toolbar</strong>:\n<ul>\n<li>The configuration tool can now drag-and-drop to reorder toolbar items.</li>\n<li>The toolbar has been rewritten in anticipation of new upcoming APIs. As a result of this, you may need to re-configure the toolbar order.</li>\n<li>The toolbar will no longer show up if you remove all items.</li>\n</ul>\n</li>\n<li><strong>Editor improvements</strong>:\n<ul>\n<li>Clicking search results, backlink items, or outline items will now properly scroll and highlight the target in edit mode.</li>\n<li>Folding is now implemented in edit mode.</li>\n<li>Fixed link suggestion not working for headings.</li>\n<li>You can now click on links in edit mode, which will trigger a popup that can be used to navigate.</li>\n<li>Lists that wraps to the next line will be indented instead of starting at the very left.</li>\n</ul>\n</li>\n<li><strong>Swipe actions</strong>:\n<ul>\n<li>You can now use two-finger swipe left/right to navigate back/forward.</li>\n<li>Will no longer accidentally trigger on <code>canvas</code> objects, which affects graphs and the excalidraw plugin.</li>\n<li>Will now be ignored when coming from a stylus.</li>\n</ul>\n</li>\n<li><strong>iOS specific</strong>:\n<ul>\n<li>Fixed couldn't rename files with long names because it wraps into a hidden area.</li>\n<li>Implemented deleting files to system trash. Deleted files can then be restored from the Files app.</li>\n<li>Fixed Audio recorder plugin on iOS 14.5+.</li>\n<li>File explorer should no longer show some files with a bigger font than others.</li>\n<li>Rotating the screen no longer causes some paragraphs to have a bigger font.</li>\n<li>Fixed iCloud initial sync causes errors when Obsidian boots up.</li>\n<li>When creating new vaults, the iCloud toggle will now be off by default to avoid accidentally setting up Obsidian Sync in iCloud.</li>\n<li>Fixed checkboxes misaligned.</li>\n</ul>\n</li>\n<li><strong>Other general improvements</strong>:\n<ul>\n<li>Fixed deleting files to <code>.trash</code> folder not working properly.</li>\n<li>Fixed flicker when using the font slider in the Appearance setting tab.</li>\n<li>Fixed long-press the three dot menu stopped working. It should now open the more options menu directly.</li>\n<li>Fixed the UI of File recovery plugin.</li>\n<li>&quot;Link&quot; button will now always show in unlinked mentions on mobile.</li>\n<li>Plugins that create a status bar item will no longer crash.</li>\n<li>Menus triggered from file explorer will now have the file name indicated at the top.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":17,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":4,"day":20},"info":"<ul>\n<li>Fixed can't backspace to delete <code>Tab</code> characters on Android.</li>\n<li>Fixed Option + left/right/delete not behaving correctly on iOS.</li>\n<li>Fixed selecting text triggers swipe action, causing selection handles to disappear.</li>\n<li>Fixed auto-capitalization not working on iOS.</li>\n<li>Fixed side panel fullscreen looking ugly on iOS.</li>\n<li>Don't crash on iOS when selecting &quot;Camera&quot; when inserting attachments.</li>\n<li>Don't show hover tooltips for a split second when pressing buttons.</li>\n<li>Also includes everything up to Desktop v0.12.1</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":4,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>On initial loading of the vault, the cache indexing notification will now contain the indexing progress.</li>\n<li>Improvements to the font size adjustment annoyance:\n<ul>\n<li><code>Ctrl+Scroll</code> now only activates if you hold Ctrl before starting to scroll.</li>\n<li>This option can also now be disabled in Settings &gt; Appearance.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Obsidian Sync: setting custom device names now persists properly.</li>\n<li>Obsidian Sync: viewing version history of images and other media files no longer freeze the app trying to render the media file as plaintext. Images can now be previewed.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The HTML property on task lists has been changed from <code>data-checklist</code> to <code>data-task</code> to be consistent with internal code names.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":12,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":4,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now search for tasks using <code>task:</code> similar to <code>block:</code>. There is also <code>task-todo:</code> and <code>task-done:</code> which will match only the tasks that are incomplete or complete, respectively. Use <code>task:&quot;&quot;</code> to match all tasks.</li>\n<li>Search and backlink results has been significantly reworked:\n<ul>\n<li>Search results are now always expanded, instead of showing &quot;... and x more matches&quot;.</li>\n<li>&quot;Show more context&quot; will now show the Markdown block, instead of a fixed number of lines before and after the match.</li>\n<li>There are now buttons to expand individual search results to see even more context.</li>\n<li>Hover preview on search results will now scroll the highlighted region to the center rather than being clipped at the top.</li>\n</ul>\n</li>\n<li>You can now display backlinks inside the document using the more options menu while in preview mode. We will try to support edit mode in a future release.</li>\n<li>Task lists <code>[x]</code> can now contain any character to indicate a completed task, instead of just <code>x</code>. This value can be used by custom CSS to change the appearance of the check mark, and is also available for plugins to use.</li>\n<li>There are now hotkeys to show the panes for file explorer, backlinks, outline, starred, and tag pane.</li>\n<li>You can now change the font size in the editor and preview with an option in Settings &gt; Appearance, or using <code>Ctrl/Cmd + up/down scroll</code>. Some themes may have set overrides for the font size, so this setting might not work for you. See the developer section for details.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Major improvements to plugin management:\n<ul>\n<li>Plugin search now also matches in the description field as well.</li>\n<li>You can now filter installed plugins using a search term.</li>\n<li>Enabled plugins are no longer reset when you toggle safe mode. This can help quickly test whether issues are caused by plugins.</li>\n<li>Plugins can now be enabled or disabled in the same place where they are installed, so you can enable it right away after install, instead of having to find them in the plugins list.</li>\n<li>The &quot;update&quot; button will no longer show up if a plugin doesn't have a new version.</li>\n<li>Plugin setting tabs are now sorted alphabetically.</li>\n</ul>\n</li>\n<li>Obsidian Sync will now store a customizable device name which will show up in the sync log to help debug sync issues.</li>\n<li>Obsidian Publish now allows search on your site even if you don't turn on navigation.</li>\n<li>You can now specify a logo file for Obsidian Publish.</li>\n<li>There is now an option to reload the app when an error happens during initialization.</li>\n<li>There is now a notification when the app first indexes the vault to avoid confusion why some features might not work right away.</li>\n<li>Link suggestions and quick switcher will now fallback to a simpler matching algorithm when vault contains over 10k notes to avoid delays.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Renaming files no longer cause heading links to self (<code>[[#heading]]</code>) to include the file name.</li>\n<li>The Workspaces plugin will now save to the proper workspace if the app was closed and restarted right after switching workspaces.</li>\n<li>Fixed some i18n strings that weren't properly loaded and always used the English variants due to a race condition.</li>\n<li>File names with multiple consecutive space characters now render properly, instead of having the spaces collapse into one.</li>\n<li>Generated Markdown links now properly escapes backslashes.</li>\n<li>Fixed embedded queries behave differently than global search when matching attachment files.</li>\n<li>Fixed linking unlinked mentions not using preferred Markdown link format.</li>\n<li>Word counter for Korean now properly counts words rather than letters.</li>\n<li>Fixed Shift-select in the file explorer accidentally selecting unsupported files that were not shown, causing unexpected file moves when using drag and drop after.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Theme developers: from now on, please avoid setting font-size using absolute units like <code>px</code> or <code>pt</code>. Instead, use relative units like <code>em</code> or <code>%</code>, which will automatically scale from the font size the user specified. To migrate <code>px</code> to <code>em</code>, you can divide your px value by 16 (the default font size), for example, <code>24px =&gt; 1.5em</code>.</li>\n<li>Commands that return false in their <code>checkCallback</code> will no longer set <code>preventDefault()</code> on the key event.</li>\n<li>MetadataCache now includes <code>sections</code> and <code>lists</code> info.\n<ul>\n<li>Sections describe the Markdown root level &quot;blocks&quot;, and comes with a <code>type</code>.</li>\n<li>Lists comes with a <code>parent</code> field which can be used to deduce parent-child relationships, and also a <code>task</code> field which indicates whether this is a task and its completed status.</li>\n</ul>\n</li>\n<li><code>MarkdownRenderChild</code> now requires a <code>containerEl</code> passed in via its constructor.</li>\n<li>You can now retrieve section information as a <code>MarkdownPostProcessor</code> from the context object <code>MarkdownPostProcessorContext.getSectionInfo()</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":16,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":4,"day":8},"info":"<ul>\n<li>New &quot;Quick Action&quot; pull down from the top, defaults to Command Palette, but can be configured.</li>\n<li>Completely revamped left and right sidebar animation.</li>\n<li>Setting and Switch vault buttons have been moved to the bottom of the ribbon (just like the desktop layout).</li>\n<li>Slight improvement to link and tag suggestions so the text is less likely to be hidden behind the panel.</li>\n<li>Tab and Shift-Tab now works.</li>\n<li>Readable line length is now implemented in edit mode.</li>\n<li>Fixed fold indicators not visible in preview. (Edit mode still not implemented yet).</li>\n<li>Obsidian Publish is now available from mobile.</li>\n<li>Desktop-only plugins can no longer be installed.</li>\n<li>Fixed resize handle visible through side panes.</li>\n<li>Fixed long vault names don't look very nice.</li>\n<li>Also includes everything up to Desktop v0.11.13</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":13,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":4,"day":4},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Page preview can now be configured to require Ctrl/Cmd on hover for each component independently.</li>\n<li>A new option in the About section can now let you specify a folder name for the vault config different than <code>.obsidian</code>. It must still begin with a dot, and must be a valid folder under the vault root. This supersedes the <code>.obsidian.nosync</code> fallback from the last release.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Hardware acceleration has been moved to an advanced section.</li>\n<li>Mermaid.js has been upgraded to 8.9.2.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Empty aliases in frontmatter should no longer cause the backlink pane to spin forever.</li>\n<li>Sync should now properly delete folders with <code>.DS_Store</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":4,"day":1},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed CSS snippets stopped working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":4,"day":1},"info":"<h2>Improvements</h2>\n<ul>\n<li>Hover previews now always requires holding <code>Cmd/Ctrl</code>.</li>\n<li>Markdown auto-pairing for <code>=</code>, <code>~</code> and <code>$</code> now only works when you are selecting text. Auto-pairing as you type was an undesirable behavior that was quite annoying for these characters.</li>\n<li>Introduced auto-pairing for comments <code>%</code>, also only happens when you are selecting text.</li>\n<li>Obsidian Sync now no longer cause a few characters of glitching when receiving multiple changes over a high latency network.</li>\n<li>Obsidian Sync will now ignore files with illegal characters when downloading, rather than constantly running into an error and retrying.</li>\n<li>File Recovery will now retry saving files that has been edited but was still in the cooldown period.</li>\n<li>It is now possible to rename <code>.obsidian</code> to <code>.obsidian.nosync</code> to prevent iCloud from syncing the config folder. Make sure to close the app before the rename.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed publish unable to upload <code>publish.js</code>.</li>\n<li>Fixed swapping panes causes one of them to shrink.</li>\n<li>Disabled plugins now properly disables the previously selected hotkeys.</li>\n<li>Fixed file property of <code>new</code> URI handler not working without a parent folder.</li>\n<li>The active pane will now be properly restored between restarts of the app.</li>\n<li>Pressing <code>End</code> will now properly go to the line end in tables.</li>\n<li>Fixed title and body flashes to &quot;No file&quot; briefly when switching notes.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now a mobile emulation flag that can be used to emulate mobile mode. Use <code>app.emulateMobile(true)</code> to turn on emulation and <code>app.emulateMobile(false)</code> to turn off.</li>\n<li>Officially starting to discourage the use of CodeMirror 5's API if possible, and migrate to using the <code>Editor</code> interface. The <code>Editor</code> interface supports Obsidian Mobile and will be used to power the future WYSIWYG mode. We will gradually add any missing APIs to ensure feature compatibility with the older CM5 API when possible.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":15,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":3,"day":30},"info":"<ul>\n<li>Fix iCloud sync not downloading whole vault.</li>\n<li>Fix unable to save/move files to Obsidian's iCloud folder.</li>\n<li>Sync will now ignore paths with invalid characters.</li>\n<li>Fixed Obsidian URI executes twice on first starting.</li>\n<li>Also includes updates up to Obsidian desktop v0.11.10.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":14,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":3,"day":27},"info":"<ul>\n<li>Improved iCloud performance (Should no longer lag or freeze).</li>\n<li>You can now add local Obsidian vaults, sub folders, and files to other apps in Files.</li>\n<li>Improved Obsidian Sync reliability.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":3,"day":26},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Backlinks and unlinked mentions can now be filtered using a search query.</li>\n<li>Several new features for Obsidian Publish:\n<ul>\n<li>Option to insert a Google Analytics code (make sure your local regulations allows). Note that this is only available for sites under a custom domain.</li>\n<li>Option to run JavaScript on your site, by uploading a file named <code>publish.js</code> in the root of your vault. Note that this is only available for sites under a custom domain.</li>\n<li>An option to redirect visitors from <code>publish.obsidian.md</code> to your custom domain.</li>\n<li>Password protected sites on custom domains should now work even if third party cookies are blocked.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Hotkeys in Obsidian will now override default hotkeys set by the CodeMirror editor, which previously would also be triggered, causing confusing behavior.</li>\n<li>On Windows and Linux, the non-standard editor hotkeys <code>Ctrl+Up/Down</code>, <code>Ctrl+Shift+Up/Down</code> and <code>Alt+Left/Right</code> have been removed to avoid confusion.</li>\n<li>On macOS, the <code>Option+B/F/D</code> hotkeys have been removed, and will now insert the special symbols <code>ƒ</code> <code>∫</code> and <code>∂</code> normally.</li>\n<li>On macOS, the legacy emacs navigation key bindings for the editor can now be disabled in the editor settings.</li>\n<li>Obsidian will now restore windows to your main screen on startup if they are off-screen, which could be caused by removing a monitor that was previously connected.</li>\n<li>Improved Tibetan language behavior in search and auto-complete.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li><code>tiff</code> files are no longer listed as supported images. The browser engine didn't support it in the first place.</li>\n<li>Sync should no longer get stuck on files larger than 100mb.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":13,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":3,"day":22},"info":"<ul>\n<li>Added <code>obsidian://</code> URI handler.</li>\n<li>Added &quot;Insert attachment&quot; toolbar item (needs to be configured).</li>\n<li>Fixed iCloud files with spaces and special characters don't refresh when they're edited elsewhere.</li>\n<li>Fixed left drawer animation.</li>\n<li>Fixed cursor goes under toolbar when pressing enter.</li>\n<li>Fixed small editor glitch with Japanese and Chinese input.</li>\n<li>Fixed copy to clipboard on Android.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":3,"day":21},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed crash on new vault.</li>\n<li>Fixed plugin tabs not added to the correct setting section.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":3,"day":21},"info":"<h2>Improvements</h2>\n<ul>\n<li>Clicking on a search result will now expand any folded regions to highlight the match.</li>\n<li>Improved initial cache loading performance when vault has lots of resource/media files.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed nested <code>section:</code> search always matched files with no headings.</li>\n<li>Fixed <code>file:///</code> image and iframe paths for MacOS and Linux.</li>\n<li>Fixed clicking on a link suggestion doesn't do anything.</li>\n<li>File recovery items can now be scrolled.</li>\n<li>Sync will no longer get stuck trying to delete a folder that has files inside.</li>\n<li>Fixed file explorer glitching out when there are many hidden unsupported files.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":12,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":3,"day":17},"info":"<ul>\n<li>Fixed saving files always corrupts files larger than 5MB.</li>\n<li>Community plugins can now be installed. Some of them might not work correctly.</li>\n<li>You can now rename and delete vaults.</li>\n<li>Fixed Audio Recorder for Android. iOS waiting for Apple's bugfix coming in iOS 14.5.</li>\n<li>Fixed broken creation and modified dates on iOS.</li>\n<li>Added file context menu in right sidebar.</li>\n<li>Added file context menu when long-hold three dot menu on the top right, as a shortcut for the one in the sidebar.</li>\n<li>Added long-hold file context menu in file explorer.</li>\n<li>Fixed side drawers titles &amp; icons sometimes not updated.</li>\n<li>Improved Obsidian Sync version history interface.</li>\n<li>Fixed animation glitches.</li>\n<li>Fixed notices not showing up in the correct spot.</li>\n<li>Tons of small UI tweaks for mobile interface.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":3,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a new File Recovery core plugin that keeps snapshots of your most recently edited files for recovery. This can be used to restore lost data in cases where a computer crash causes a file to be corrupted, or when a plugin malfunction causes a file to be wiped.</li>\n<li>You can now nest a <code>section:</code> search within another one to search for sub-headings. For example, <code>section:(Heading1 section:(Subheading))</code></li>\n<li>There is now an option to disable GPU acceleration, especially helpful for those experiencing kernel panics and graphical glitches on MacOS.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Embedded query blocks will now exclude its own block when searching.</li>\n<li>Folder auto-complete for setting options that take a path is will now match case-insensitive.</li>\n<li>There is now an option to switch vault when the app encounters an error when loading the vault.</li>\n<li>Vim mode now has a confirmation dialog to prevent it from being accidentally turned on.</li>\n<li>&quot;Open today's note&quot; command has been tweaked to &quot;Open today's daily note&quot; to avoid confusion.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fix heading and list folding not persisted properly.</li>\n<li>Fix the link suggestion box stuck on page when opening a links using hotkey.</li>\n<li>Fixed rare case of Sync getting stuck on a merge failure.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":11,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2021,"month":3,"day":12},"info":"<ul>\n<li>The global action bar from the left swipe menu has been replaced with a ribbon that works identically to the desktop version.</li>\n<li>Command palette, and all the core plugin actions are now available from the ribbon.</li>\n<li>New option to close panes in right drawer.</li>\n<li>iOS: Fixed app zooms in when taking some actions.</li>\n<li>iOS: Can now double-tap to select words.</li>\n<li>iOS: Screen doesn't fade when scrolling with cursor on a link.</li>\n<li>iOS: Graph no longer crash the app on closing.</li>\n<li>iOS: Fixed status bar text unreadable on light theme.</li>\n<li>Can now press enter in a blockquote.</li>\n<li>Tap on outline item now closes the outline.</li>\n<li>Keyboard retract on search to give more space.</li>\n<li>Performance improvements for animations.</li>\n<li>Lots of small UI tweaks to make various elements size correctly, overflow nicely, scrollable and fit within the viewport.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":3,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>A new command has been added for opening a new workspace while saving the current one.</li>\n<li>Obsidian Sync will now automatically merge sync conflicts instead of overwriting the file. Note that this only applies to <code>.md</code> files.</li>\n<li>When a change is made to a note on disk, but you also have changes in Obsidian that hasn't been auto-saved (within 2 seconds), the two versions will now be merged automatically. Previously the app would discard any unsaved changes causing you to lose a few characters typed.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Search will no longer get stuck if some note failed to load due to a filesystem error.</li>\n<li>When opening a note fails due to a filesystem error, it will no longer be possible to accidentally save the contents of the previously opened note on the newly opened note.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed a rare case sync race condition on high latency network when running on multiple devices. This would previously undo the last few characters typed into the document.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":3,"day":2},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Toggle checklist now works again when the line is empty.</li>\n<li>Fixed link suggestion incorrectly positioned sometimes, overlapping the link itself.</li>\n<li>Fixed tables wrapping in edit mode.</li>\n<li>Search suggestions should now be correctly rendered.</li>\n<li>Fixed scroll sync with embeds that contain lists.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":2,"day":26},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now start a timelapse graph animation using a command.</li>\n<li>You can now reorder graph color groups by drag and drop on the color picker.</li>\n<li>There is now a new command to toggle the spellchecker.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>We've removed the hotkey <code>Ctrl/Cmd+R</code> which previously reloads the app. It is now a command that can be customized, and is not assigned to any hotkey by default.</li>\n<li>Link auto-complete will now stay when no results are found, so that hotkeys like <code>Tab</code> and <code>Enter</code> will work consistently.</li>\n<li>The language you choose will now be applied to the locale of <code>moment.js</code>, which affects the language generated from your date formats.</li>\n<li>There is now a count for number of community plugins installed.</li>\n<li>Clicking on a suggested item in search will automatically add double quotes <code>&quot;</code> for paths that contain spaces.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li><code>/</code> will no longer show up twice in the forbidden characters list.</li>\n<li>Fixed <code>Ctrl+Click</code> on MacOS not working as right click in graph view.</li>\n<li>Fixed middle click not working on graph view to open in new pane.</li>\n<li>Changing ignored folders or changing file type filters should no longer cause sync to delete some files accidentally.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":2,"day":20},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Publish now has an option to block search engines from indexing your site.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed couldn't drag and drop text around the editor.</li>\n<li>Drag and drop files from the system explorer has been restored to copy the file into the vault by default. Holding <code>Ctrl</code> will create a link instead.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":2,"day":18},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fenced code blocks are now properly styled.</li>\n<li>The <code>obsidian://</code> URL handler won't be registered again if it's already registered with the operating system, which causes a permission prompt on Linux snap.</li>\n<li>Fixed custom CSS not hot-reloading when the file has been changed.</li>\n<li>Clicking on links to create a folder structure should now display those folders properly in the file explorer.</li>\n<li>On MacOS, to drag and drop files on panes, you now have to hold <code>Shift</code> instead of <code>Alt</code> due to MacOS overriding the <code>Alt</code>-drop behavior.</li>\n<li>On MacOS, to drag and drop files from the system explorer and copy the file into the vault, you now have to hold <code>Ctrl</code> instead of <code>Cmd</code> due to a similar issue.</li>\n<li>Fixed vaults not working inside an emulated file system, such as a Cryptomator drive.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":2,"day":16},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian will now recognize symlinks or folder junctions inside the vault. They are supported, but not recommended because of the many issues they can cause. <a href=\"https://help.obsidian.md/Symbolic+links+and+junctions\">Learn more.</a></li>\n<li>You can now change the sorting order when browsing community plugins by alphabetical, initial release, or download count.</li>\n<li>When you drag and drop files from your native file explorer into Obsidian, it will now default to creating <code>file:///</code> absolute links. Holding the <code>Ctrl/Cmd</code> key will copy the files into your vault like it did previously.</li>\n<li>There is now a command to toggle comments. By default it's <code>Ctrl/Cmd</code> + <code>/</code>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Clicking on links to notes that haven't been created will now create the folder structure if the parent folders don't yet exist.</li>\n<li>Global search will now find attachments as well if you use <code>file:</code> or <code>path:</code> operators.</li>\n<li>You can now use <code>&lt;iframe&gt;</code> to embed even more sites that previously wouldn't show. This is done by patching the <code>Content-Security-Policy</code> header containing <code>frame-ancestors</code> that some websites use to prevent embedding.</li>\n<li>When looking through the version history of Obsidian Sync, you can now select and copy the file contents for each specific version.</li>\n<li>Hovering Markdown links in edit mode will now highlight them.</li>\n<li>Korean handling has been improved to perform character match instead of word match for unlinked mentions and quoted searches.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Image embeds will no longer go to the next line.</li>\n<li>Fixed lag when typing at the end of a large document.</li>\n<li>Graph color groups no longer reset to black for some colors.</li>\n<li>Moving a file will no longer show a &quot;successfully renamed&quot; message.</li>\n<li>The toggle highlights command/hotkey will now toggle properly for multi-line selections.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":11,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":2,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can divide nodes in graph view into groups based on queries, and customize the color of each group. Color all the nodes!</li>\n<li>Folding is now persisted for edit mode and preview mode.</li>\n<li>You can now create a new note with an optional content using the Obsidian URI. <a href=\"https://help.obsidian.md/Advanced+topics/Using+obsidian+URI#Action+new\">More details.</a></li>\n<li>There is now an official Hook integration using the Obsidian URI.</li>\n<li>You are now allowed to use more special characters on MacOS and Linux, such as <code>?</code> and <code>*</code>. Keep in mind that if you synchronize your files with a Windows machine, those will not work.</li>\n<li>When right clicking a link, there is now an option to rename the target file.</li>\n<li>You can now hover search results, backlinks, and unlinked mentions to preview the match using the page preview plugin.</li>\n<li>There's now an option to automatically open your daily note whenever you open your vault.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Folding is now persisted for folders in file explorer.</li>\n<li>Folding is now persisted for graph control sections.</li>\n<li>Folding is now persisted for nested tags.</li>\n<li>You can now use <code>file:///</code> absolute paths to embed images and iframes from your local machine.</li>\n<li>You can now hold <code>Alt</code> to drop a file anywhere on a pane to open it there, rather than having to drop it in the header.</li>\n<li>Graph filters will now automatically apply after you finish typing.</li>\n<li>Block references to list items now scrolls and highlights the exact list item, instead of the whole list.</li>\n<li>Clicking on link to notes that don't yet exist will now open the newly created note in edit mode.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Playing a video in a hover preview no longer causes the video to continue playing after the preview is closed.</li>\n<li>Preview panes will now attempt to keep your scroll location when you resize or split the pane.</li>\n<li>Clicking on a search result now scrolls all linked panes to the result location.</li>\n<li>Word count now properly counts Tamil letters.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>There is now an API available to handle URI actions using the <code>obsidian://</code> protocol. Look for the function <code>Plugin.registerObsidianProtocolHandler(action, handler)</code>.</li>\n<li>You can now use <code>App.fileManager</code> to rename files and update links.</li>\n<li>You can now use <code>Workspace.onLayoutReady(callback)</code> to have a callback run if and when the app's layout is ready. This replaces the previous pattern<pre><code class=\"language-ts\">if (workspace.layoutReady) {\n  callback();\n} else {\n  workspace.on('layout-ready', callback);\n}\n</code></pre>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":13,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":2,"day":5},"info":"<h2>Improvements</h2>\n<ul>\n<li>Graph view can now zoom out more.</li>\n<li>Sync will no longer accidentally sync a new vault if the <code>.obsidian</code> folder was copied.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed opening a note in the current pane does not focus on the editor.</li>\n<li>Pressing <code>Tab</code> after typing in the file name bar should also focus on the editor.</li>\n<li>Revert mermaid patch which caused links to stop working.</li>\n<li>Fixed buttons in global search pane disappearing when pane is small.</li>\n<li>Fixed Markdown links sometimes not properly converting for space character.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":2,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There is now a new syntax for comments. Comments will not show up in preview.\n<ul>\n<li>Example: <code>%% comments go here %%</code></li>\n<li>Can be multi-line if the starting <code>%%</code> is at the beginning of the line.</li>\n<li>Inside comments, you can still use inline Markdown formats.</li>\n<li>Links will be recognized for backlinks and graph relationships.</li>\n<li>Tags will be counted and can be searched.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now right click nodes in graph view for a variety of options.</li>\n<li>Tables in edit mode will now use a monospaced font by default, to help with alignment.</li>\n<li>Disabling a plugin will no longer disassociate any hotkeys you have set, and they will work again when the plugin is re-enabled.</li>\n<li>Auto-generated Markdown links will now only URL-encode special characters not recognized by Markdown (such as the space character), as opposed to fully URL-encode any non-ASCII character.</li>\n<li>Obsidian now stores its cache/index in IndexedDB instead of as a JSON file, which caused typing lag previously for huge vaults.</li>\n<li>A broken embed link will now show a box indicating the destination file cannot be found, instead of just disappearing entirely.</li>\n<li>In custom CSS, you can now use <code>data:</code> and <code>https://</code> based web fonts.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Updating a plugin should now properly execute the newly updated plugin, instead of still running the old version.</li>\n<li>Having multiple editor panes open of the same file will no longer cause characters to be overwritten when typing.</li>\n<li>The templates plugin should no longer suggest non Markdown files from the template folder.</li>\n<li>Moving panes around should no longer cause preview mode to go blank.</li>\n<li>Fixed i18n string in Obsidian Publish's custom domain settings.</li>\n<li>File explorer set to sort by modified time will now properly re-sort when files are modified.</li>\n<li>The hotkeys to creating new note will now work even if the file explorer is turned off.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Inline sourcemaps are no longer 2 lines off from your original source when looking at it from the debugger.</li>\n<li>A new abstract view <code>TextFileView</code> is now available for use. This class is an <code>EditableFileView</code> that additionally takes care of saving/loading the file contents. If you wish to extend this view, you can simply hook up the functions that interfaces with your editor and the rest should be taken care of.</li>\n<li>There is now a <code>debounce</code> function exposed for convenience.</li>\n<li>Due to popular demand, there is now a new <code>Plugin.registerMarkdownCodeBlockProcessor</code> helper that makes it easier to register a handler for a custom fenced code block, similar to <code>mermaid</code> and <code>query</code> embeds.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":11,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":28},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed unable to install or update plugins due to a change in GitHub's hosting infrastructure.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2021,"month":1,"day":25},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now choose to show all files, even if Obsidian doesn't recognize the file extension. This will allow you to link to those files, see them in the File Explorer, and open them from the Quick Switcher.</li>\n<li>You can now use <code>&lt;iframe&gt;</code> to embed sites that previously wouldn't show. This is done by ignoring the <code>X-Frame-Options</code> that some websites use to prevent embedding.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now upload <code>favicon.ico</code> for Obsidian Publish.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Image embeds using the wikilink syntax <code>![[image.png]]</code> are now displayed inline instead of taking up a whole line by itself.</li>\n<li>In the custom domain setting for Obsidian Publish, you should now properly see what custom URL you've previously set.</li>\n<li>Sync will no longer delete ignored folders or media files uploaded by other machines.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The API <code>Plugin.registerExtensions()</code> will now allow the app to recognize the file extension without requiring the user to turn on the &quot;Detect all file extensions&quot; option. In combination with <code>Plugin.registerView()</code>, you can now create custom viewers or editors for any file type that we don't currently support.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Publish now supports custom domains, subdomains or a sub-folder of your website. For details, <a href=\"https://publish.obsidian.md/help/Licenses+%26+add-on+services/Obsidian+Publish#Custom+domain\">see the help docs</a>.</li>\n<li>There is now a button to copy heading links on Obsidian Publish.</li>\n<li>Global search now displays helpful tips on the various filters we support.</li>\n<li>Global search now has a way to clear the search history.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>PDF export settings are now persisted.</li>\n<li>There is now a button to update all plugins. In addition, installed plugins are now sorted alphabetically.</li>\n<li>Non-existing files are now properly displayed when there is a search filter for path applied, instead of completely removed.</li>\n<li>Mermaid has been upgraded to v8.8.4.</li>\n<li>Clicking on the backlink status bar item now opens the backlink pane.</li>\n<li>Opening the help vault will now open a translated version based on your selected language. Currently only supports Italian, Japanese, and Chinese. <a href=\"https://github.com/obsidianmd/obsidian-docs\">Help us translate the help vault to your favorite language</a>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The random note plugin no longer adds two ribbon icons.</li>\n<li>Hover preview now loads embedded search properly.</li>\n<li>Fixed uppercase block IDs not linking/embedding properly.</li>\n<li>Backlink panes now updates file titles correctly when a file is renamed.</li>\n<li>Opening a dialog no longer lets you accidentally focus or make modifications to the document behind the dialog.</li>\n<li>Pasting as HTML no longer copies over the text from <code>&lt;style&gt;</code> tags.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":8,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":11},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian Publish can now restrict site access with one or multiple passwords.</li>\n<li>You can now choose to store attachments in the same folder as the current note, or in a subfolder relative to the current note.</li>\n<li>Huge PDF improvements:\n<ul>\n<li>PDF files will now render when embedded inside a note.</li>\n<li>PDF files are now rendered using a native PDF viewer, which can scroll, zoom, select and copy text.</li>\n<li>You can now link to a page of a PDF file by adding <code>#page=number</code> at the end. For example <code>[[My file.pdf#page=3]]</code>. This also works for embedded PDFs. Typing <code>#</code> while auto-completing a PDF file will automatically add <code>#page=</code> for you.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Folders now shows the number of files and subfolders when you hover over them.</li>\n<li>The hover tooltips for the file explorer has been reprimanded for being too eager to show up on time. They will now only display once you stop your mouse over it.</li>\n<li>An unlinked pinned outline pane will now attempt to open the file if it's not already open.</li>\n<li>Audio recorder will now generate file names with timestamps similar to pasted images.</li>\n<li>Word count has been improved to handle numbers better.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Changing active panes with hotkeys will now properly focus on them.</li>\n<li>Tooltips no longer leave behind a lingering line sometimes.</li>\n<li>Tooltips now appear on the correct side for backlinks and file explorer.</li>\n<li>The editor text should now always stay clear using subpixel-antialiasing, instead of jumping to blurry grayscale from time to time.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The <code>file-open</code> event is now fired in a debounced frame instead of synchronously running while the <code>activeLeaf</code> is being set.</li>\n<li>The <code>layout-ready</code> event will now only fire once when the app finish loading the workspace, instead of also triggering when loading a different workspace.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Tags can now be clicked on Obsidian Publish to show a list of other pages containing the same tag.</li>\n<li>You can now <code>Ctrl/Cmd</code> click tags in the tag pane to toggle them as a search filter, instead of replacing the search query.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>You can now unlink and pin backlink, outline, or local graph panes to have them stay on the file that was open, instead of navigating along with the current active pane.</li>\n<li>Daily notes will now only check for the daily note inside the selected folder.</li>\n<li><code>tag:#mytag</code> will now always use case-insensitive mode, since tags are always insensitively matched. For case sensitive match, use a plain <code>#mytag</code> query instead.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Tags with underscore <code>_</code> will now auto-complete properly.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2021,"month":1,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Tags are now case insensitive in graph view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The backlink pane should now scroll properly if it's not in the sidebar.</li>\n<li>The ugly flair for attachment file types is now properly styled in the file explorer.</li>\n<li>Internal links can now be selected again in preview.</li>\n<li>Folding headings in preview no longer causes the subsequent area to stay blank until the page is scrolled.</li>\n<li>Dragging and dropping text with a <code>:</code> character no longer creates a Markdown link.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":31},"info":"<h2>Improvements</h2>\n<ul>\n<li>Opening Obsidian with an <code>obsidian://</code> URI no longer opens all previously opened vaults.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Graph view controls should now be styled properly.</li>\n<li>Unexpected OS keys should no longer break the hotkeys panel.</li>\n<li>Tooltips will now properly stay on a single line if there's enough space.</li>\n<li>Tag pane should no longer blank out after collapsing or expanding parent tags.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>In the editor, <code>#parent/child</code> nested tags will only have <code>cm-hashtag-end</code> on the last piece of <code>&lt;span&gt;</code> when spellchecker breaks the tag into multiple pieces.</li>\n<li><code>MarkdownRenderChild</code> has been properly exported.</li>\n<li>Elements in the file explorer now has their file path encoded in a <code>data-path</code> attribute to facilitate custom CSS targeting.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":30},"info":"<h2>Improvements</h2>\n<ul>\n<li>Hotkeys has been once again reworked to use a &quot;semi&quot; layout independent mode. This should properly recognize remapped layouts like AZERTY and Dvorak, but still provide layout-independence from number and symbol keys.</li>\n<li>Remapped escape key (typically on caps lock) should now work again.</li>\n<li>If you've set any hotkeys in v0.10.2 or v0.10.3, you might need to reset them if they stopped working.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed tag pane sometimes not showing some nested tags depending on the sorting algorithm used.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Nested Tags: you can now nest tags with unlimited hierarchies using the syntax <code>#parent/child/subchild</code>.\n<ul>\n<li>Searching for <code>tag:#parent</code> will now match <code>#parent/child</code>.</li>\n<li>Tag pane now has an option to display nested tags in hierarchy or flat mode.</li>\n</ul>\n</li>\n<li>Search now has 3 more operators:\n<ul>\n<li><code>line:(...)</code> will perform the subquery on a line-by-line basis, rather than a file-by-file basis. For example, <code>line:(foo bar)</code> will only match <code>foo</code> and <code>bar</code> if they're on the same line.</li>\n<li><code>block:(...)</code> will perform the subquery on a block-by-block basis. This is expensive computationally as it requires parsing each file, which means this is likely slower than other modes.</li>\n<li><code>section:(...)</code> will perform the subquery on a section-by-section basis. A section starts from a heading and ends before the next heading.</li>\n</ul>\n</li>\n<li>Hotkeys have been completely revamped to always use keyboard layout independent mode.\n<ul>\n<li>This has caused confusion in the last version, so we've simplified the process.</li>\n<li>If you've customized hotkeys in the past, they will still work.</li>\n<li>All new hotkeys will be layout independent.</li>\n</ul>\n</li>\n<li>You can now drag and drop links to pane headers to open the link in a specific pane.</li>\n<li>You can now see created and modified time of files by hovering them in the file explorer.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li><code>Cmd+Shift+V</code> can now paste as plaintext on macOS, in addition to the previous <code>Cmd+Shift+Option+V</code> (seriously, who came up with this default hotkey?).</li>\n<li>You can now disable HTML to Markdown conversion on paste in Settings &gt; Editor.</li>\n<li>Hotkeys that are assigned multiple times are now displayed in red.</li>\n<li>Closing panes will re-focus on the most recent active pane instead of the first pane from the left.</li>\n<li>Clicking on a link will automatically focus on the new pane if the current pane is pinned.</li>\n<li>The translucency plugin has been moved to the appearance setting tab.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Links with <code>%20</code> now decode properly when navigating using the editor.</li>\n<li>Focusing on panes now properly sets the state for arrow keys and page up/down keys to scroll the preview.</li>\n<li>Dragging text within the same editor pane no longer duplicates it.</li>\n<li>Fixed spacing between paragraphs in blockquotes.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>Setting</code> and <code>BaseComponent</code> now have a <code>setDisabled</code> function that will disable its control. Disabling a setting will disable all of its components.</li>\n<li><code>Scope.registerKey</code> is now deprecated. It is replaced by <code>Scope.register</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now embed search queries in the page using the fenced code block syntax with <code>query</code> as the language, similar to how mermaid works. Note that this syntax does not work in Obsidian Publish.</li>\n<li>Obsidian Publish now has a &quot;Show search bar&quot; option, which will add a search bar inside the navigation pane. This can be used to search for pages and headings.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>A layout independent mode has been introduced for hotkeys, which should work consistently across different keyboard layouts. This mode uses the virtual key code that's assigned to each physical key instead of the resulting character that's inputted when the combination is pressed.</li>\n<li>Drag and drop links will no longer create a Markdown link if the link title is identical to the URL.</li>\n<li>Improved behavior of <code>Ctrl/Cmd+Click</code> and <code>Alt+Enter</code> for links in the editor.</li>\n<li>Holding <code>Shift</code> while dropping text will drop it in plaintext mode, similar to <code>Ctrl/Cmd+Shift+V</code> to paste in plaintext mode.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Closing the vault or quitting the app within 2 seconds of editing a file will no longer lose the modifications done within that last 2 seconds.</li>\n<li>The bug where file explorer gains unusual whitespace has been caught and squashed.</li>\n<li>Fixed window size and developer tools were not properly saved when quitting app.</li>\n<li>Toggling highlight will no longer remove bold <code>**</code> signs.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Exposed <code>WorkspaceItem.getRoot()</code> which returns one of <code>Workspace.leftSplit</code>, <code>Workspace.rightSplit</code>, or <code>Workspace.rootSplit</code>. This can be used to distinguish whether a <code>WorkspaceLeaf</code> is in the center area or the sidebars.</li>\n<li>A new event has been added to <code>Workspace.on('quit', callback: (tasks: Tasks) =&gt; any)</code>. This takes a callback with a <code>Tasks</code> object. You can perform any cleanup tasks in here. For any async/promise-based cleanups, such as saving files, add your task to the execution queue using <code>Tasks.add(async () =&gt; { ... })</code> or <code>Tasks.addPromise(promise)</code> so that the app waits until your task is finished before quitting.</li>\n<li>The rendering lifecycle has been tweaked to allow plugins to add sub-components in the renderer post process step. Look for <code>MarkdownPostProcessorContext.addChild</code> for more details.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":16},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Pasting HTML content will now be automatically converted to Markdown. Same for drag and drop. For example, links you drag from web pages will now generate <code>[Display text](https://url)</code> instead of previously just the URL.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Search and replace now has a new default hotkey on macOS <code>Cmd+Option+F</code> to avoid clashing with the native hotkey for hide window.</li>\n<li>Creating new notes from the file explorer or using the hotkey now always open in edit mode.</li>\n<li>When setting up sync on a vault that's older than the synced remote vault, the older files will be ignored and overwritten to avoid a mass rollback.</li>\n<li>Navigation history has been slightly tweaked to be more intuitive, and also remembers scroll sync properly.</li>\n<li>On macOS, closing the last vault and re-activating Obsidian will now re-open the last vault instead of opening the vault switcher.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On macOS, quitting and restarting the app will properly restore the opened vaults.</li>\n<li>Translucency should now work again on app start on macOS.</li>\n<li>Drag and drop a file to open in a pane will now properly push the navigation history so going backwards feels more natural.</li>\n<li>Spellchecker will now split words that are adjacent to CJK characters.</li>\n<li>The &quot;explain search term&quot; button now works properly again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":10,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now select multiple files in file explorer using <code>Alt+Click</code>, or multiple consecutive files using <code>Shift+Click</code>.</li>\n<li>You can now reorder starred items.</li>\n<li>You can now <strong>drag files from</strong> various of places:\n<ul>\n<li>Drag a file (or multiple files) from the file explorer, just like before.</li>\n<li>Drag a file from a search result.</li>\n<li>Drag a file from a backlink, or an unlinked reference.</li>\n<li>Drag a file from the starred pane.</li>\n</ul>\n</li>\n<li>You can now <strong>drop files to</strong> various places:\n<ul>\n<li>Drop a file (or multiple files) onto a folder to move it there. You can even do this with files you picked up from anywhere, like a search result. It doesn't have to be from the file explorer.</li>\n<li>Drop a file to a pane's top header section to open the file in that pane.</li>\n<li>Drop a file directly into the editor to insert it as a link. The generated link also follows your preferences, such as relative paths, or using Markdown links.</li>\n<li>Drop a file in another application or in another Obsidian vault to generate an <code>obsidian://</code> link the same way it's generated as &quot;Copy obsidian url&quot;.</li>\n<li>Drop a file to the starred pane to star it.</li>\n</ul>\n</li>\n<li>You can now drag a supported file from your system explorer to a folder in Obsidian's file explorer to import a copy there.</li>\n<li>There is now a dialog with options for page size, landscape mode, and margin options for export to PDF.</li>\n<li>You can now choose the tab size in editor settings.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Quitting the app and restarting will now restore previously open vaults. This will also work on the &quot;relaunch&quot; button after an update has been downloaded.</li>\n<li>On macOS, Obsidian will no longer quit when all windows are closed.</li>\n<li>Pressing <code>Tab</code> will now insert spaces if <code>Use tab to indent</code> is turned off.</li>\n<li>Various visual improvements are added for dragging and dropping panes.</li>\n<li>The app window's title will now indicate the vault name.</li>\n<li>If you have too many ribbon icons, it can now be scrolled to access them all, instead of clipping out the last few icons.</li>\n<li>If the more options menu is too long, it can now be scrolled to access menu options that was previously off-screen.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Sometimes after opening multiple popup windows, all hotkeys stop working. That shouldn't happen anymore.</li>\n<li>With an open note in Obsidian that's been edited outside or by a plugin, sometimes the last newline character disappears. That should no longer happen.</li>\n<li>Fixed some edge cases where custom CSS causes IME positions to overlap the current line.</li>\n<li>Vault switcher should now have more space for certain languages that take more space than others.</li>\n<li>File names with multiple non-breaking spaces will now link properly.</li>\n<li>The about setting tab no longer populates twice when you click on &quot;Check for updates&quot; twice.</li>\n<li>The community plugins page no longer populates twice when you click on a plugin name twice.</li>\n<li>Creating new files will no longer fail if there exists a file called &quot;untitled.md&quot; in lowercase.</li>\n<li>Global search's input box will now expand to take the full width.</li>\n<li>Sync will no longer allow restoring the current version.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The workflow for augmenting CodeMirror has been improved:\n<ul>\n<li><code>Plugin.registerCodeMirror(callback)</code> has been introduced to help plugins hook to CodeMirror instances that are already loaded, and also created in the future. This function is just a helper for <code>Workspace.iterateCodeMirrors(callback)</code> then <code>Workspace.on('codemirror', callback)</code></li>\n<li><code>Workspace.iterateCodeMirrors(callback)</code> has been introduced to help plugins cleanup their CodeMirror events when the plugin unloads.</li>\n<li><code>App.on('codemirror', callback)</code> has been moved to <code>Workspace.on('codemirror', callback)</code>. The old method will be deprecated and will now proxy to the new one. There is no more event system on <code>App</code>.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":22,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":8},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed preview &quot;readable line width&quot; option.</li>\n<li>Fixed preview pane could not fold lists and headings.</li>\n<li>Fixed YAML front matter not shown even when option is turned on.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":21,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":12,"day":7},"info":"<h2>Shiny new things</h2>\n<ul>\n<li><a href=\"https://publish.obsidian.md/help/Obsidian+Sync\">Obsidian Sync</a> is now available and can now be purchased. It features:\n<ul>\n<li>End-to-end encryption.</li>\n<li>Selective sync.</li>\n<li>Version history.</li>\n</ul>\n</li>\n<li>You can now use the &quot;Move file to another folder&quot; command to move the current file without having to do a drag-n-drop in the file explorer.</li>\n<li>You can now Ctrl/Cmd hover in the file explorer to preview the contents of a file.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Graph view search filter now has a clear button.</li>\n<li>The file explorer will now automatically scroll when dragging files near the top or bottom edge.</li>\n<li>Tag suggestion will now match anywhere in the tag, instead of just from the beginning.</li>\n<li>You can now create internal links in Mermaid by specifying the class <code>internal-link</code> for the node. The app will use the contents of the node as the link. Example: <code>class A internal-link;</code></li>\n<li>Quick switcher aliases now show the actual file path as well.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Link auto-complete should no longer add an extra pair of <code>]]</code> when another link exists on the same line.</li>\n<li>Mermaid text should now finally be properly scaled.</li>\n<li>The notice &quot;Updated x links in y files&quot; now properly shows number of files instead of always showing <code>1</code>.</li>\n<li>Fixed some cases of blurry text caused by the lack of subpixel-antialiasing.</li>\n<li>Fixed <code>[[</code> auto-conversion from chinese characters <code>【【</code>.</li>\n<li>Typing should no longer lag when linked with another editor pane of the same file.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fuzzy search related functions <code>prepareQuery</code>, <code>fuzzySearch</code>, <code>renderMatches</code>, <code>renderResults</code>, <code>sortSearchResults</code>, are now available.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":20,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":12,"day":2},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Quick switcher now auto-completes for aliases as well.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Creating a new file from &quot;no file is open&quot; page now respects the default location option.</li>\n<li>Invalid front matter now shows up as an error in the metadata section of preview mode.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Deleting files and folders now properly remove them from the file explorer.</li>\n<li>Footnotes now work properly in exported PDF files.</li>\n<li>Fixed mermaid graphs don't scale properly when using a HiDPI/retina monitor, or when zooming the app.</li>\n<li>Link suggestion no longer suggests blocks for attachments like images or PDF files.</li>\n<li>Fixed pressing <code>Enter</code> to finish rename a file not working properly when using an IME.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>SuggestModal</code> and <code>FuzzySuggestModal</code> are now available for use.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":19,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":26},"info":"<h2>Improvements</h2>\n<ul>\n<li>Exporting to PDF now respects the &quot;show frontmatter&quot; option.</li>\n<li>Themes/Snippets now excludes dotfiles generated by MacOS.</li>\n<li>Custom CSS is now applied as soon as the app loads.</li>\n<li>Tags in front matter are now split by space if there was any.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed search and replace in edit mode.</li>\n<li>Open themes/snippets folder now works properly.</li>\n<li>Search, backlinks and unlinked mentions should no longer glitch out when collapsing all results.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":18,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":25},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now download multiple themes and switch between them. They are now stored in the <code>vault/.obsidian/themes</code> folder. Be sure to disable the legacy option for <code>obsidian.css</code> when you do so!</li>\n<li>You can now add multiple CSS snippets, and choose to enable/disable them individually. They are stored in the <code>vault/.obsidian/snippets</code> folder.</li>\n<li>You can now check for third-party plugin updates and selectively update them.</li>\n<li>In preview mode, there is now a new section displaying the metadata of a file based on its YAML front matter.</li>\n<li>You can now give notes specific CSS classes using the front matter option <code>cssclass</code>. You can also specify multiple ones with the same syntax as tags and aliases, for example, <code>cssclass: class1, class2</code>. Combine this with custom CSS to selectively style notes.</li>\n<li>You can now sort tags in alphabetical order instead of by frequency.</li>\n<li>You can now collapse the front matter section in edit mode.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The custom CSS plugin has been merged into the app, under the &quot;Appearance&quot; setting tab.</li>\n<li>In preview mode, if the front matter fails to parse as YAML, an error message will be displayed in the code block if you had show front matter option enabled.</li>\n<li>Link suggestion will now suggest aliases of a file after you type <code>|</code>.</li>\n<li>Link suggestion no longer shows YAML front matter as a block to refer to.</li>\n<li>When renaming a file, Markdown links will now also change the display text if it matches the file name.</li>\n<li>File explorer has been improved to lag less on big vaults.</li>\n<li>Backlinks and unlinked mentions have been improved to lag less when there are many results.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Highlights are now properly exported to PDF.</li>\n<li>After renaming a file, automatically updated Markdown links will now properly contain the <code>.md</code> extension.</li>\n<li>Choosing a spellcheck suggestion will no longer wipe adjacent characters.</li>\n<li>Creating or renaming a file now properly calculates backlinks to it.</li>\n<li>Embed images now shows up properly in block suggestions.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>moment.js</code> has been replaced with <code>moment-with-locales.js</code>.</li>\n<li>CodeMirror has been updated to v5.58.3.</li>\n<li>A new event <code>layout-change</code> is has been added to <code>Workspace</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":17,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":11,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Obsidian now has a native build for Apple M1 (Apple Silicon).</li>\n<li>There's now a build for 32bit Windows and arm64 Windows.</li>\n<li>There's also a build for Linux arm64.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Tags in front matter no longer requires the <code>#</code> character. You can now write <code>tags: [tag1, tag2, tag3]</code>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed unable to type in edit mode after inserting a template or opening command palette or quick switcher.</li>\n<li>Star/unstar file in more options menu has been added back.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":16,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now specify <code>aliases</code> in front matter. These will then show up in the <code>[[</code> link suggestion, and auto-complete to <code>[[Filename|alias]]</code>. They will also be picked up in unlinked mentions. For example: <code>aliases: [AI, Artificial Intelligence]</code>. Add double quotes around your alias if it contains special characters.</li>\n<li>You can now specify <code>tags</code> in front matter. These will then show up in the tag pane, as well as in search queries using the <code>tag:</code> operator.  For example: <code>tags: [&quot;#pkm&quot;, &quot;#hype&quot;]</code>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Command palette and Quick switcher will now restore your cursor or selection when exiting.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Graph filter tag operators no longer operate on links to non-existent files.</li>\n<li>The duplicate menu item &quot;Copy obsidian url&quot; has been removed from the more options menu.</li>\n<li>On Windows, you should now be able to drag the window from the top when it's maximized.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li><code>frontmatter</code> is now available in <code>CachedMetadata</code>.</li>\n<li>Some helper functions for front matter parsing are made available: <code>parseFrontMatterEntry</code>, <code>parseFrontMatterStringArray</code>, <code>parseFrontMatterAliases</code> and <code>parseFrontMatterTags</code>.</li>\n<li>The css class <code>mod-root</code> is now always added to the workspace center area.</li>\n<li>Deprecations: (the old name will remain in code for backward compatibility for a while)\n<ul>\n<li><code>Setting.addExtraSetting</code> has been renamed to <code>addExtraButton</code>.</li>\n<li><code>Workspace.getActiveLeafOfViewType</code> has been renamed to <code>getActiveViewOfType</code>.</li>\n</ul>\n</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":11,"day":17},"info":"<h2>Improvements</h2>\n<ul>\n<li>The updater has been improved to properly use system proxy settings when fetching downloads. (Requires installer update)</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fix popups from IMEs for east Asian languages such as Chinese and Japanese not properly positioned for heading with larger font than body text.</li>\n<li>Fixed search not working for double-quote full word match that includes punctuation characters.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":13},"info":"<h2>Improvements</h2>\n<ul>\n<li>A mechanism has been added to deprecate specific versions of third-party plugins known to cause data loss. A notification will be shown to indicate that such a plugin has been disabled.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed right click menu in edit mode.</li>\n<li>Fixed negative path filters in graph search causes tags to be removed.</li>\n<li>Mermaid Gantt charts are now properly sized according to the view size.</li>\n<li>Search results can be scrolled again.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":12},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now right click on search results, backlinks and unlinked mentions to show a file menu for some shortcuts.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>A new option has been added for changing the default mode (edit vs preview) when opening new notes.</li>\n<li>Graph filter query has been tweaked to prevent <code>path:</code> and <code>file:</code> filters from removing tags.</li>\n<li>Search queries with double quotes now properly performs full word search if your query starts or ends in a punctuation character.</li>\n<li>Allow mermaid internal links using the <code>/Note</code> internal link format.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Clicking now properly hides context menus, which previously were sometimes left on the page if clicking on editable text.</li>\n<li>Fold all/unfold all now properly updates the fold indicator.</li>\n<li>Graph hover preview is now back.</li>\n<li>Ctrl-click on internal links should now work on MacOS.</li>\n<li>Popups from IMEs for east Asian languages such as Chinese and Japanese should no longer obscure the line you're typing on.</li>\n<li>Internal links now render properly in footnotes.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":9,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":11,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now right click internal links to see many file options, such as opening in new pane, revealing in file navigation, open with default app, etc.</li>\n<li>Global search will now show recent search queries when the search is empty.</li>\n<li>Global search now has an &quot;x&quot; to clear the search query.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Global search and backlinks pane now save your options for collapse results, show more context and sort order. Global search also saves match case and explain search term.</li>\n<li>Backlinks pane also saves the folding of the <code>Linked mentions</code> and <code>Unlinked mentions</code> sections.</li>\n<li>Several new API are now available for plugins to use.</li>\n<li>Plugin authors can now mark a required version of Obsidian for their releases. They can also provide a list of older versions of their plugin that's compatible to older versions of Obsidian.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed fold all previously did not work in preview mode.</li>\n<li>There was a race condition for saving large files on slower computers which could prevent saving the last few characters typed into the note. That should no longer happen.</li>\n<li>Checklist styles have been fixed, they should no longer have an awkward offset from the left side.</li>\n<li>Hover previews now properly renders embeds.</li>\n<li>Indenting from a numbered list to an unordered list no longer causes <code>undefined</code> to appear.</li>\n<li>Printing to PDF no longer generates clickable <code>app://obsidian.md</code> links for internal links.</li>\n</ul>\n","major_release":false}]