[{"version":{"major":1,"minor":1,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":1,"day":10},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed bug where arrow keys would move cards when editor was focused.</li>\n<li>Canvas: fixed bug where card position was not properly saved after moving a card via arrow keys.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":1,"day":10},"info":"<h2>Improvements</h2>\n<ul>\n<li>Deleting a file now closes its tab if there are other tabs in the tab group.</li>\n<li>Obsidian Sync's settings page will now warn you if your vault is in Dropbox, iCloud, or OneDrive. Using multiple sync providers can lead to data conflicts.</li>\n<li>Canvas: Added new &quot;Narrow to block...&quot; menu option. This works the same way as &quot;Narrow to heading&quot; but offers finer grained narrowing options.</li>\n<li>Canvas: New &quot;Jump to group&quot; command allows quickly jumping to a group by name.</li>\n<li>Canvas: You can now nudge selected cards with the arrow keys. Use <code>Shift</code> to move the cards at a greater multiple.</li>\n<li>Canvas: Added a new Canvas settings tab for configuring Canvas preferences for your entire vault. The currently available settings include:\n<ul>\n<li>Use scroll wheel zoom instead of pan</li>\n<li>Options to hide the card labels</li>\n<li>Global setting for &quot;snap to grid&quot; and &quot;snap to objects&quot;</li>\n<li>Configurable zoom threshold for when cards switch from showing their content to just showing the card title</li>\n<li>Configurable behavior of <code>Ctrl/Command + Drag</code></li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug where embeds and code blocks in Live Preview were not properly unloaded when switching files.</li>\n<li>Fixed bug where large images were not properly scaled in the hover preview popups.</li>\n<li>Canvas: Headings are always visible in narrowed cards regardless of &quot;Show inline titles&quot; preference.</li>\n<li>Fixed context menu position when using &quot;Show context menu under cursor&quot; command while &quot;native menus&quot; is enabled.</li>\n<li>Fixed Markdown tags with underscore not displaying correctly in Live Preview.</li>\n<li>Fixed indented images not rendering properly indented.</li>\n<li>Canvas: Fixed nodes not always loading cards on their correct layers.</li>\n<li>Canvas: Fixed linux middle click.</li>\n<li>Canvas: Fixed bug where dragging cloned nodes were not properly snapping to objects.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fixed <code>Menu.showAtPosition</code> not working when user has enabled &quot;native menus.&quot;</li>\n<li>Fixed processFrontMatter passing null when frontmatter section is empty, fixed not working with CRLF line endings.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":12,"day":23},"info":"<p>The installer has been updated to use Electron v21 (requires downloading <a href=\"https://obsidian.md\">the latest installer</a>).</p>\n<h2>No longer broken</h2>\n<ul>\n<li>The page preview popover no longer shows file names twice.</li>\n<li>Canvas: Fixed &quot;reload page&quot; menu item not working consistently.</li>\n<li>File recovery now supports canvas files.</li>\n<li>Prevent <code>obsidian://new</code> URIs from creating folders outside of the vault.</li>\n<li>Prevent external websites embedded in canvas and plugins from opening URI links.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: YouTube embeds are now shown at 16:9 instead of square.</li>\n<li>Canvas: Added a &quot;privacy&quot; toggle to the export modal. This will allow you to share the canvas while masking all the text on the cards.</li>\n<li>Canvas: Added a command to export your canvas as an image.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: Auto-resizing file cards now works more reliably.</li>\n<li>Canvas: Fixed bug where pressing undo (<code>Ctrl/Cmd + Z</code>) would undo the file rename in addition to undoing an action on the Canvas.</li>\n<li>Canvas: Fixed issue where creating a new text card does not always zoom in to edit automatically.</li>\n<li>Canvas: Fixed crash when opening a modal while an iframe was focused.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: Added new alignment options to justify content horizontally or vertically.</li>\n<li>Canvas: the drag handles has been removed from connection lines. Now you can drag from anywhere on the line to move it.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed extra spacing being added to the top of cards.</li>\n<li>Fixed duplicate titles appearing for embedded notes (i.e. <code>![[some note]]</code>).</li>\n<li>Fixed hotkeys acting inconsistently across pop-out windows when a modal was visible.</li>\n<li>Canvas: fixed group label getting truncated while editing.</li>\n<li>Canvas: fixed bug where the file title would stay selected after updating the title. This caused some unexpected behavior when pressing undo (<code>Ctrl/Cmd + Z</code>) or paste (<code>Ctrl/Cmd + V</code>).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":16},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: Inline titles now render in file cards when enabled.</li>\n<li>Canvas: Replaced the &quot;Copy screenshot&quot; canvas menu item with a new &quot;export as image&quot; menu option. This will allow you to export either the current viewport or a full high resolution PNG of your canvas.</li>\n<li>Canvas: Embedded canvases now show the connection lines in addition to the card boxes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Renaming a file will no longer cause the current scroll position to be lost.</li>\n<li>Canvas: File-specific options have been removed file card's context menu if the card is narrowed to a specific heading.</li>\n<li>Canvas: Dragging a nested group will no longer try to snap to itself. This was causing some jittering.</li>\n<li>Canvas: fixed &quot;Replace&quot; command not working in canvas file cards.</li>\n<li>Canvas: Fixed an issue where following links from the canvas would prevent editor-specific hotkeys from firing.</li>\n<li>Canvas: Fixed loading a website in a pop-out window causes Obsidian to crash on boot.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":14},"info":"<h2>Improvements</h2>\n<ul>\n<li>Embedded canvases now render a diagram of the underlying canvas. This works for canvases embedded within Markdown files (i.e. <code>![[daily_notes.canvas]]</code>) or embedded on another canvas.</li>\n<li>Canvas: Add new options to distribute vertically/horizontally, stack vertically/horizontally, and auto-organize cards into grid.</li>\n<li>Canvas: The Find/replace menu (<code>Ctrl/Cmd+F</code>) now works inside cards embedded in the canvas.</li>\n<li>Canvas: Web pages now has a menu to open in the browser, you can also <code>Ctrl/Cmd</code>-click the card label.</li>\n<li>Canvas: Slight performance improvements when interacting with larger canvases.</li>\n<li>Canvas: Added &quot;Go to source&quot; and &quot;Go to target&quot; menu items on the connection context menu to quickly jump to nodes.</li>\n<li>Canvas: <code>Ctrl/Cmd</code> + Drag now shows a menu to quickly add a card or create a group where your selection is.</li>\n<li>Canvas: Images, websites, videos, and audio will now always render instead of becoming a grey box when zoomed out.</li>\n<li>Sync: When merging during a sync conflict, the original local version is now stored in File Recovery (if enabled).</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug preventing hotkeys from being set if there is no default hotkey.</li>\n<li>Canvas: Links and embeds inside text cards will now properly get updated when the target files are renamed.</li>\n<li>Canvas: Fixed duplicating groups not copying their children cards.</li>\n<li>Canvas: Fixed bug where opening a new canvas in a hidden tab would occasionally go blank and crash.</li>\n<li>Canvas: Fixed bug causing some websites to crash when moving a canvas view to a popout window.</li>\n<li>Canvas: Fixed issue where websites could not be interacted with in a popout window.</li>\n<li>Canvas: PDFs should be slightly less blurry.</li>\n<li>Canvas: Fixed bug where cards are unable to resize when an adjacent card is touching.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":12},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Canvas: Added &quot;Groups&quot; to canvas. Groups can be thought of as placemats for your cards. They always render below cards and dragging the group label will move all notes in the group at once. To create a group, select multiple cards then right-click and choose 'Create group.'</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Canvas: Improved performance when interacting with large canvases.</li>\n<li>Canvas: On Windows and Linux, you now hold <code>Ctrl</code> to duplicate the selection instead of <code>Alt</code>. On macOS, this is still <code>Option+Drag</code>.</li>\n<li>Canvas: Added right-click and drag to pan around the viewport.</li>\n<li>Canvas: Added 'copy screenshot' menu item.</li>\n<li>Canvas: Added 'reset zoom' button.</li>\n<li>Canvas: Double-clicking the bottom of a card now auto expands it to the size of the contents.</li>\n<li>Canvas: The canvas will always zoom to fit on open.</li>\n<li>Canvas: PDFs and iframes that have been interacted with will stay loaded even when zoomed out.</li>\n<li>Canvas: text cards now have dynamic padding so they shouldn't appear with scrollbars on small sizes.</li>\n<li>Canvas: Web pages now have a label with the site title.</li>\n<li>Canvas: Right-clicking on web pages now gives the option to copy the URL or reload the page.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: The connection menu will exclude embeds.</li>\n<li>Canvas: Fixed issue where deleted cards and connections would sometimes reappear and be un-selectable.</li>\n<li>Adding a hotkey to a default hotkey no longer results in the default hotkey being removed.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Canvas files are now multi-line formatted when saved. This should make the diffs more human-readable when stored in version control.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":9},"info":"<h2>Improvements</h2>\n<ul>\n<li>Live Preview has been tweaked to avoid flashes of &quot;unstyled&quot; content while scrolling through larger documents.</li>\n<li>Canvas: We have updated how colors work inside of Canvas. The six colors in the color palette are now themeable. There is a new 7th slot with a color picker.</li>\n<li>Canvas: Added a new menu item to paste in a web URL. Right clicking on an existing web page in Canvas now shows an option to change the URL.</li>\n<li>Canvas: YouTube links will now automatically get inserted as Youtube's embed version.</li>\n<li>Canvas: There's a new 'help' button to view all the currently hotkeys available for Canvas.</li>\n<li>Canvas: Dragging a connection line from a file card now shows a menu with all outgoing links to quickly add them as connections.</li>\n<li>Canvas: Added a new 'Narrow...' menu option to file cards. This will narrow the card contents to only the selected heading.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The frontmatter YAML will now always be hidden in reading mode. The &quot;Show frontmatter&quot; toggle now toggles the metadata section.</li>\n<li>macOS: Fixed bug in Canvas where cards would drag when ctrl-clicking.</li>\n<li>Fixed issue when using multiple cursors where an extra cursor would appear in the top right.</li>\n<li>.canvas files now show in the editor link suggest.</li>\n<li>Linux: middle-clicking on the canvas will no longer trigger 'paste.'</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added a notice when opening a Canvas that fails to parse.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":8},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed bug where text nodes don't always save their content.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":8},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: 'delete' has been renamed to 'remove' to avoid confusion.</li>\n<li>Canvas: cards can now be dragged by the filename label.</li>\n<li>Canvas: <code>Ctrl/Command</code>-clicking on a filename label will open that file in a new tab.</li>\n<li>Other plugin views should now properly respond to selecting a card in the Canvas. This includes the Outline pane, the Backlinks pane, etc.</li>\n<li>Templates core plugin properly inserts into the canvas editor.</li>\n<li>The viewport will now pan while dragging nodes close to the edge of the screen.</li>\n<li>Pressing <code>Shift-enter</code> inside the file select modal in canvas will now create a file based on your current input (same as the quick switcher behavior).</li>\n<li>Improved appearance of file name modal when using &quot;Convert to file...&quot; Canvas action.</li>\n<li>Increased the max zoom distance in Canvas.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Sync: canvas files will now sync between devices (oops!)</li>\n<li>Canvas: fixed bug causing editor to occasionally lose track of inserted text and cursor position when typing quickly.</li>\n<li>Canvas: connections cannot be drawn from a card back to itself.</li>\n<li>Canvas: fixed issue where shift-clicking on a card would cause the editor to appear in an unfocused card.</li>\n<li>Canvas: fixed text suggest menu not closing when clicking outside of a card.</li>\n<li>Canvas: Fixed dragging links from cards into their own cards.</li>\n<li>Canvas: Fixed dragging links from the embedded canvas editor.</li>\n<li>File explorer: added back missing 'Open in new window' command to the context menu.</li>\n</ul>\n<h2>Developers</h2>\n<p><em>See v1.1.1 in the <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/CHANGELOG.md#v111-2022-12-8--insider-build\">Developer CHANGELOG</a></em>.</p>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":5},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Introducing the <strong>Canvas</strong> core plugin. You can now lay your notes out in an infinite, spatial canvas.</li>\n</ul>\n<img alt=\"canvas-promo\" src=\"https://user-images.githubusercontent.com/693981/205718501-d9fe405b-6684-41c8-a3b3-eb5da73777d2.png\">\n<h2>Improvements</h2>\n<ul>\n<li>Ribbon items can now be rearranged (drag &amp; drop) or hidden (right click on the ribbon for options). Configuration is also available in Settings (<strong>Appearance → <em>Ribbon menu</em></strong>). Note: if you are using an existing plugin to manage the ribbon, this might interfere.</li>\n<li>Plugins can now be sorted by &quot;Recently updated.&quot;</li>\n<li>Added theme version information to the debug modal.</li>\n<li>Added &quot;Close window&quot; command (<code>Ctrl/Command + Shift + W</code>).</li>\n<li>Pressing <code>Shift + Enter</code> in the editor Find Dialog will find the previous instance.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Linux: fixed middle-click to paste.</li>\n<li>'Split' commands will now focus the newly created tab group.</li>\n<li>Fixed issue where File explorer would not always select the right items when using shift-clicking.</li>\n<li>Popout windows will now open with the same zoom level as the main window</li>\n<li>Fixed <code>Home</code> behavior in task lists.</li>\n<li>Moving folders to the Obsidian trash (<code>.trash</code>) will no longer add a trailing <code>.</code></li>\n<li>Fix ordered lists showing as bullets.</li>\n<li>Plugin gallery will no longer cache the results if there's no internet connection.</li>\n<li>macOS: fixed issue with spell check replacing the wrong word on the same line.</li>\n<li>Improved styling of text when the accent color is lighter than a certain threshold.</li>\n<li>Fixed &quot;Fold more&quot; and &quot;Fold less&quot; commands not working properly on list items.</li>\n<li>The File explorer will no longer capture arrow key events when modifier keys are used. This was breaking hotkeys such as <code>Ctrl + Shift + →</code>.</li>\n<li>Fixed issue with folds in Reading mode getting unfolded when creating a new tab.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>We have added a <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/CHANGELOG.md\">Developer CHANGELOG</a> to our API repo. Moving forward, we will keep developer-facing changes cataloged here.</li>\n<li>Canvas uses a new JSON-based file format, <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/canvas.d.ts\">see the spec</a>.</li>\n<li>Added new metadata APIs.</li>\n<li>Added macOS calendar entitlements.</li>\n<li>Added support for <code>fundingUrl</code> in the plugin manifest. The donation URL will be shown in the plugin gallery entry.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":1,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":10,"day":26},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.0.</li>\n<li>Ongoing UI overhaul with an emphasis on making the app more responsive and mobile-friendly.</li>\n<li>Phone-only: New bottom navigation bar includes forward/back arrows, tab menu, and quick access to your ribbon items.</li>\n<li>Phone-only: The left ribbon bar has been removed from the left sidebar. It is now accessible as a menu in the navigation bar. Tap to activate your most recent action. Tap and hold to see a list of all ribbon items.</li>\n<li>Tabs can now be used on both tablets and phones. On phones, tabs can be accessed with the button on the navigation bar.</li>\n<li>Phone-only: Added haptic feedback for the context menu and pull-down menu.</li>\n<li>Tablet-only: Some interface elements like menus and popups will now use the desktop version since there's sufficient space on tablets.</li>\n<li>Long-press links in Live Preview to show context menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":26},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed vim mode <code>gj</code> on the last line jumps up.</li>\n<li>Fixed numbered lists in unordered lists not rendering the number.</li>\n<li>Fixed long lines in sub-bullets adds jumping padding.</li>\n<li>Fixed some rendering issues with translucency.</li>\n<li>Fixed artifacts in tabs on Linux.</li>\n<li>Removed Github fallback CDN which is no longer in operation.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Linux: fixed bug causing Obsidian to not boot.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>macOS: Double-clicking the tab bar now maximizes the window in frameless mode.</li>\n<li>Linux: &quot;Adapt to system theme&quot; now works properly.</li>\n<li>The keyboard shortcut for rectangular selection has changed. Now alt-click will add multiple cursors while alt-shift-drag will create a rectangular selection.</li>\n<li>Theme dropdown properly refreshes when changing the theme in settings.</li>\n<li>Update buttons properly refresh after updating the plugin via the plugin modal.</li>\n<li>Removed duplicate drag element that appeared when dragging tabs.</li>\n<li>Fixed checkboxes not being selectable in Live Preview.</li>\n<li>Fixed selections from multiple cursors not appearing.</li>\n<li>Fixed bug where the wrong file could get renamed if you switch files mid-rename.</li>\n<li>Vim: Fixed <code>gj</code> and <code>gk</code> not working.</li>\n<li>Fixed empty lists getting collapsed in reading mode.</li>\n<li>macOS: spellcheck now properly replaces word even when no text is selected.</li>\n<li>The root folder in the File Explorer is no longer collapsible via the keyboard.</li>\n<li>Editor commands no longer trigger if the inline title is focused.</li>\n<li>Fixed alt-clicking multiple selections not behaving correctly.</li>\n<li>Fixed opening vaults via <code>obsidian://vault</code> not properly marking other vaults as closed.</li>\n<li><code>webm</code> embeds are now properly recognized as video instead of audio.</li>\n<li>Fixed long suggestion titles not wrapping properly.</li>\n<li>Added missing search icon to graph view.</li>\n<li>Unique note creator: app no longer freezes when attempting to generate an invalid format.</li>\n<li>Graph View: dragging a node is now canceled when you start panning the canvas.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Clicking on gutter elements now properly fires click events.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":0,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":10,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Misc. visual improvements for settings.</li>\n<li>Larger font sizes and better contrast for sidebar items.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Mobile drawers can no longer be pinned on mobile.</li>\n<li>iOS: fixed issue where app would freeze when clicking backlinks.</li>\n<li>Tablet: The toggle button for the left sidebar is now visible again.</li>\n<li>iOS: fixed bug preventing cursor from selecting links in Live Preview.</li>\n<li>Fixed &quot;Edit link&quot; context menu item not selecting text.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":10,"day":13},"info":"<h2>Before you dive in</h2>\n<p>We've made some big changes both visually and under the hood for this release. If you rely on any third party plugins or themes, we highly encourage you to <strong>check for updates</strong> <em>before</em> delving into Obsidian 1.0.</p>\n<ul>\n<li><strong>Settings → Appearance → <em>Check for Updates</em></strong>.</li>\n<li><strong>Settings → Community plugins → <em>Check for Updates</em></strong>.</li>\n</ul>\n<p>This update includes significant changes to the look and feel of Obsidian. Some of the highlights include:</p>\n<ul>\n<li><a href=\"#tabs\">Tabs</a> – The workspace now supports tabs. To accommodate tabs, we've made a lot of tweaks to Obsidian behaviors.</li>\n<li><a href=\"#tab-stacks\">Tab stacks</a> – an alternative way to view your tabs, reminiscent of <a href=\"https://notes.andymatuschak.org/\">Andy Matuschak's website</a>.</li>\n<li><a href=\"#new-appearance-settings\">New appearance settings</a> – Obsidian has gone through an extensive redesign process to make the interface more robust, accessible, and easier to tinker with.</li>\n<li><a href=\"#additional-improvements\">Tons of other misc. improvements</a> – New 'fold' commands, an overhauled Theme Gallery, and bug fixes galore!</li>\n</ul>\n<p>Make sure to take a look at the <a href=\"#faq\">FAQ section</a> which should address some common points of confusion as you adapt to the new Obsidian.</p>\n<h2>Tabs</h2>\n<p>With this update, we have embraced <strong>tabs</strong> throughout the UI. We've found that tabs provide a more intuitive experience for both browsing and editing notes in your vault.</p>\n<p>Tabs have had us rethinking some of the most basic interactions with Obsidian. We have taken this opportunity to consolidate the hotkeys for opening files. Combine these modifier keys when clicking on any link in Obsidian (this includes the quick switcher!) or use them with <kbd>Enter</kdb> to navigate the link under the cursor.</p>\n<table>\n<thead>\n<tr>\n<th>Action</th>\n<th>MacOS</th>\n<th>Windows/Linux</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Navigate</strong></td>\n<td><em>None</em></td>\n<td><em>None</em></td>\n</tr>\n<tr>\n<td><strong>New Tab</strong></td>\n<td><kbd>⌘</kbd> (+ <kbd>Shift</kbd> in Source Mode)</td>\n<td><kbd>Ctrl</kbd> (+ <kbd>Shift</kbd> in Source Mode)</td>\n</tr>\n<tr>\n<td><strong>New Tab Group</strong></td>\n<td><kbd>⌘</kbd><kbd>⌥</kbd></td>\n<td><kbd>Ctrl</kbd><kbd>Alt</kbd></td>\n</tr>\n<tr>\n<td><strong>New Window</strong></td>\n<td><kbd>⌘</kbd><kbd>⌥</kbd><kbd>Shift</kbd></td>\n<td><kbd>Ctrl</kbd><kbd>Alt</kbd><kbd>Shift</kbd></td>\n</tr>\n</tbody>\n</table>\n<p>Tabs have also inspired some changes to how users browse their vaults. It felt only natural that we also introduce <strong>per-tab history</strong>. Each tab now maintains its own history for navigation.</p>\n<p><img src=\"https://user-images.githubusercontent.com/693981/191052493-8109f1a1-411c-4b61-b435-788d0cac3231.png\" alt=\"per-tab history\"></p>\n<h2>Tab stacks</h2>\n<p>You can now switch any tab group in your workspace into a <em>tab stack</em>. Tab stacks provide an alternative way to view your tabs, reminiscent of Andy's Mode.</p>\n<p><img src=\"https://user-images.githubusercontent.com/693981/188205363-0f24b2a5-3706-4a8c-b38b-7a66baa68ce6.gif\" alt=\"tab-stacks\"></p>\n<p><em>Tab stacks</em> are, at their heart, the same as a tab group. Try mixing and matching with a tab group on one side and a tab stack on the other.</p>\n<h2>New appearance settings</h2>\n<p>We've introduced quite a few new settings at <strong>Settings → Appearance</strong>.</p>\n<table>\n<thead>\n<tr>\n<th>Setting</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Show inline title</strong></td>\n<td>Notes now display the full note title inline with the note contents as an <em>Inline Title</em>. You can disable this in settings</td>\n</tr>\n<tr>\n<td><strong>Show tab title bar</strong></td>\n<td>Show or hide the title bar at the top of very tab.</td>\n</tr>\n<tr>\n<td><strong>Window frame style</strong></td>\n<td>By default, the UI is now in <em>Frameless</em> mode. The window title is hidden. In settings, you can choose between the new frameless mode, the custom Obsidian frame (old default), and using the native OS window frame.</td>\n</tr>\n<tr>\n<td><strong>Accent color</strong></td>\n<td>There's now an &quot;accent color&quot; color-picker to give your vault its own unique style. Theme support may vary.</td>\n</tr>\n<tr>\n<td><strong>Zoom level</strong></td>\n<td>Controls the overall zoom level of the app.</td>\n</tr>\n<tr>\n<td><strong>Native menus</strong></td>\n<td>Menus will be rendered to match the context menus provided by the operating system. Enabled by default on MacOS.</td>\n</tr>\n</tbody>\n</table>\n<h2>Additional improvements</h2>\n<ul>\n<li>The Theme Gallery has gotten a major overhaul. Themes now support versioning just like plugins. Note: Themes that are not compatible with 1.0 have been marked as &quot;legacy&quot; and cannot be installed until they get updated.</li>\n<li>Added &quot;collapse all&quot; button to file explorer and tag view.</li>\n<li>Added &quot;Fold more&quot; and &quot;Fold less&quot; commands for folding lines under the cursor.</li>\n<li>Added &quot;Change theme&quot; command for quickly switching between themes.</li>\n<li>Auto-generated links to headings now keep more punctuation characters for better contexts.</li>\n<li>Added &quot;Find &amp; Replace,&quot; Export PDF, Share, and text formatting items to macOS app menu.</li>\n<li>Added <code>Shift + Up/Down</code> hotkeys to expand search results while a search item is focused.</li>\n<li>Renamed &quot;Split vertically&quot; and &quot;Split horizontally&quot; to &quot;Split right&quot; and &quot;Split down&quot; to avoid ambiguity.</li>\n<li>Pressing <code>Home</code> will now move the cursor to the beginning of a list item.</li>\n<li>Obsidian Sync: The history view has a toggle to choose between seeing the version of a file at a point in time or seeing the diff.</li>\n<li>Release notes will now automatically show after Obsidian updates.</li>\n<li>Improved community theme/plugin README.md relative images, added support for videos.</li>\n<li>Renamed &quot;active file&quot; to &quot;current file&quot; in several commands for better consistency.</li>\n<li>Improved the overall appearance of the app when &quot;translucent window&quot; is enabled.</li>\n<li>Soft-wrapping of lines should now better avoid misaligned indents.</li>\n<li>Added an option to Export to PDF to show the name of the note at the beginning of the document.</li>\n<li>Publish: &quot;new&quot; and &quot;unchanged&quot; sections are now collapsed by default.</li>\n<li>Fixed bug with search results containing &quot;path:&quot; sometimes showing duplicate text.</li>\n<li>Fixed multi-line embedded queries not working.</li>\n<li>Fix memory leak with loading native system fonts.</li>\n<li>Fixed crash when file explorer is missing a sort order.</li>\n<li><code>Ctrl/Cmd+W</code> can now close the vault switcher and help window.</li>\n<li>File explorer keyboard navigation properly ignores hidden files.</li>\n<li>Clicking to edit Live Preview widgets (e.g. tables or callouts) will now scroll the view to the beginning of the widget.</li>\n<li>Word count now works for any text file that can be opened, not just <code>md</code> files.</li>\n<li>macOS: &quot;obsidian&quot; will now be capitalized in the App menu.</li>\n<li>macOS: commands will no longer refer to Finder as &quot;System Explorer.&quot;</li>\n<li>macOS: right-clicking on top of the cursor will no longer cause the word under the cursor to be selected.</li>\n<li>Added <code>show-theme</code> action to the Obsidian URI. It will open the given theme in the Community theme gallery. For example: <a href=\"obsidian://show-theme?name=Minimal\">obsidian://show-theme?name=Minimal</a></li>\n</ul>\n<h2>For Developers</h2>\n<ul>\n<li>Workspace information is no longer saved to the <code>.obsidian/workspace</code> file. It is now saved to <code>workspace.json</code>.</li>\n<li>Added standard color picker component.</li>\n<li>Added <code>has-active-menu</code> class to file explorer item that received the right-click.</li>\n<li>Added <code>list-bullet</code> class to HTML markup for unordered list items.</li>\n<li>Theme developers: we have published <a href=\"https://forum.obsidian.md/t/0-16-0-theme-migration-guide/42537\">a guide for helping get your theme ready for 1.0</a>.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Q.</strong> Why am I seeing the title of my note duplicated at the top of my note?</p>\n<blockquote>\n<p>We now display the filename as an <strong>Inline Title</strong> to allow filenames to feel more attached to the note. If you already have the heading of your note matching the filename, you might notice some redundancy. You can disable this feature via <strong>Appearance → <em>Show inline title</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why does everything look so big/small?</p>\n<blockquote>\n<p>The new update has made some changes to make Obsidian feel more native to your operating system. To adjust the overall scale of the UI, you can configure the <strong>UI Zoom</strong> level in Settings at <strong>Appearance → Advanced → <em>Zoom level</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> How do I open notes side-by-side now?</p>\n<blockquote>\n<p>The behavior of <code>Cmd/Ctrl + Enter</code> and <code>Cmd/Ctrl + Click</code> have changed to opening links in a new tab. To open links in a new pane to the right, you can use <code>Cmd/Ctrl + Alt + Enter</code> or <code>Cmd/Ctrl + Alt + Click</code>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why can't I toggle checkboxes with <kbd>Ctrl</kbd><kbd>Enter</kbd> (or <kbd>⌘</kbd><kbd>Enter</kbd> on MacOS) anymore?</p>\n<blockquote>\n<p>The default hotkey for &quot;Toggle checkbox status&quot; has been changed to <kbd>Ctrl</kbd><kbd>L</kbd> (or <kbd>⌘</kbd><kbd>L</kbd> on MacOS). <kbd>Ctrl</kbd><kbd>Enter</kbd> is now the default hotkey for opening links under the cursor in a new tab. You can change these hotkeys in settings.</p>\n</blockquote>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":6},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed lag when switching tabs on larger files.</li>\n<li>Fixed not being able to scroll within plugin details page.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":3},"info":"<h2>No longer broken</h2>\n<ul>\n<li>&quot;Save File&quot; command now works with all text files, not just Markdown files.</li>\n<li>Fixed styling of nested block quotes in live preview.</li>\n<li>Fixed scroll getting reset when rearranging tabs.</li>\n<li>Fixed bug where inline document backlinks would sometimes render with a long scrollbar.</li>\n<li>Live Preview: Fixed bare emails not showing as links when appearing the middle of a line.</li>\n<li>Mermaid: improved rendering.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":9,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Introducing <strong>per-tab history</strong>. Each tab now maintains its own history stack for navigation.</li>\n</ul>\n<p><img src=\"https://user-images.githubusercontent.com/693981/191052493-8109f1a1-411c-4b61-b435-788d0cac3231.png\" alt=\"per-tab history\"></p>\n<p>A huge thank you to <code>@pjeby</code> for Pane Relief and for all his help with testing the new per-tab history!</p>\n<h2>Improvements</h2>\n<ul>\n<li>&quot;Show tab title bar&quot; is now enabled by default. The tab title bar now also includes forward/backward navigation arrows as well as the full file path.</li>\n<li>Soft-wrapping of lines should now better avoid misaligned indents.</li>\n<li>Sliding Panes plugin will now automatically be disabled on startup.</li>\n<li>Added an option to Export to PDF to show the name of the note at the beginning of the document.</li>\n<li>Improved sidebar collapse/expand animation.</li>\n<li>Publish: &quot;new&quot; and &quot;unchanged&quot; sections are now collapsed by default.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Legacy themes are no longer deleted when updating to 0.16 compatible themes. This should improve compatibility when syncing to a device that's not yet 0.16 compatible.</li>\n<li>Fixed pasting into inline titles inside pop-out windows.</li>\n<li>Fixed selecting text inside the Release Notes callouts.</li>\n<li>Pressing 'escape' will no longer cause the editor to lose focus.</li>\n<li>macOS: Command-ArrowLeft will now take you to the beginning of the current list item.</li>\n<li>macOS: Fixed &quot;Show context menu&quot; command not working with spelling corrections.</li>\n<li>Publish: fixed &quot;use live version&quot; not working with locally deleted files.</li>\n<li>Translucency is now disabled in fullscreen mode.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":9,"day":2},"info":"<h2>Shiny new things</h2>\n<p><img src=\"https://user-images.githubusercontent.com/693981/188205363-0f24b2a5-3706-4a8c-b38b-7a66baa68ce6.gif\" alt=\"tab-stacks\"></p>\n<ul>\n<li>Introducing <strong>Tab Stacks</strong>. You can now switch any tab group in your workspace into a <em>tab stack</em>. Tab stacks provide an alternative way to view your tabs, reminiscent of <a href=\"https://notes.andymatuschak.org\">Andy Matuschak's website</a>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved the overall appearance of the app when &quot;translucent window&quot; is enabled.</li>\n<li>The quick switcher will no longer attempt to reuse an existing tab when opening a file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Windows: fixed not being able to drag the window when a modal is open.</li>\n<li>Fixed styling issues in the Release Notes view.</li>\n<li>Theme modal will now show legacy themes that you have installed locally.</li>\n<li>Fixed &quot;backlink in document&quot; buttons not working.</li>\n<li>Outline view will only scroll the associated tab instead of all tabs with the same file.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":8,"day":31},"info":"<h2>Improvements</h2>\n<ul>\n<li>The setting <strong>Appearance → Show view header</strong> has been renamed to <strong>Appearance → <em>Show tab title bar</em></strong>.</li>\n<li>The setting <strong>Appearance → Title bar style</strong> has been renamed to <strong>Appearance → <em>Window frame style</em></strong>.</li>\n<li>Added &quot;UI zoom level&quot; slider to <strong>Settings → Appearance</strong>.</li>\n<li>Release notes will now automatically show after Obsidian updates.</li>\n<li>Improved community theme/plugin README.md relative images, added support for videos.</li>\n<li>Added default hotkey for opening link in new window (<code>Ctrl/Cmd+Alt+Shift+Enter</code>)</li>\n<li>Improved performance for installing/updating plugins.</li>\n<li>Reduced flashing when searching for plugins.</li>\n<li>Renamed &quot;active file&quot; to &quot;current file&quot; in several commands for better consistency.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed quick switcher's &quot;open to the right&quot; hotkey not working.</li>\n<li>Fixed &quot;Backlink in document&quot; not always updating.</li>\n<li>Fixed file explorer not always highlighting selected files.</li>\n<li>Tweaked sizing and positioning of title bar when zoomed in/out.</li>\n<li>Obsidian Sync will now avoid deleting old themes.</li>\n<li>Fixed misaligned logo in custom mode.</li>\n<li>Fixed status bar jitter when word count updates.</li>\n<li>macOS: Tweaked location of traffic lights when zoomed in/out.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":8,"day":30},"info":"<h2>Note about custom themes</h2>\n<p>Major changes have been made to Obsidian's styling. If you are using a custom theme, make sure you update the theme to the latest version. If you are still seeing visual anomalies, we recommend switching to the default theme for the time being.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>The workspace now supports <strong>Tabs</strong>. To accommodate tabs, we've made a lot of tweaks to Obsidian behaviors.</li>\n<li>Way more than a fresh coat of paint, Obsidian has gone through an extensive redesign process to make the interface more robust, accessible, and easier to tinker with. Internally, we've been calling this new look &quot;Dragonglass,&quot; and we'll be releasing a separate changelog to showcase all the changes that went into it.</li>\n<li>Notes now display the full note title inline with the note contents as an <strong>Inline Title</strong>. The view header is now disabled by default. You can add it back from <strong>Appearance → <em>Show view header</em></strong>.</li>\n<li>By default, the UI is now in <strong>Frameless</strong> mode. The window title is hidden. In settings, you can choose between the new frameless mode, the custom window frame (old default), and using the native OS window frame.</li>\n<li>There's now an &quot;accent color&quot; color-picker in the Appearance settings to give your vault it's own unique style. Theme support may vary.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The Theme Gallery has gotten a major overhaul. Themes now support versioning just like plugins. Note: Themes that are not compatible with 0.16 have been marked as &quot;legacy&quot; and cannot be installed until they get updated.</li>\n<li>We have consolidated the hotkeys for opening new panes.\n<ul>\n<li><code>Ctrl/Cmd + Click</code> on a link will open it in a new tab</li>\n<li><code>Ctrl/Cmd + Alt + Click</code> will open links in a new pane to the right.</li>\n<li><code>Ctrl/Cmd + Alt + Shift + Click</code> will open links in a new window.</li>\n</ul>\n</li>\n<li>Auto-generated links to headings now keep more punctuation characters for better contexts.</li>\n<li>Added &quot;Native menus&quot; to show context menus natively for desktop only.</li>\n<li>Added &quot;collapse all&quot; button to file explorer and tag view.</li>\n<li>Added &quot;Change theme&quot; command for quickly switching between themes.</li>\n<li>Added &quot;Find &amp; Replace,&quot; Export PDF, Share, and text formatting items to macOS app menu.</li>\n<li>Added <code>Shift + Up/Down</code> hotkeys to expand search results while a search item is focused.</li>\n<li>Added &quot;Title bar style&quot; setting for switching between the custom app frame (default) and the OS-native app frame.</li>\n<li>Added &quot;Fold more&quot; and &quot;Fold less&quot; commands for folding lines under the cursor.</li>\n<li>Renamed &quot;Split vertically&quot; and &quot;Split horizontally&quot; to &quot;Split right&quot; and &quot;Split down&quot; to avoid ambiguity.</li>\n<li>Pressing <code>Home</code> will now move the cursor to the beginning of a list item.</li>\n<li>Obsidian Sync: The history view has a toggle to choose between seeing the version of a file at a point in time or seeing the diff.</li>\n<li>Added <code>show-theme</code> action to the Obsidian URI. It will open the given theme in the Community theme gallery. For example: <a href=\"obsidian://show-theme?name=Minimal\">obsidian://show-theme?name=Minimal</a></li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug with search results containing &quot;path:&quot; sometimes showing duplicate text.</li>\n<li>Fixed multi-line embedded queries not working.</li>\n<li>Fix memory leak with loading native system fonts.</li>\n<li>Fixed crash when file explorer is missing a sort order.</li>\n<li><code>Ctrl/Cmd+W</code> can now close the vault switcher and help window.</li>\n<li>File explorer keyboard navigation properly ignores hidden files.</li>\n<li>Clicking to edit Live Preview widgets (e.g. tables or callouts) will now scroll the view to the beginning of the widget.</li>\n<li>Word count now works for any text file that can be opened, not just <code>md</code> files.</li>\n<li>macOS: &quot;obsidian&quot; will now be capitalized in the App menu.</li>\n<li>macOS: commands will no longer refer to Finder as &quot;System Explorer.&quot;</li>\n<li>macOS: right-clicking on top of the cursor will no longer cause the word under the cursor to be selected.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Workspace information is no longer saved to the <code>.obsidian/workspace</code> file. It is now saved to <code>workspace.json</code>.</li>\n<li>Added standard color picker component.</li>\n<li>Added <code>has-active-menu</code> class to file explorer item that received the right-click.</li>\n<li>Added <code>list-bullet</code> class to HTML markup for unordered list items.</li>\n<li>Theme developers: we have published <a href=\"https://forum.obsidian.md/t/0-16-0-theme-migration-guide/42537\">a guide for helping get your theme ready for 0.16</a>.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Q.</strong> Why am I seeing the title of my note duplicated at the top of my note?</p>\n<blockquote>\n<p>We now display the filename as an <strong>Inline Title</strong> to allow filenames to feel more attached to the note. If you already have the heading of your note matching the filename, you might notice some redundancy. You can disable this feature  from <strong>Editor → Display → <em>Show inline title</em></strong></kbd>.</p>\n</blockquote>\n<p><strong>Q.</strong> Where did the view header with my current view status go?</p>\n<blockquote>\n<p>The view header is hidden by default. You can re-enable it in settings at <strong>Appearance → Advanced → <em>Show tab title bar</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why does everything look so big/small?</p>\n<blockquote>\n<p>The new update has made some changes to make Obsidian feel more native to your operating system. To adjust the overall scale of the UI, you can configure the <strong>UI Zoom</strong> level in Settings at <strong>Appearance → Advanced → <em>Zoom level</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> How do I open notes side-by-side now?</p>\n<blockquote>\n<p>The behavior of <code>Cmd/Ctrl + Enter</code> and <code>Cmd/Ctrl + Click</code> have changed to opening links in a new tab. To open links in a new pane to the right, you can use <code>Cmd/Ctrl + Alt + Enter</code> or <code>Cmd/Ctrl + Alt + Click</code>.</p>\n</blockquote>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":7,"day":26},"info":"<h2>No longer broken</h2>\n<p>Fixed copying and pasting using the context menu.</p>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":8,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":7,"day":22},"info":"<h2>Improvements</h2>\n<ul>\n<li>Added support for .mov and .mkv files. Exact codec support may vary by platform.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed “Inter” not showing up in the font list. It will now appear at the top of the list for easy access.</li>\n<li>Graph view will now properly wait for fonts to load before rendering.</li>\n<li>Graph view groups can now be reordered by dragging and dropping again.</li>\n<li>Fixed Markdown embeds showing up with a large empty space in pop-out windows.</li>\n<li>Fixed editor search not showing up in pop-out windows.</li>\n<li>Pressing “Escape” will no longer unfocus a sidebar editor pane.</li>\n<li>The app will now fallback to a Github proxy when Github is inaccessible.</li>\n<li>Switching workspaces will now properly close all pop-out windows.</li>\n<li>Live Preview: Toggling checklist items in callout will no longer cause the callout to get collapsed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":7,"day":18},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed &quot;Inter&quot; not showing up in the font list. It will now appear at the top of the list for easy access.</li>\n<li>Graph view will now properly wait for fonts to load before rendering.</li>\n<li>Graph view groups can now be reordered by dragging and dropping again.</li>\n<li>Fixed Markdown embeds showing up with a large empty space in pop-out windows.</li>\n<li>Fixed editor search not showing up in pop-out windows.</li>\n<li>Escape no longer unfocuses a sidebar editor pane.</li>\n<li>The app will now fallback to a Github proxy when Github is inaccessible.</li>\n<li>Switching workspaces will now properly close all pop-out windows.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":0,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":7,"day":12},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v0.15.6.</li>\n<li>Major update to the editor engine fixing several input related bugs.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>You can now choose user installed fonts.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":7,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed checkboxes not working in Live Preview.</li>\n<li>When the app loading fails, there is now an option to reload app in Restricted Mode (with plugins disabled).</li>\n<li>Fixed page preview not scrolling to specific location properly when hovering search results.</li>\n<li>Fixed linked panes keeps stealing focus when navigated.</li>\n<li>Fixed LaTeX math not rendering in pop-out windows.</li>\n<li>Fixed &quot;Show File Explorer&quot; and other similar commands not focusing on the pane when activated.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":7,"day":8},"info":"<h2>Improvements</h2>\n<ul>\n<li>Renamed &quot;Open current pane to new window&quot; command to &quot;Move current pane to new window.&quot;</li>\n<li>There is now a separate &quot;Open current pane in new window&quot; command for opening a pop-out window without closing the current view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed reading mode in pop-out window not rendering when the main window is minimized.</li>\n<li>Fixed graph view in pop-out window not responding when main window is minimized.</li>\n<li>Fixed various suggestion items not rendering properly.</li>\n<li>x-callback-url now disallows <code>file:///</code> protocols.</li>\n<li>Fixed hover preview not working in graph view.</li>\n<li>Fixed &quot;focus on pane to left/right&quot; commands not working within pop-out windows.</li>\n<li>Fixed &quot;close all other panes&quot; command not working within pop-out windows.</li>\n<li>macOS: Fixed App Menu items not working when pop-out window was focused not working within pop-out windows.</li>\n<li>Fixed styling issues within the Open Vault window.</li>\n<li>Fixed issue where pressing 'escape' in the graph view would cause the view to lose focus.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>If a plugin view crashes when getting created, the view will properly get cleaned up.</li>\n<li><code>leaf.view</code> can now never be null.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":7,"day":5},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added &quot;Toggle always on top&quot; command to pin pop-out windows above all other windows on your desktop.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The native scrollbar styling for macOS is back. This can still be overridden by themes.</li>\n<li>Views dragged out into their own pop-out will now preserve their previous pane size.</li>\n<li>Automatically refocuses the view in pop-out windows when cycling between windows.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed &quot;Open in new window&quot; not giving the new pane focus.</li>\n<li>Copying to clipboard now works in pop-out windows.</li>\n<li>Fixed issue where the File Explorer didn't always respect the &quot;default note location&quot; setting.</li>\n<li>Backlinks in document will no longer disappear in pop-out windows.</li>\n<li>The toggle sidebar commands should now work again.</li>\n<li>Pop-out windows will now remember their position and size when restoring from maximize, minimize, or fullscreen.</li>\n<li>Fixed table wrapping issues in Live Preview.</li>\n<li>Fixed checkbox in callouts misaligned when using RTL.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>We've made several improvements to the workspace API to improve plugin compatibility with v0.15.X. If you've been experiencing compatibility issues with your plugin (views opening in the wrong leaf, files opening without focus), we recommend testing against this version to see if the issues have been resolved.</li>\n<li>For plugin and theme developers: we've made changes to the <code>Suggest</code> component's DOM structure. If your plugin is attaching itself to core Suggest components or mimicking the Suggest component structure, it will likely be impacted.\n<ul>\n<li>The new DOM structure is:</li>\n</ul>\n<pre><code>- .suggestion-item\n\t- .suggestion-content\n\t\t- .suggestion-title\n\t\t- .suggestion-note (optional)\n\t- .suggestion-aux\n\t\t- .suggestion-hotkey (optional)\n\t\t- .suggestion-flair (optional)\n</code></pre>\n</li>\n<li>The behavior of <code>workspace.getActiveFile</code> has been updated to now return the file of the most recently active FileView. This change should improve compatibility for custom views now that sidebar views are focusable. If you were previously using <code>workspace.getMostRecentlyActiveFile</code> for v0.15.X compatibility, please switch back to <code>getActiveFile</code>.</li>\n<li>Note: Theme developers can avoid overriding the macOS native scrollbars by targeting <code>body:not(.native-scrollbars)</code> for any scrollbar styling.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":6,"day":17},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now drag and drop panes across multiple windows.</li>\n<li>You can now drag a pane outside of the app to create a new window.</li>\n<li>You can now right click on a file or a link to open it in a new window.</li>\n<li>You can now rearrange the order of tabs in the sidebar.</li>\n<li>Pop-out windows will now save and restore their position across app restarts.</li>\n<li>You can now right click on the Obsidian Sync status indicator to bring up a menu of shortcuts for pause/unpause, change settings, view the sync log, or view recently deleted files.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Menu items are now grouped by function to make them easier to use.</li>\n<li>The &quot;editor status&quot; core plugin has been moved to an editor setting. It will also now show an icon instead of text.</li>\n<li>Pressing <code>Escape</code> when not focused on a pane now focuses the last active editable pane.</li>\n<li>The application menu on macOS now shows the assigned hotkey for each menu item.</li>\n<li>Added a pin icon to pinned sidebar views.</li>\n<li>&quot;Focus on editor&quot; command is now called &quot;Focus on last note&quot; and will restore focus to the most recently focused note.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed several vim hotkeys that were broken due to the CodeMirror 6.0 update.</li>\n<li>In vim mode, characters that are composed with AltGr now work correctly in normal and visual mode.</li>\n<li>Fixed mermaid not rendering in pop-out windows.</li>\n<li>Fixed embeds render with large empty space in pop-out windows.</li>\n<li>Fixed link with pane not working across pop-out windows.</li>\n<li>Fixed styling issues with translucency.</li>\n<li>Fixed Obsidian Publish upload dialog unable to &quot;Use live version&quot; in deleted/non-existent notes.</li>\n<li>Fixed font selector not showing all fonts.</li>\n<li>F1-F12 keys can now be bound to commands without a modifier.</li>\n<li>Fixed long filenames overlapping with buttons in the window titlebar.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>New enhancements for DOM elements and UI events: This applies to all derivatives of <code>Node</code> (like <code>Element</code>, <code>HTMLElement</code>, etc) and all derivatives of <code>UIEvent</code> (like <code>MouseEvent</code>, <code>KeyboardEvent</code>, etc)\n<ul>\n<li>You can now easily access the element or event's owner document (<code>element.doc</code> or <code>event.doc</code>) and window (<code>element.win</code> or <code>event.win</code>).</li>\n<li>You can now use <code>element.instanceOf(HTMLElement)</code> or <code>event.instanceOf(MouseEvent)</code> to perform instanceof checks without having to worry about cross-window constructors.</li>\n<li><code>HTMLElement</code> now also has a <code>onWindowMigrated</code> hook that can be used to monitor when the element gets attached to different windows. This can be used to re-initialize views that depend on window globals.</li>\n</ul>\n</li>\n<li>There are now workspace events for <code>window-open</code> and <code>window-close</code>.</li>\n<li><code>MenuItem</code> now has a new method <code>setSection(string)</code>. Items from the same section will be grouped together, in the order they were defined or first used. The default section (empty string) will contain all legacy/plugin/unspecified menu items and is usually put into a specific spot of the sort order (for example, before the danger items). Inspect the DOM to see existing sections' <code>data-section</code>.</li>\n<li>We've removed the ability to create <code>MenuItem</code> directly - please use <code>Menu.addItem</code> instead.</li>\n<li>On <code>View</code>, we've deprecated the <code>onHeaderMenu</code> and <code>onMoreOptionsMenu</code> in favor of a single <code>onPaneMenu</code> function with a <code>source</code> parameter. This new method will be used for both the header menu (right clicking on a tab header in the sidebar) and the more options menu (three dot menu).</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":6,"day":17},"info":"<h2>Improvements</h2>\n<ul>\n<li>Pressing <code>Esc</code> with a sidebar view focused will refocus your last note.</li>\n<li>Checkboxes within settings can now receive keyboard focus.</li>\n<li>Clicking on a view's options menu will now toggle it opened/closed.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Left and right arrow keys now work within the search input again.</li>\n<li>Opening a view in its own window will now give the view focus.</li>\n<li>Inline images are now properly rendered inline with text.</li>\n<li>Fixed switching panes doesn't update the window title.</li>\n<li>Fixed issue with file explorer causing high CPU usage when your vault has many unfolded files showing.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added <code>mod-active</code> class to the tab headers when the view is active.</li>\n<li>Updated Mermaid to v9.1.2.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":6,"day":15},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The Tag pane can now be navigated with the keyboard.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>macOS-only: the title bar is now 2px taller.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Plugin views will no longer get replaced when clicking on a link (such as Calendar).</li>\n<li>Fixed files not being opened inside the currently active split.</li>\n<li>Graph view interactions now works within a popout window.</li>\n<li>The tag pane will show nested tags again.</li>\n<li>Native scrollbars have been temporarily reverted on macOS due to the white background issue on dark theme.</li>\n<li>&quot;About&quot; window on macOS will now show the Obsidian version correctly.</li>\n<li><code>Ctrl/Cmd</code>-clicking on the active file in the File Explorer will open it in a split instead of focusing the explorer.</li>\n<li>Popout windows are removed when switching workspaces.</li>\n<li>Vim mode: The ghost character (like <code>#</code>) that appears in an unfocused editor is now hidden.</li>\n<li>Navigating forward/backward in history will skip over some views such as File Explorer or backlinks.</li>\n</ul>\n<h2>Developer</h2>\n<ul>\n<li>To account for sidebar views being able to receive focus, we have deprecated several <code>Workspace</code> functions whose behavior conflicted with user expectations.</li>\n<li>Added <code>.is-focused</code> class to the window body of the currently focused window.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":15,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":6,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>New &quot;Open in New Window&quot; command for opening views in a separate window.</li>\n<li>The app menu on macOS has been revamped to be more consistent with the OS.</li>\n<li>Added keyboard navigation to the File Explorer and Search views Arrow keys to move through items, <code>Enter</code> / <code>Shift+Enter</code> to select.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Sidebar panes can now receive focus. This change allows hotkeys to work in editors moved into the sidebar.</li>\n<li>The native scrollbar styling for macOS is now used throughout the app. This can still be overridden by themes.</li>\n<li>Will now use your system font by default on Windows and macOS. You can customize this in settings.</li>\n<li>Window title will now include the active file name.</li>\n<li>New users will now automatically start with Live Preview. Users currently using the legacy editor will be prompted about the legacy editor going away in a future release.</li>\n<li>Pressing enter inside a list item will now detect if the rest of the line is also a list item, and avoid generating duplicate bullet characters.</li>\n<li>Merged &quot;Account&quot; and &quot;About&quot; tabs in the settings</li>\n<li>Added &quot;check for updates&quot; button to theme.</li>\n<li>&quot;Safe mode&quot; has been renamed to &quot;Restricted mode&quot;.</li>\n<li>&quot;Open in default app&quot; is no longer a Core plugin and the functionality has been moved into core.</li>\n<li>Pressing <code>Escape</code> when there's a highlight in the editor (from search or navigation) causes the highlight to be removed, instead of requiring a mouse click.</li>\n<li>On macOS, <code>Ctrl+N/P</code> can now be used to navigate suggestion results similar to <code>Up/Down</code> arrow keys.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Plugin panes will now automatically unload and reload when plugins are disabled or enabled.</li>\n<li>Sidebar collapse/expand animation no longer causes editor panes to resize suddenly at the end.</li>\n</ul>\n<h2>Developer</h2>\n<ul>\n<li>CodeMirror 6 has been updated from v0.19 to v6.0. If your plugin uses cm6 extensions, please upgrade to v6.0 soon, and make sure you set your <code>minAppVersion</code> to 0.15.0.</li>\n<li>Upgraded MathJax to v3.2.1.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":2,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":6,"day":7},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v0.14.15.</li>\n<li>Fixed rename vault functionality gets stuck.</li>\n<li>You can now setup Obsidian Sync right from the starting screen.</li>\n</ul>\n<h2>Android</h2>\n<ul>\n<li>Fixed <code>stat</code> on directories gives <code>NaN</code>.</li>\n<li>Fixed pressing enter in global search causes focus to shift to the editor that's hidden behind.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>Fixed black bar at the bottom on iPad when using external keyboard.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":15,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":5,"day":27},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed typing with IME causes fold indicators to move around the note.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":26},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed typing with IME sometimes causes the text to not get styled properly until another change is performed.</li>\n<li>Fixed rename block ID not renaming the ID itself when updating links.</li>\n<li>Fixed unnecessary underlines within single square brackets.</li>\n<li>Fixed Live Preview scrolling with scrollbar not re-rendering properly.</li>\n<li>Fixed File explorer not highlighting items properly when right clicking.</li>\n<li>Daily notes with templates are now created in a single step, instead of being created empty first and filled in after.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":24},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now rename block IDs when right clicking on the block ID, which will update all the references to that block ID.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Errors and console logs from plugins will now indicate the plugin's name instead of showing <code>eval at anonymous</code>.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed note composer's merge note functionality not updating links after merging.</li>\n<li>Move line up/down/delete paragraph commands can now be repeated again by holding the hotkey.</li>\n<li>Fixed drag and drop not working on some plugins.</li>\n<li>Fixed strikethrough not working on links.</li>\n<li>Fixed identical custom code blocks in Live Preview not re-rendered when switching documents.</li>\n<li>Fixed open context menu command not opening in the correct location in legacy editor.</li>\n<li>Fixed note composer &quot;merge note&quot; not properly updating links after merging.</li>\n<li>Fixed IME broken when typing on a line before a heading that starts with a space character.</li>\n<li>Fixed identical custom code blocks in Live Preview goes stale when switching documents.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":16},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed holding down keys in the editor not working.</li>\n<li>Fixed vim mode cursor not updating position when focus leaves the editor.</li>\n<li>Fixed height computation disrupted by some themes resetting the <code>contain</code> property.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":16},"info":"<h2>Improvements</h2>\n<ul>\n<li>You can now move or delete multiple selected items via the right-click context menu in the File Explorer.</li>\n<li>The backslash escape character will now be hidden when your cursor is not on the same line in Live Preview.</li>\n<li>When exiting in-document search, the last searched result will be selected automatically.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Hotkeys will no longer trigger multiple times when you hold down the hotkey.</li>\n<li>Links created by LaTeX or Mermaid will no longer accidentally navigate the app to an empty white page.</li>\n<li>Fixed vim mode has a blinking thin caret alongside the vim caret.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now share your Obsidian Sync vaults with others.\n<ul>\n<li>Collaborators must have an Obsidian Sync subscription.</li>\n<li>Joining a Sync vault will not count towards the 5 vault limit for collaborators.</li>\n<li>To invite other users, go to Settings &gt; Sync &gt; Remote Vault &gt; Manage &gt; Manage sharing.</li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed <code>Tab</code> related navigation broken in modals.</li>\n<li>Fixed vault switcher sometimes only loads partially when offline.</li>\n<li>Fixed text selection highlight not working in code blocks with vim mode enabled.</li>\n<li>Fixed some multi-character glyphs not rendering correctly due to an older version of the &quot;Inter&quot; font.</li>\n<li>Fixed Obsidian Publish menu option for &quot;Open in live site&quot; not opening the correct URL.</li>\n<li>Fixed <code>jsp</code> code blocks causes the editor parsing to crash.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":9,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":3},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed Obsidian Publish frontmatter <code>publish</code> flag not working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":5,"day":3},"info":"<h2>Shiny new things for Obsidian Publish</h2>\n<ul>\n<li>\n<p>You can now collaborate on your site using their Obsidian account, so that multiple users can publish to the same site.</p>\n<ul>\n<li>This can be done in &quot;Site options&quot; &gt; &quot;Site collaboration&quot;</li>\n<li>All site members can publish pages to the site.</li>\n<li>Only the owner can change the configurations and manage members.</li>\n<li>Only the owner needs to pay for the site, collaborators can join for free.</li>\n<li>Note that collaborators should ensure they have synced the latest edition of the site before making changes.</li>\n</ul>\n</li>\n<li>\n<p>You can now configure a list of included and a list of excluded folders when publishing changes.</p>\n<ul>\n<li>If a page is matched to the inclusion list, then it will be automatically selected for publishing.</li>\n<li>If a page is matched to the exclusion list, it will be completely removed from the list of pages to publish.</li>\n<li>The frontmatter <code>publish:</code> flag will override this setting for individual notes.</li>\n<li>Exclusions take priority over inclusions.</li>\n</ul>\n</li>\n<li>\n<p>In the &quot;Publish changes&quot; dialog, you can now right click on each note for a list of options, such as...</p>\n<ul>\n<li>Open the page on the live site.</li>\n<li>Open the note locally.</li>\n<li>Compare your local version with the live version.</li>\n<li>Discard local changes and download the live version.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Sync diffs now render as unified diffs to conserve space.</li>\n<li>File recovery will now show diffs as well.</li>\n<li><code>opus</code> audio files are now recognized as a supported file type.</li>\n<li>Unlinked mentions for outgoing links now respects the exclusion filter.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed fonts sometimes not working with some themes and plugins using legacy css variables.</li>\n<li>Disabled <code>sec-ua-hint</code> to reduce issues with iframes.</li>\n<li>Fixed callout titles not working with strict line break turned on.</li>\n<li>Fixed selecting words in headings will invisibly also select to the beginning of the line.</li>\n<li>Fixed global graphs not showing unsupported attachments.</li>\n<li>Fixed &quot;show context menu under cursor&quot; not triggered correctly when app is zoomed.</li>\n<li>Fixed dragging and dropping files into the editor not showing the proper action verb text.</li>\n<li>Fixed callouts in Live Preview not showing unresolved links as faded.</li>\n<li>Fixed embeds within callouts in Live Preview not live updating and unable to click on checklists.</li>\n</ul>\n<h2>Developer</h2>\n<ul>\n<li>Fixed tab not working in modals.</li>\n<li><code>registerDomEvent</code> can now take an options object (for things like <code>{capture: true}</code>).</li>\n<li>Added <code>goWordLeft</code> and <code>goWordRight</code> editor commands.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":4,"day":25},"info":"<h2>Improvements</h2>\n<ul>\n<li>Unlinked mentions now also skip over ignored files.</li>\n<li>There is now an improved setup guide for Obsidian Sync from the vault selector window.</li>\n<li>You can see what's changed in each version in Obsidian Sync version history.</li>\n<li>Zoom level is now saved per vault.</li>\n<li>In addition to &quot;Dark&quot; and &quot;Light&quot;, you can also set your Obsidian theme to &quot;Adapt to system&quot;. Obsidian will auto-update the theme as your system setting changes. Shoutout to kepano for the &quot;System dark mode&quot; plugin!</li>\n<li>You can now enable a dark/light toggle for your Obsidian Publish site.</li>\n<li>You can now set theme to &quot;Adapt to system&quot; for your Obsidian Publish site, so that your site adapts to the reader's system settings.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed attachments on network drives not loading.</li>\n<li>Fixed link suggestion lag when long links to nonexistent files are present.</li>\n<li>Fixed vim mode <code>num + j</code> combos sometimes not working when screen is scrolled.</li>\n<li>Fix code blocks not rendered at the correct time in Live Preview.</li>\n</ul>\n<h2>Developer</h2>\n<ul>\n<li>Updated Lucide to v0.30.0.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":1,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2022,"month":4,"day":11},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v0.14.6.</li>\n<li>Tapping the three dot more options icon now brings up the menu related to this file, rather than the right sidebar. You can get to the right sidebar by long-holding this icon, or swiping from the right.</li>\n</ul>\n<h2>Android</h2>\n<ul>\n<li>Fixed tapping the file name when renaming a file in File Explorer causes the file menu to show up.</li>\n</ul>\n<h2>iOS</h2>\n<ul>\n<li>Long-holding buttons that triggers an action (like the three dot menu) now triggers it after holding for 600ms instead of triggering it when the finger is released.</li>\n<li>Fixed app freezing when resuming from another app when using a large vault.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":4,"day":11},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now add folders to an ignore filter. Files matched by this filter will be down-ranked when using Quick Switcher and link suggestions, and will be excluded in search results and graph view.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Spellcheck corrections should now work better in text with styling applied such as headings, bold/italics, etc.</li>\n<li>Show context menu under cursor should now also display the spellcheck options.</li>\n<li>Obsidian Publish upload dialog now displays the total count of each section.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed backlinks linked mentions causes lag on large vaults.</li>\n<li>Exporting to PDF when using dark mode no longer causes unreadable code blocks.</li>\n<li>Dragging items and resizing panes should no longer get stuck when moving across <code>&lt;iframe&gt;</code> and <code>&lt;webview&gt;</code>.</li>\n<li>Dragging and dropping files from outside Obsidian should no longer cause its contents to be inserted before or after the link.</li>\n<li>Fixed soft-wrapping not working if line was folded when the note was opened.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":4,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Updated installer to Electron 18.0.3 which fixes several bugs that were in Electron 17.\n<ul>\n<li>Fixed performance issues with resizing the app.</li>\n<li>Fixed window border issues on Windows.</li>\n<li>Fixed developer tools performance snapshot issues.</li>\n</ul>\n</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>When selecting text and converting into a fenced code block, newline characters are now automatically added.</li>\n<li>The insert callout command will now wrap any selected text into the callout body content instead of replacing it.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Reduced lag caused by big exclusion filters with Obsidian Sync.</li>\n<li>Fixed headings in lists causing indentation guides to misalign.</li>\n<li>Fixed monospaced font not applied.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":31},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Font settings can now list all fonts installed in the system (requires installer update to v0.14.4).</li>\n<li>You can now assign multiple fonts to each font option, and the first available font will be used.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Obsidian Sync should now no longer create duplicate files when renaming a file while it is still syncing.</li>\n<li>Obsidian Sync now has a fully customizable sync folder exclusion system. This allows you to add exclusions to folders even if they don't exist locally.</li>\n<li>Auto-completing three backticks for code blocks now adds a newline automatically to avoid suddenly parsing the rest of the note as code.</li>\n<li>Toggle bold/italics will now smartly skip over the closing markers when at the end of the block, instead of adding more marker symbols.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed on Linux the app doesn't properly watch for changes in the config folder.</li>\n<li>Fixed headings in lists not properly styled in Live Preview.</li>\n<li>Fixed duplicate event handlers for embeds, callouts, and tables blocks in Live Preview.</li>\n<li>Fixed app crashes on startup for platforms that doesn't have a configured documents folder.</li>\n<li>Fixed x-callback-url not properly taking into account existing <code>?</code> query parameters.</li>\n<li>Fixed move file dialog lags in vaults with lots of folders.</li>\n<li>Fixed <code>&lt;webview&gt;</code> unable to open pages externally in the browser.</li>\n<li>Fixed downloading or updating plugins without css causes one to appear with the contents &quot;Not found&quot;.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>CSS variables related to fonts have been renamed.\n<ul>\n<li><code>--default-font</code> is now <code>--font-default</code> (but it will fallback to <code>--default-font</code>)</li>\n<li><code>--interface-font</code> is now <code>--font-interface</code>.</li>\n<li><code>--editor-font</code> is now <code>--font-text</code> and will cover both editing and reading.</li>\n</ul>\n</li>\n<li>There is now a <code>--font-interface-theme</code> and <code>--font-text-theme</code> dedicated for themes to set the fonts.</li>\n<li>Each theme and snippet is now put into its own <code>&lt;style&gt;</code> tag to avoid issues with imports not working.</li>\n<li><code>app</code> is now officially available as a global variable.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":14,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":3,"day":28},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now move, rename or locate your vaults directly from the vault switcher.</li>\n<li>There is now a new in-app help page with links to the online help docs, Discord, forum, as well as the sandbox vault.</li>\n<li>The local help vault has been replaced with a sandbox vault.</li>\n<li>You can now set the font for the interface and the editor directly under appearance settings. Note that some themes may override this font setting.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved Live Preview clicking experience for callouts and embeds.</li>\n<li>Improved <code>&lt;iframe&gt;</code> for some websites that disallows being iframed.</li>\n<li>There's now a command to open context menu for the current cursor location.</li>\n<li>Vim mode up/down now goes into rendered code blocks, embeds, callouts, or tables in Live Preview instead of skipping them.</li>\n<li>Pasting and dropping images or media files that are already located in the vault will now link to it directly instead of duplicating the file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Chinese IME on Windows causes selection issues when using punctuation characters.</li>\n<li>Fixed multi-line block math in blockquotes not working in Live Preview.</li>\n<li>Fixed clicking on checkbox in callouts not working in Live Preview.</li>\n<li>Fixed unindent always keeps one extra space when use tabs is turned off.</li>\n<li>Fixed Quick Switcher not respecting relative path for creating new files.</li>\n<li>Fixed unable to select text within embeds in Live Preview.</li>\n<li>Fixed memory leak when closing local graph view.</li>\n<li>Fixed using the editor search or replace commands doesn't auto-fill selected text when search or replace is already open.</li>\n<li>Fixed issue where the currently focused pane would lose focus when trying to focus a pane that can't be focused.</li>\n<li>Fixed Audio Recorder's webm files can't be seeked and doesn't show total time.</li>\n<li>Fixed pasting images on macOS is inconsistent between Firefox, Chrome and Safari.</li>\n<li>Fixed folding not loading properly sometimes when using horizontal rules.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Callouts now has its metadata (the part in <code>![type|metadata]</code>) put into its html as <code>data-callout-metadata</code>.</li>\n<li><code>&lt;webview&gt;</code> tags are now allowed to be used to embed external content for plugins (Electron/desktop app only).</li>\n<li>Updated DOMPurify, Turndown, Mermaid, PIXI.js, and Prism.js.</li>\n<li>Obsidian URI's <code>new</code> action now has an optional <code>append</code> flag and an optional <code>overwrite</code> flag. If <code>append</code> is set, it will append to an existing file if one is found. If <code>override</code> is set, it will overwrite an existing file if one is found, but only if <code>append</code> isn't set.</li>\n<li>Obsidian URI's <code>new</code> and <code>hook-get-address</code> actions can now optionally accept <code>x-success</code> as part of the <code>x-callback-url</code> specifications, and will return a <code>name</code>, <code>url</code>, and <code>file</code> (<code>file://</code>) as the returned URL parameters.</li>\n<li><code>Menu</code> constructor no longer requires <code>App</code> to be passed in.</li>\n</ul>\n","major_release":false}]