[{"version":{"major":1,"minor":3,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":6,"day":26},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>New Appearance setting to apply a custom app icon. Supports <code>.ico</code> and <code>.png</code> files.</li>\n<li>Added support for deep linking in PDFs. Links can be created by right clicking on a PDF's table of contents, an annotation, or any selected text.</li>\n<li>New &quot;Adapt to theme&quot; menu option for PDFs. Enabling this will override the PDF appearance so its rendered to match the styling of the current theme</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Tab close button is now hidden for inactive tabs and will only appear on hover. This creates more space for file names inside the tab.</li>\n<li>Improved how headings are displayed. Headings in Live Preview and Reading mode should now more closely match in appearance. Note this requires installer version 1.1.9 or above.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Spellcheck setting is now stored app-wide properly, instead of having some vaults overriding others.</li>\n<li>Live Preview: Markdown tables are now allowed to start immediately after headings without a blank line.</li>\n<li>Fixed bug where embedded PDFs and markdown files sometimes lose their scroll position.</li>\n<li>Fixed issue where the initial switch from edit mode to reading mode causes the scroll position to be lost.</li>\n<li>Fixed issue where reading mode scrolls unexpectedly when opening new tabs.</li>\n<li>Canvas: Allow opening external links in webviews.</li>\n<li>Mermaid: Fixed some color issues.</li>\n</ul>\n<h2>Developers</h2>\n<p>New CSS variables:</p>\n<ul>\n<li><code>--p-spacing</code>  defines the spacing between paragraphs (defaults to <code>1rem</code>).</li>\n<li><code>--heading-spacing</code> defines the spacing above a heading when it follows a paragraph (defaults to 2.5x paragraph spacing).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":6,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2023,"month":6,"day":1},"info":"<ul>\n<li>New app icon! Learn more <a href=\"https://obsidian.md/blog/new-obsidian-icon/\">on our blog</a>.</li>\n<li>Includes all new functionality and bug fixes up to <a href=\"/changelog/2023-06-01-desktop-v1.3.5/\">Obsidian Desktop v1.3.5</a>.</li>\n<li>Fixed issues with zooming PDFs on iOS devices.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":6,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>New app icon! Learn more <a href=\"https://obsidian.md/blog/new-obsidian-icon/\">on our blog</a>. Requires <a href=\"https://obsidian.md/download\">downloading the new installer</a>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Pressing <kbd>Shift</kbd> <kbd>Enter</kbd> while the <code>[[</code> link suggest is showing will now skip the autocomplete and accept the current input as the full link.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Pressing <kbd>esc</kbd> while renaming a file will now properly cancel the rename instead of accepting the change.</li>\n<li>Fixed PDFs not loading in pop-out windows when the main window is minimized.</li>\n<li>Fixed issue where the <code>[[</code> link suggest would not always work if <code>]]</code> was not found on the current line.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":5,"day":24},"info":"<h2>Improvements</h2>\n<ul>\n<li>Reverted behavior change for links in pinned tabs. Clicking them will now open the link in another visible tab that is not pinned.</li>\n<li>Reverted behavior for &quot;Open to the right&quot; as well as the Ctrl/Cmd + Alt + Click modifier. A new tab group will now always be created for the new tab.</li>\n<li>When deleting a file, if the open tab containing that file has navigation history, the tab will no longer be closed. Instead it will show the most recent file from the history.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Prevent math from inserting links that execute JavaScript when clicked on.</li>\n<li>Prevent plugins from breaking the PDF viewer.</li>\n<li>Fixed lag issues from warnings generated by plugins misusing <code>renderMarkdown</code>.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":5,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2023,"month":5,"day":23},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://forum.obsidian.md/t/obsidian-release-v1-3/60251\">Obsidian Desktop v1.3.3</a>. This includes the new PDF viewer.</li>\n<li>Live Preview: Reduce flickering and flashing when selecting text.</li>\n<li>Adding text to an existing file via Share menu will always append text to the end of the file.</li>\n<li>iOS: Fixed Canvas unable to drop images dragged from other apps.</li>\n<li>iPad: Fixed issue where cursor and scroll position are messed up after dismissing the keyboard via the virtual keyboard's &quot;close keyboard button.&quot;</li>\n<li>iPad: Fixed switching apps causes Obsidian to lose text focus.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":23},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed &quot;split right&quot; command not always creating a new tab group.</li>\n<li>Bookmarks: Fixed bookmark group rename not working.</li>\n<li>PDF: Fixed PDF reload when other files are changed.</li>\n<li>Fixed clicking in documents with embeds, images, or raw HTML sometimes causes scroll jump.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>YouTube and Twitter links can now be embedded within your notes using the Markdown image embed syntax (i.e. <code>![](https://www.youtube.com/...)</code>).</li>\n<li>Clicking on external links inside <code>&lt;iframe&gt;</code> now properly open them in the default browser.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved Live Preview rendering performance when moving the cursor.</li>\n<li>Quick switcher: Bookmarks no longer rank higher in the search results.</li>\n<li>PDF tabs will now automatically reload the PDF file when it is modified outside of Obsidian.</li>\n<li>New hotkeys for interacting with the File explorer:\n<ul>\n<li><code>F2</code> to start renaming the focused file.</li>\n<li><code>Space</code> to open the focused file.</li>\n<li>macOS: <code>Enter</code> to start renaming the focused file (to follow the OS convention).</li>\n<li>macOS: <code>Cmd + ArrowDown</code> to open the focused file.</li>\n</ul>\n</li>\n<li>Live Preview: Markdown tables now require a blank line before them in order to render. This makes the behavior consistent with reading mode and offers better interoperability with other Markdown apps.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Linux: fixed issues with middle-click triggering paste when it shouldn't.</li>\n<li>Renaming a file in the tab title bar now finishes the rename when using the <code>Enter</code> and <code>Tab</code> key.</li>\n<li>Long tables that exceed the view width will now show a scrollbar.</li>\n<li>Fixed missing first column when pasting a Markdown table.</li>\n<li>File Explorer: fixed &quot;Reveal file in navigation&quot; not always scrolling the file into view.</li>\n<li>Fixed <code>Alt + Click</code> in file explorer not setting the focused file properly.</li>\n<li>Fixed alignment of icons inside tree components.</li>\n<li>Search: Clicking filenames in the search results will now respect the &quot;Always focus new tabs&quot; preference.</li>\n<li>Frontmatter will now still be recognized if there are spaces after the ending <code>---</code>.</li>\n<li>Fixed file saving interrupted when closing or quitting. Now Obsidian will properly wait for the file to be saved before closing.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":15},"info":"<h2>Improvements</h2>\n<ul>\n<li>We've redesigned all the tree components (e.g. File Explorer, Outline view) to make the visual hierarchy more clear. This will likely impact any custom themes that you're using.</li>\n<li>PDF: Improved text selection.</li>\n<li>PDF: Added menu for embedded PDFs.</li>\n<li>New behavior for &quot;Open to the right&quot; as well as the Ctrl/Cmd + Alt + Click modifier. Instead of always creating a new tab group, if there is a tab group to the right of the current tab, it will open the link in that tab group.</li>\n<li>Outline: The outline view now supports keyboard navigation and preserves folded headings.</li>\n<li>Obsidian Sync: Improved how Sync handles changing the casing for folder names (e.g. &quot;some folder&quot; → &quot;Some Folder&quot;).</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Collapsing items in the file explorer will now look visually better (previously the fold indicator of child elements would also appear to collapse as well).</li>\n<li>Bookmarks: Fixed bookmark group not being populated in the <strong>Edit Bookmark</strong> modal.</li>\n<li>Bookmarks: Hover preview no longer immediately hides after opening.</li>\n<li>Bookmarks: Opening a bookmark with &quot;Always focus new tabs&quot; disabled will now still focus the newly created bookmark.</li>\n<li>Spellcheck is now enabled when renaming files from the file explorer or from the tab title bar.</li>\n<li>Backlinks: Fixed mod-clicking on backlinks not respecting the &quot;Always focus new tabs&quot; preference.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>App will no longer show errors when plugins don't provide a &quot;Component,&quot; to renderMarkdown, they will now just show a warning.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":3,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>All new PDF viewer.</li>\n</ul>\n<img alt=\"pdf-viewer\" src=\"https://github.com/obsidianmd/obsidian-help/assets/693981/2187e955-3c4c-436e-a590-b0623cab65e7\">\n<h2>Improvements</h2>\n<ul>\n<li>Clicking on links in a pinned tab will now open a new tab instead of reusing a random existing tab.</li>\n<li>Bookmarks: Added new &quot;Bookmark this block&quot; menu item when right-clicking on a block ID.</li>\n<li>Bookmarks: Bookmark view will now show an error state if the bookmarks.json file is malformed or corrupted.</li>\n<li>Spellcheck is now enabled by default in new vaults.</li>\n<li>Inline titles now have spellcheck enabled.</li>\n<li>When <strong>Auto convert HTML</strong> is enabled, HTML tables will now be converted to markdown tables on paste.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed slower performance of live preview when using popout windows on a secondary monitor.</li>\n<li>Fixed opening files from File Explorer not giving focus to the new tab if &quot;Always focus new tab&quot; is turned off.</li>\n<li>Fixed issue with multiple cursors having the incorrect selection color.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Updated PIXI.js to v7.2.4.</li>\n<li>Updated Turndown to 7.1.2.</li>\n<li>Updated Mathjax to v3.2.2.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":3},"info":"<h2>Breaking changes</h2>\n<ul>\n<li>Removed support for <code>app://local</code> URLs. These were reported as a potential vulnerability when using iframes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>macOS: Text in the &quot;Look up&quot; menu item will now be trimmed to 40 characters.</li>\n<li>Bookmarks: New unnamed groups will now be called &quot;Untitled group&quot; instead of &quot;Untitled folder&quot;</li>\n<li>Bookmarks: Bookmark context menu items will now also refer to &quot;Bookmark groups&quot; instead of &quot;folders&quot; to avoid confusion.</li>\n<li>Bookmarks: Bookmark group must always have a title.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fixed issue with <code>navigator.clipboard</code> API not working in popout windows.</li>\n<li>If you were relying on <code>app://local</code> for functionality within your plugin, you should use <code>vault.getResourcePath(file: TFile)</code> and <code>vault.adapter.getResourcePath(vaultPath: string)</code> as a replacement. These also works on mobile.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":4,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2023,"month":5,"day":2},"info":"<ul>\n<li>Includes all new functionality and bug fixes up to <a href=\"https://forum.obsidian.md/t/obsidian-release-v1-2-6-insider-build/58686\">Obsidian Desktop v1.2.6</a>.</li>\n<li>Added Bookmarks core plugin and removed Starred core plugin.</li>\n<li>Android: Fixed bug where Bluetooth keyboard could cause the app to restart.</li>\n<li>Android: Fixed bug preventing files from being dragged in the file explorer due to the context menu appearing.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":5,"day":2},"info":"<p>In this update, we revisited some of our older core plugins and provided more than just a fresh coat of paint. Most notably, the Starred plugin is going away in favor of its successor: Bookmarks.</p>\n<ul>\n<li><a href=\"#bookmarks\">Bookmarks</a> — Meet the replacement to the Starred plugin.</li>\n<li><a href=\"#search-ui-improvements\">Search UI improvements</a> — The global search UI has undergone a refresh.</li>\n<li><a href=\"#hotkey-settings-improvements\">Hotkey settings improvements</a> — Filter your hotkeys by assigned, unassigned. Even search by hotkey.</li>\n<li><a href=\"#misc-improvements\">Misc. improvements</a> — Improvements to the quick switcher as well as new commands for controlling tabs.</li>\n</ul>\n<h2>Bookmarks</h2>\n<p>The Starred core plugin is going away. Introducing: <strong>Bookmarks</strong>.</p>\n<p>Bookmark just about anything in Obsidian: files, folders, graphs, searches, headings, blocks. Organize your bookmarks in the much more robust <strong>Bookmark view</strong>. Reorder bookmarks with drag-and-drop. Create <em>Bookmark Groups</em> to organize your bookmarks into collapsible sections.</p>\n<h2>Search UI improvements</h2>\n<img alt=\"new-search-ui\" src=\"https://user-images.githubusercontent.com/693981/228591430-6583bd93-f289-4ebb-ad5e-471db25f808e.png\">\n<p>We've reorganized the Search UI to make things more intuitive and make room for more options. Like being able to bookmark search queries right from here:</p>\n<img alt=\"bookmark-search-ui\" src=\"https://user-images.githubusercontent.com/693981/228591803-06d2bb79-8192-427b-8c6e-daaef08c84ec.png\">\n<h2>Hotkey settings improvements</h2>\n<h3>New filtering options</h3>\n<img alt=\"hotkey-filtering-options\" src=\"https://user-images.githubusercontent.com/693981/228592343-74ad4f95-3efe-409e-8f3e-435b3741e334.png\">\n<h3>Search by hotkey</h3>\n<img alt=\"search-by-hotkey-ui\" src=\"https://user-images.githubusercontent.com/693981/228592415-db073fdd-5140-4c99-bd2d-1e7b6d419a42.png\">\n<h2>Misc. improvements</h2>\n<ul>\n<li>Added Editor setting to open new tabs in the background.</li>\n<li>Suggest modals now support &quot;page down&quot; and &quot;page up&quot; as well as &quot;home&quot; and &quot;end&quot;  keys for faster keyboard navigation.</li>\n<li>Links with folder paths will now automatically insert an alias to the base filename (e.g. <code>[[folder/file]]</code> will expand to <code>[[folder/file|file]]</code>)</li>\n<li>Added &quot;Close tab group&quot; command as well as option to close a tab group from the tab group dropdown menu.</li>\n</ul>\n<h2>Bug fixes</h2>\n<ul>\n<li>Canvas: Fixed query blocks not rendering in text cards.</li>\n<li>Export to PDF will now always export in &quot;light mode.&quot;</li>\n<li>Fixed slider tooltip overlapping with cursor.</li>\n<li>macOS: Fixed Export to PDF rendering the wrong font.</li>\n<li>Fixed folding arrows being misaligned on list items.</li>\n<li>macOS: double-clicking the sidebar close buttons in the window frame will no longer trigger the window getting fullscreened.</li>\n<li>Fixed &quot;Fold more&quot; command not folding the current line if the cursor is on top of a heading.</li>\n</ul>\n","major_release":true},{"version":{"major":1,"minor":2,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":5,"day":2},"info":"<h2>Improvements</h2>\n<ul>\n<li>Added new command &quot;Create new note in current tab.&quot;</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Bookmarks: Better handling of bookmarks when syncing across devices. Should fix issues reported of bookmarks disappearing when using Obsidian Sync.</li>\n<li>Canvas: Fixed two-finger pinching when default wheel behavior is set to &quot;zoom.&quot;</li>\n<li>The &quot;rename&quot; modal will no longer report the rename as successful if the rename failed.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":4,"day":26},"info":"<p><strong>Important:</strong> Now that Bookmarks are available on mobile, the starred core plugin has officially been removed.</p>\n<h2>Improvements</h2>\n<ul>\n<li>The ribbon context menu will now show the ribbon icons next to each menu item to make it easier to identify which ribbon items are enabled/disabled.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Bookmarks: Fixed bookmarks view not saving what bookmark groups are collapsed.</li>\n<li>Bookmarks: Fixed the positioning of the bookmark view's &quot;no bookmarks&quot; message.</li>\n<li>macOS: &quot;Look up&quot; context menu item will now show a max of 40 characters.</li>\n<li>Android: Fixed bug where file explorer could not drag files due to the context menu appearing.</li>\n<li>Canvas: Fixed bug where pressing &quot;edit&quot; didn't always zoom in far enough to edit the file.</li>\n<li>Fixed bug where sometimes it was impossible to drag files into a similarly named folder.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":4,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>Publish: Added option to customize the navigation items in your Publish sidebar.</li>\n<li>Improved Live Preview rendering performance when scrolling quickly in longer Markdown files.</li>\n<li>Templates: If there is only one template in your templates folder, &quot;Insert template&quot; will no longer automatically insert the text. The behavior will now be consistent and a suggest will be shown.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>File Explorer: Fixed view not properly restoring the collapse state of folders when reopening Obsidian.</li>\n<li>Mermaid: improved colors for state diagram.</li>\n<li>Reading Mode: Pressing <code>Ctrl/Command+F</code> will now always refocus the search input even if it's already showing.</li>\n<li>Fixed &quot;Focus on tab group&quot; commands not working properly in pop-out windows.</li>\n<li>Templates: Fix <code>and</code> not resolving correctly within templates.</li>\n<li>Search: Operators such as <code>tag:</code> and <code>block:</code> will now work even if the operator is not lowercase (i.e. <code>TAG:</code>).</li>\n<li><code>Ctrl-M</code> will no longer minimize Obsidian on Windows.</li>\n<li>The vim Codemirror extension has been updated to include all the latest upstream fixes and patches.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":4,"day":14},"info":"<h2>Improvements</h2>\n<ul>\n<li>Outline view: Markdown formatting is now stripped.</li>\n<li>Bookmarks now appear in the quick switcher.</li>\n<li>Bookmarks: The file context menu will now say &quot;Edit bookmark&quot; if the bookmark already exists.</li>\n<li>Bookmarks: Added new commands to bookmark headings and blocks under the cursor.</li>\n<li>Hotkeys: Clicking on a hotkey with a conflict will now filter the hotkey list to show all the commands matching with that hotkey.</li>\n<li>The command &quot;move current file to another folder&quot; now allows for creating new folders that don't exist.</li>\n<li>macOS: Added context menu item to show the macOS Lookup window for the selected text.</li>\n<li>Bookmarks: The Bookmarks view can now be closed from the tab context menu. Run the command &quot;Show bookmarks&quot; to reopen the view.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li><code>Ctrl-M</code> will no longer minimize Obsidian on Windows.</li>\n<li>Added missing styling to Live Preview for bolded, italic text.</li>\n<li>Escaped characters (characters proceeded by <code>\\</code>) will no longer receive special styling.</li>\n<li>Bookmarks: Opening multiple bookmarks will no longer create empty tabs.</li>\n<li>Template: An notice will be shown when running &quot;Insert template&quot; command and no templates file is set.</li>\n<li>Bookmarks: Items can now be dragged out of the bookmark view into tabs to open them.</li>\n<li>Bookmarks: File bookmarks can now be dropped into an editor to insert a link.</li>\n<li>Bookmarks: Links can now be dragged into the Bookmarks view to save them.</li>\n<li>Bookmarks: Headings from the Outline view can be dragged into the Bookmarks view to save them.</li>\n<li>Bookmarks: Added missing &quot;open to the right&quot; menu item in the bookmark context menu.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Bookmarks: Added the full bookmark path as a <code>data-path</code> attribute for custom styling.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":4,"day":4},"info":"<h2>Improvements</h2>\n<ul>\n<li>Bookmarks: Supports middle-click to open bookmarks in a new tab.</li>\n<li>Bookmarks: Hover preview now only shows the current heading for bookmarked headings.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug causing broken links to be created when renaming a file break when renaming files without display text.</li>\n<li>Hotkeys: Fixed bug causing custom hotkeys to not be displayed even when they match the current filter selection.</li>\n<li>Bookmarks: Fixed drag and drop sometimes dropping items in the wrong position.</li>\n<li>Bookmarks: Fixed dragging and dropping multiple items causing the item order to change.</li>\n<li>Bookmarks: Fixed bookmarks inside groups not showing their updated title on edit.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":3,"day":31},"info":"<h2>Improvements</h2>\n<ul>\n<li>Publish: The &quot;Manage included folders&quot; and &quot;Manage excluded folders&quot; options will now filter out already selected folders.</li>\n<li>Bookmarks: Updated drag and drop behavior to create a <em>bookmarked folder</em> when dragging a folder from the File Explorer to the Bookmarks view.</li>\n<li>Bookmarks: Added page preview support on hover.</li>\n<li>Editor: Renaming files will now rename the file alias if it matches the file name.</li>\n<li>App: Added &quot;Close others in tab group&quot; command to close all tabs in the tab group except the current one.</li>\n<li>App: Added &quot;Make copy of current file&quot; command.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>App: &quot;Export to PDF&quot; will now respect when a custom font is configured.</li>\n<li>Search: Sort order is now properly restored on workspace load.</li>\n<li>Tags: Fixed tags not being sorted when changing the sort option in the Tag view.</li>\n<li>Tags: Fixed tags not preserving their fold</li>\n<li>Hotkeys: Fixed hotkeys not always applying filter.</li>\n<li>Hotkeys: Can no longer set hotkeys to be <code>Shift</code> + A-Z.</li>\n<li>Hotkeys: Hotkeys that use <em>Space</em> will now be displayed correctly.</li>\n<li>Bookmarks: Fixed drag and drop behavior where items could be moved to the wrong position.</li>\n<li>Bookmarks: Drag and drop is now easier to drag items between two folders.</li>\n<li>Bookmarks: Improved migration from Starred so that stale files that no longer exist and mismatched Starred file titles won't be migrated over.</li>\n<li>Starred: Fixed view not being scrollable.</li>\n<li>Starred: Fixed items missing hover styling.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":2,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":3,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Added new Bookmarks core plugin. This core plugin will be the successor to the Starred core plugin. It offers additional functionality such as bookmarked graphs and bookmarked headings. As well as better organization via drag-and-drop and <em>Bookmark groups</em>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Search: New UI for toggling search options.</li>\n<li>Hotkey settings: Added menu to filter hotkeys by assigned, unassigned. Added button to filter by hotkey.</li>\n<li>Added Editor setting to open new tabs in the background.</li>\n<li>Links with folder paths will now automatically insert an alias to the base filename (e.g. <code>[[folder/file]]</code> will expand to <code>[[folder/file|file]]</code>)</li>\n<li>Added &quot;Close tab group&quot; command.</li>\n<li>Suggest modals now support &quot;page down&quot; and &quot;page up&quot; as well as &quot;home&quot; and &quot;end&quot;  keys for faster keyboard navigation.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: Fixed query blocks not rendering in text cards.</li>\n<li>Export to PDF will now always export in &quot;light mode.&quot;</li>\n<li>Fixed slider tooltip overlapping with cursor.</li>\n<li>macOS: Fixed Export to PDF rendering the wrong font.</li>\n<li>Fixed folding arrows being misaligned on list items.</li>\n<li>macOS: double-clicking the sidebar close buttons in the window frame will no longer trigger the window getting fullscreened.</li>\n<li>Fixed &quot;Fold more&quot; command not folding the current line if the cursor is on top of a heading.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":16,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":3,"day":1},"info":"<h2>No longer broken</h2>\n<ul>\n<li>&quot;Zoom in&quot; and &quot;Zoom out&quot; commands now respect the same min and max zoom levels in <strong>Settings → Appearance</strong>.</li>\n<li>Canvas: fixed outline view and local graph view not updating to match the selected file card.</li>\n<li>Canvas: improved canvas performance when setting a large background image.</li>\n<li>Canvas: fixed images images inside embedded file cards not having the correct width.</li>\n<li>Canvas: fixed &quot;remove background image&quot; not properly saving.</li>\n<li>Fixed issue where native context menu does not appear in the correct location when window zoom is not 100%.</li>\n<li>Canvas: fixed issue with rendering invalid frontmatter section.</li>\n<li>Canvas: added message when trying to export an empty canvas.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2023,"month":2,"day":22},"info":"<p>This update primarily focuses on Canvas improvements and overall bug fixes within the app.</p>\n<ul>\n<li><a href=\"#canvas-improvements\">Canvas improvements</a> — Canvas settings, readonly mode, global search results, and more.</li>\n<li><a href=\"#bugfixes\">Bugfixes</a> — fixes for Export to PDF, mermaid graph colors, and list numbering.</li>\n</ul>\n<h2>Canvas improvements</h2>\n<p>We've made a lot of improvements to Canvas since its initial release.</p>\n<h3>Arranging cards</h3>\n<p>Arranging cards on your canvas is now easier than ever. You can now resize multiple cards at once by dragging from the selection box. You can also <em>nudge</em> selected cards in any direction by pressing the arrow keys.</p>\n<p><img src=\"https://user-images.githubusercontent.com/693981/220686409-b09002a7-ba40-42df-a76e-79d513bd8526.gif\" alt=\"resize-multiple-cards\"></p>\n<h3>Readonly mode</h3>\n<p>Once you have your cards arranged exactly how you like them, you can use the new <strong>readonly mode</strong> to lock your canvas content in place. While in readonly mode, a canvas and its contents cannot be modified.</p>\n<h3>Canvas settings</h3>\n<p>There is now a settings page for Canvas with the following configuration options:</p>\n<ul>\n<li>Default location for new canvas files.</li>\n<li>Use scroll wheel zoom instead of pan.</li>\n<li>Options to hide the card labels.</li>\n<li>Global setting for &quot;snap to grid&quot; and &quot;snap to objects.&quot;</li>\n<li>Configurable zoom threshold for when cards switch from showing their content to just showing the card title.</li>\n<li>Configurable behavior of <code>Ctrl/Command + Drag</code>.</li>\n</ul>\n<h3>Global search support</h3>\n<p>Content from text cards will now appear as search results in the global search view.</p>\n<h3>Background images for Canvas groups</h3>\n<p>Canvas groups can now have a background image associated with them. With a group selected, press the new &quot;set background&quot; button and choose an image from your vault.</p>\n<p>The image can be set to cover the entire group or be used as a repeating pattern.</p>\n<h3>Jump to group</h3>\n<p>The new &quot;Jump to group&quot; command allows you to search for groups in your open Canvas by name. Selecting a group will quickly pan the viewport to that group.\nSome other notable improvements to Canvas:</p>\n<h3>Narrow to block</h3>\n<p>Similarly to the &quot;Narrow to heading...&quot; feature, there is now a &quot;narrow to block&quot; menu item for file cards in the Canvas. Just right-click on a file card and choose &quot;Narrow to block...&quot; to see a list of all blocks in the given file. Selecting a block from the list will change the card to only display the contents of that block.</p>\n<h2>Bug fixes</h2>\n<ul>\n<li>Deleting a file now closes its tab if there are other tabs in the tab group.</li>\n<li>Obsidian Sync's settings page will now warn you if your vault is in Dropbox, iCloud, or OneDrive. Using multiple sync providers can lead to data conflicts.</li>\n<li>&quot;Follow link under cursor&quot; commands will now create a new canvas file if the linked canvas (i.e. <code>[[dashboard.canvas]]</code>) doesn't exist. Previously a Markdown file called <code>dashboard.canvas</code> would get created.</li>\n<li>Removed the redundant 🔗 icon from the tab header for linked tabs.</li>\n<li>Fixed LaTeX syntax highlighting.</li>\n<li>Fixed Mermaid gitgraph colors.</li>\n<li>Fixed bug where embeds and code blocks in Live Preview were not properly unloaded when switching files.</li>\n<li>Fixed context menu position when using &quot;Show context menu under cursor&quot; command while &quot;native menus&quot; is enabled.</li>\n<li>Fixed bug with &quot;fold less&quot; command not unfolding content on the selected line.</li>\n<li>File BOM will now automatically be stripped when Obsidian reads a file.</li>\n<li>When editing at the bottom of the window, the view will now scroll to have enough room to show the current line of text above the status bar.</li>\n<li>Fixed an issue where dragging tabs around the workspace sometimes causes an image in your clipboard to get pasted into the open editor.</li>\n<li>Color inputs now have a focus state when selected via the keyboard.</li>\n<li>Improved Mermaid text colors.</li>\n<li>The vim Codemirror extension has been updated to include all the latest upstream fixes and patches.</li>\n<li>Code blocks in Live Preview now show a copy icon if there is no language set.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":15,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":2,"day":22},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: Fixed canvas settings not showing previously saved new file path.</li>\n<li>Search: Fixed <code>file:</code> operator not working for canvas files.</li>\n<li>Fixed export to PDF not inheriting cssclass in frontmatter.</li>\n<li>Fixed export to PDF error out when downscaling too much.</li>\n<li>The &quot;excluded files&quot; selector no longer allows you to accidentally add an empty entry.</li>\n<li>Fixed some more color issues for mermaid graphs.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":14,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":2,"day":16},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed issue where searching with an operator (e.g. &quot;tag:&quot;) would cause all canvas files to show in search results.</li>\n<li>Canvas: Fixed selection box appearing behind a Canvas group's background image.</li>\n<li>Canvas: Fixed issue where clicking a link in a canvas would sometimes fail and cause an error message to be shown.</li>\n<li>Canvas: The placeholder image no longer flashes on screen when opening or closing a canvas file.</li>\n<li>Canvas: Fixed group background images not appearing if the file path contained parentheses.</li>\n<li>Canvas: Fixed issue where embedded web pages could access privacy-related APIs like microphone or send desktop notifications.</li>\n<li>Code blocks in Live Preview now show a copy icon if there is no language set.</li>\n<li>macOS: Fixed issue where scrollbars would sometimes appear when using &quot;print to PDF.&quot;</li>\n<li>macOS: &quot;Print to PDF&quot; will now use <strong>Inter</strong> by default to fix the issue where copying and pasting text in the generated PDF would appear reversed.</li>\n<li>Fixed an issue where dragging tabs around the workspace sometimes causes an image in your clipboard to get pasted into the open editor.</li>\n<li>Color inputs now have a focus state when selected via the keyboard.</li>\n<li>Improved Mermaid text colors.</li>\n<li>The vim Codemirror extension has been updated to include all the latest upstream fixes and patches.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>The Lucide icon library has been upgrade to v0.114.0 meaning there are new icons available to be used.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":13,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":2,"day":13},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Canvas: Content from text cards will now appear as results in global searches.</li>\n<li>Canvas: Added support for resizing multiple cards at once.</li>\n<li>Canvas: Added &quot;Readonly&quot; mode for canvases. While in readonly mode, a canvas and its contents cannot be modified.</li>\n<li>Canvas: Groups can now have a background image.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Canvas: Added support for YouTube timestamped links.</li>\n<li>Canvas: Added &quot;convert to file&quot; command to the command palette.</li>\n<li>Canvas: Added new setting to specify the default canvas file location.</li>\n<li>Added a short delay before showing tooltips in the app.</li>\n<li>Canvas: Cards can be resized regardless of zoom level.</li>\n<li>Canvas: Alignment menu is now shown when a group is selected.</li>\n<li>Canvas: recent files and recent attachments are now kept track of separately, so the attachments modal should be filled with more useful options.</li>\n<li>Canvas: improved the behavior of macOS &quot;Smart zoom.&quot; Now double tapping the trackpad will always zoom to the node under the cursor.</li>\n<li>When editing at the bottom of the window, the view will now scroll to have enough room to show the current line of text above the status bar.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug where linking to blocks would autocomplete the full file path even when “shortest path when possible” is set.</li>\n<li>Fixed bug where linking to a heading in the current file would sometimes insert the full path.</li>\n<li>Markdown lists will now properly be renumbered when pressing <code>Enter</code> twice to escape a sublist.</li>\n<li>Canvas: Fixed bug where opening a card in its on tab would not scroll to the correct block or heading.</li>\n<li>Canvas: slightly improved &quot;Export as image&quot; so that it waits for content to be loaded before capturing the image.</li>\n<li>Canvas: Fixed bug where dragging a note into canvas would not properly give focus to the canvas view.</li>\n<li>Canvas: Allow dragging multiple folders from the file explorer into a canvas.</li>\n<li>Obsidian Sync: Added a warning if you keep your vault in a folder that is managed by iCloud that Obsidian Sync and iCloud may conflict with one another.</li>\n<li>&quot;Follow link under cursor&quot; commands will now create a new canvas file if the linked canvas (i.e. <code>[[dashboard.canvas]]</code>) doesn't exist. Previously a Markdown file called <code>dashboard.canvas</code> would get created.</li>\n<li>Removed the redundant 🔗 icon from the tab header for linked tabs.</li>\n<li>Fixed LaTeX syntax highlighting.</li>\n<li>Fixed Mermaid gitgraph colors.</li>\n<li>File explorer: ensure that leading and trailing spaces are always stripped when renaming a file.</li>\n<li>Fixed bug with &quot;fold less&quot; command not unfolding content on the selected line.</li>\n<li>File BOM will now automatically be stripped when Obsidian reads a file.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":12,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":1,"day":12},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug where linking to heading would insert the full file path even when &quot;shortest path when possible&quot; is set.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":2,"pre_release":null},"platform":"Mobile","insider":true,"date":{"year":2023,"month":1,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Introducing <strong>Canvas</strong>. You can now lay your notes out in an infinite, spatial canvas.</li>\n</ul>\n<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.1.10. This includes support for <strong>Obsidian Canvas</strong>!</li>\n<li>There is now a new Vault picker in the left sidebar. Tap on the vault name to show a list of your Obsidian vaults for faster switching. Tap &quot;Manage vaults...&quot; to open the vault setup screen.</li>\n<li>Phone only: The ribbon menu in the bottom navigation bar is now configurable. In the Appearance settings, you can now manage the order of the ribbon items as well as specify a &quot;quick access&quot; ribbon item.</li>\n<li>iOS: fixed <code>Command-W</code> closing the entire app instead of closing the current tab.</li>\n<li>iOS: fixed issue where numbered lists were being rendered as bullets.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":11,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":1,"day":10},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed bug where arrow keys would move cards when editor was focused.</li>\n<li>Canvas: fixed bug where card position was not properly saved after moving a card via arrow keys.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":10,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2023,"month":1,"day":10},"info":"<h2>Improvements</h2>\n<ul>\n<li>Deleting a file now closes its tab if there are other tabs in the tab group.</li>\n<li>Obsidian Sync's settings page will now warn you if your vault is in Dropbox, iCloud, or OneDrive. Using multiple sync providers can lead to data conflicts.</li>\n<li>Canvas: Added new &quot;Narrow to block...&quot; menu option. This works the same way as &quot;Narrow to heading&quot; but offers finer grained narrowing options.</li>\n<li>Canvas: New &quot;Jump to group&quot; command allows quickly jumping to a group by name.</li>\n<li>Canvas: You can now nudge selected cards with the arrow keys. Use <code>Shift</code> to move the cards at a greater multiple.</li>\n<li>Canvas: Added a new Canvas settings tab for configuring Canvas preferences for your entire vault. The currently available settings include:\n<ul>\n<li>Use scroll wheel zoom instead of pan</li>\n<li>Options to hide the card labels</li>\n<li>Global setting for &quot;snap to grid&quot; and &quot;snap to objects&quot;</li>\n<li>Configurable zoom threshold for when cards switch from showing their content to just showing the card title</li>\n<li>Configurable behavior of <code>Ctrl/Command + Drag</code></li>\n</ul>\n</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug where embeds and code blocks in Live Preview were not properly unloaded when switching files.</li>\n<li>Fixed bug where large images were not properly scaled in the hover preview popups.</li>\n<li>Canvas: Headings are always visible in narrowed cards regardless of &quot;Show inline titles&quot; preference.</li>\n<li>Fixed context menu position when using &quot;Show context menu under cursor&quot; command while &quot;native menus&quot; is enabled.</li>\n<li>Fixed Markdown tags with underscore not displaying correctly in Live Preview.</li>\n<li>Fixed indented images not rendering properly indented.</li>\n<li>Canvas: Fixed nodes not always loading cards on their correct layers.</li>\n<li>Canvas: Fixed linux middle click.</li>\n<li>Canvas: Fixed bug where dragging cloned nodes were not properly snapping to objects.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Fixed <code>Menu.showAtPosition</code> not working when user has enabled &quot;native menus.&quot;</li>\n<li>Fixed processFrontMatter passing null when frontmatter section is empty, fixed not working with CRLF line endings.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":9,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":12,"day":23},"info":"<p>The installer has been updated to use Electron v21 (requires downloading <a href=\"https://obsidian.md\">the latest installer</a>).</p>\n<h2>No longer broken</h2>\n<ul>\n<li>The page preview popover no longer shows file names twice.</li>\n<li>Canvas: Fixed &quot;reload page&quot; menu item not working consistently.</li>\n<li>File recovery now supports canvas files.</li>\n<li>Prevent <code>obsidian://new</code> URIs from creating folders outside of the vault.</li>\n<li>Prevent external websites embedded in canvas and plugins from opening URI links.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":8,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":20},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: YouTube embeds are now shown at 16:9 instead of square.</li>\n<li>Canvas: Added a &quot;privacy&quot; toggle to the export modal. This will allow you to share the canvas while masking all the text on the cards.</li>\n<li>Canvas: Added a command to export your canvas as an image.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: Auto-resizing file cards now works more reliably.</li>\n<li>Canvas: Fixed bug where pressing undo (<code>Ctrl/Cmd + Z</code>) would undo the file rename in addition to undoing an action on the Canvas.</li>\n<li>Canvas: Fixed issue where creating a new text card does not always zoom in to edit automatically.</li>\n<li>Canvas: Fixed crash when opening a modal while an iframe was focused.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":7,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: Added new alignment options to justify content horizontally or vertically.</li>\n<li>Canvas: the drag handles has been removed from connection lines. Now you can drag from anywhere on the line to move it.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed extra spacing being added to the top of cards.</li>\n<li>Fixed duplicate titles appearing for embedded notes (i.e. <code>![[some note]]</code>).</li>\n<li>Fixed hotkeys acting inconsistently across pop-out windows when a modal was visible.</li>\n<li>Canvas: fixed group label getting truncated while editing.</li>\n<li>Canvas: fixed bug where the file title would stay selected after updating the title. This caused some unexpected behavior when pressing undo (<code>Ctrl/Cmd + Z</code>) or paste (<code>Ctrl/Cmd + V</code>).</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":6,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":16},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: Inline titles now render in file cards when enabled.</li>\n<li>Canvas: Replaced the &quot;Copy screenshot&quot; canvas menu item with a new &quot;export as image&quot; menu option. This will allow you to export either the current viewport or a full high resolution PNG of your canvas.</li>\n<li>Canvas: Embedded canvases now show the connection lines in addition to the card boxes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Renaming a file will no longer cause the current scroll position to be lost.</li>\n<li>Canvas: File-specific options have been removed file card's context menu if the card is narrowed to a specific heading.</li>\n<li>Canvas: Dragging a nested group will no longer try to snap to itself. This was causing some jittering.</li>\n<li>Canvas: fixed &quot;Replace&quot; command not working in canvas file cards.</li>\n<li>Canvas: Fixed an issue where following links from the canvas would prevent editor-specific hotkeys from firing.</li>\n<li>Canvas: Fixed loading a website in a pop-out window causes Obsidian to crash on boot.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":14},"info":"<h2>Improvements</h2>\n<ul>\n<li>Embedded canvases now render a diagram of the underlying canvas. This works for canvases embedded within Markdown files (i.e. <code>![[daily_notes.canvas]]</code>) or embedded on another canvas.</li>\n<li>Canvas: Add new options to distribute vertically/horizontally, stack vertically/horizontally, and auto-organize cards into grid.</li>\n<li>Canvas: The Find/replace menu (<code>Ctrl/Cmd+F</code>) now works inside cards embedded in the canvas.</li>\n<li>Canvas: Web pages now has a menu to open in the browser, you can also <code>Ctrl/Cmd</code>-click the card label.</li>\n<li>Canvas: Slight performance improvements when interacting with larger canvases.</li>\n<li>Canvas: Added &quot;Go to source&quot; and &quot;Go to target&quot; menu items on the connection context menu to quickly jump to nodes.</li>\n<li>Canvas: <code>Ctrl/Cmd</code> + Drag now shows a menu to quickly add a card or create a group where your selection is.</li>\n<li>Canvas: Images, websites, videos, and audio will now always render instead of becoming a grey box when zoomed out.</li>\n<li>Sync: When merging during a sync conflict, the original local version is now stored in File Recovery (if enabled).</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug preventing hotkeys from being set if there is no default hotkey.</li>\n<li>Canvas: Links and embeds inside text cards will now properly get updated when the target files are renamed.</li>\n<li>Canvas: Fixed duplicating groups not copying their children cards.</li>\n<li>Canvas: Fixed bug where opening a new canvas in a hidden tab would occasionally go blank and crash.</li>\n<li>Canvas: Fixed bug causing some websites to crash when moving a canvas view to a popout window.</li>\n<li>Canvas: Fixed issue where websites could not be interacted with in a popout window.</li>\n<li>Canvas: PDFs should be slightly less blurry.</li>\n<li>Canvas: Fixed bug where cards are unable to resize when an adjacent card is touching.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":12},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Canvas: Added &quot;Groups&quot; to canvas. Groups can be thought of as placemats for your cards. They always render below cards and dragging the group label will move all notes in the group at once. To create a group, select multiple cards then right-click and choose 'Create group.'</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Canvas: Improved performance when interacting with large canvases.</li>\n<li>Canvas: On Windows and Linux, you now hold <code>Ctrl</code> to duplicate the selection instead of <code>Alt</code>. On macOS, this is still <code>Option+Drag</code>.</li>\n<li>Canvas: Added right-click and drag to pan around the viewport.</li>\n<li>Canvas: Added 'copy screenshot' menu item.</li>\n<li>Canvas: Added 'reset zoom' button.</li>\n<li>Canvas: Double-clicking the bottom of a card now auto expands it to the size of the contents.</li>\n<li>Canvas: The canvas will always zoom to fit on open.</li>\n<li>Canvas: PDFs and iframes that have been interacted with will stay loaded even when zoomed out.</li>\n<li>Canvas: text cards now have dynamic padding so they shouldn't appear with scrollbars on small sizes.</li>\n<li>Canvas: Web pages now have a label with the site title.</li>\n<li>Canvas: Right-clicking on web pages now gives the option to copy the URL or reload the page.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Canvas: The connection menu will exclude embeds.</li>\n<li>Canvas: Fixed issue where deleted cards and connections would sometimes reappear and be un-selectable.</li>\n<li>Adding a hotkey to a default hotkey no longer results in the default hotkey being removed.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Canvas files are now multi-line formatted when saved. This should make the diffs more human-readable when stored in version control.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":9},"info":"<h2>Improvements</h2>\n<ul>\n<li>Live Preview has been tweaked to avoid flashes of &quot;unstyled&quot; content while scrolling through larger documents.</li>\n<li>Canvas: We have updated how colors work inside of Canvas. The six colors in the color palette are now themeable. There is a new 7th slot with a color picker.</li>\n<li>Canvas: Added a new menu item to paste in a web URL. Right clicking on an existing web page in Canvas now shows an option to change the URL.</li>\n<li>Canvas: YouTube links will now automatically get inserted as Youtube's embed version.</li>\n<li>Canvas: There's a new 'help' button to view all the currently hotkeys available for Canvas.</li>\n<li>Canvas: Dragging a connection line from a file card now shows a menu with all outgoing links to quickly add them as connections.</li>\n<li>Canvas: Added a new 'Narrow...' menu option to file cards. This will narrow the card contents to only the selected heading.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The frontmatter YAML will now always be hidden in reading mode. The &quot;Show frontmatter&quot; toggle now toggles the metadata section.</li>\n<li>macOS: Fixed bug in Canvas where cards would drag when ctrl-clicking.</li>\n<li>Fixed issue when using multiple cursors where an extra cursor would appear in the top right.</li>\n<li>.canvas files now show in the editor link suggest.</li>\n<li>Linux: middle-clicking on the canvas will no longer trigger 'paste.'</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Added a notice when opening a Canvas that fails to parse.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":8},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Canvas: fixed bug where text nodes don't always save their content.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":8},"info":"<h2>Improvements</h2>\n<ul>\n<li>Canvas: 'delete' has been renamed to 'remove' to avoid confusion.</li>\n<li>Canvas: cards can now be dragged by the filename label.</li>\n<li>Canvas: <code>Ctrl/Command</code>-clicking on a filename label will open that file in a new tab.</li>\n<li>Other plugin views should now properly respond to selecting a card in the Canvas. This includes the Outline pane, the Backlinks pane, etc.</li>\n<li>Templates core plugin properly inserts into the canvas editor.</li>\n<li>The viewport will now pan while dragging nodes close to the edge of the screen.</li>\n<li>Pressing <code>Shift-enter</code> inside the file select modal in canvas will now create a file based on your current input (same as the quick switcher behavior).</li>\n<li>Improved appearance of file name modal when using &quot;Convert to file...&quot; Canvas action.</li>\n<li>Increased the max zoom distance in Canvas.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Sync: canvas files will now sync between devices (oops!)</li>\n<li>Canvas: fixed bug causing editor to occasionally lose track of inserted text and cursor position when typing quickly.</li>\n<li>Canvas: connections cannot be drawn from a card back to itself.</li>\n<li>Canvas: fixed issue where shift-clicking on a card would cause the editor to appear in an unfocused card.</li>\n<li>Canvas: fixed text suggest menu not closing when clicking outside of a card.</li>\n<li>Canvas: Fixed dragging links from cards into their own cards.</li>\n<li>Canvas: Fixed dragging links from the embedded canvas editor.</li>\n<li>File explorer: added back missing 'Open in new window' command to the context menu.</li>\n</ul>\n<h2>Developers</h2>\n<p><em>See v1.1.1 in the <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/CHANGELOG.md#v111-2022-12-8--insider-build\">Developer CHANGELOG</a></em>.</p>\n","major_release":false},{"version":{"major":1,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":12,"day":5},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Introducing the <strong>Canvas</strong> core plugin. You can now lay your notes out in an infinite, spatial canvas.</li>\n</ul>\n<img alt=\"canvas-promo\" src=\"https://user-images.githubusercontent.com/693981/205718501-d9fe405b-6684-41c8-a3b3-eb5da73777d2.png\">\n<h2>Improvements</h2>\n<ul>\n<li>Ribbon items can now be rearranged (drag &amp; drop) or hidden (right click on the ribbon for options). Configuration is also available in Settings (<strong>Appearance → <em>Ribbon menu</em></strong>). Note: if you are using an existing plugin to manage the ribbon, this might interfere.</li>\n<li>Plugins can now be sorted by &quot;Recently updated.&quot;</li>\n<li>Added theme version information to the debug modal.</li>\n<li>Added &quot;Close window&quot; command (<code>Ctrl/Command + Shift + W</code>).</li>\n<li>Pressing <code>Shift + Enter</code> in the editor Find Dialog will find the previous instance.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Linux: fixed middle-click to paste.</li>\n<li>'Split' commands will now focus the newly created tab group.</li>\n<li>Fixed issue where File explorer would not always select the right items when using shift-clicking.</li>\n<li>Popout windows will now open with the same zoom level as the main window</li>\n<li>Fixed <code>Home</code> behavior in task lists.</li>\n<li>Moving folders to the Obsidian trash (<code>.trash</code>) will no longer add a trailing <code>.</code></li>\n<li>Fix ordered lists showing as bullets.</li>\n<li>Plugin gallery will no longer cache the results if there's no internet connection.</li>\n<li>macOS: fixed issue with spell check replacing the wrong word on the same line.</li>\n<li>Improved styling of text when the accent color is lighter than a certain threshold.</li>\n<li>Fixed &quot;Fold more&quot; and &quot;Fold less&quot; commands not working properly on list items.</li>\n<li>The File explorer will no longer capture arrow key events when modifier keys are used. This was breaking hotkeys such as <code>Ctrl + Shift + →</code>.</li>\n<li>Fixed issue with folds in Reading mode getting unfolded when creating a new tab.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>We have added a <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/CHANGELOG.md\">Developer CHANGELOG</a> to our API repo. Moving forward, we will keep developer-facing changes cataloged here.</li>\n<li>Canvas uses a new JSON-based file format, <a href=\"https://github.com/obsidianmd/obsidian-api/blob/master/canvas.d.ts\">see the spec</a>.</li>\n<li>Added new metadata APIs.</li>\n<li>Added macOS calendar entitlements.</li>\n<li>Added support for <code>fundingUrl</code> in the plugin manifest. The donation URL will be shown in the plugin gallery entry.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":1,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":10,"day":26},"info":"<h2>Core update</h2>\n<ul>\n<li>Includes all new functionality and bug fixes up to Obsidian Desktop v1.0.</li>\n<li>Ongoing UI overhaul with an emphasis on making the app more responsive and mobile-friendly.</li>\n<li>Phone-only: New bottom navigation bar includes forward/back arrows, tab menu, and quick access to your ribbon items.</li>\n<li>Phone-only: The left ribbon bar has been removed from the left sidebar. It is now accessible as a menu in the navigation bar. Tap to activate your most recent action. Tap and hold to see a list of all ribbon items.</li>\n<li>Tabs can now be used on both tablets and phones. On phones, tabs can be accessed with the button on the navigation bar.</li>\n<li>Phone-only: Added haptic feedback for the context menu and pull-down menu.</li>\n<li>Tablet-only: Some interface elements like menus and popups will now use the desktop version since there's sufficient space on tablets.</li>\n<li>Long-press links in Live Preview to show context menu.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":26},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed vim mode <code>gj</code> on the last line jumps up.</li>\n<li>Fixed numbered lists in unordered lists not rendering the number.</li>\n<li>Fixed long lines in sub-bullets adds jumping padding.</li>\n<li>Fixed some rendering issues with translucency.</li>\n<li>Fixed artifacts in tabs on Linux.</li>\n<li>Removed Github fallback CDN which is no longer in operation.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Linux: fixed bug causing Obsidian to not boot.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":20},"info":"<h2>No longer broken</h2>\n<ul>\n<li>macOS: Double-clicking the tab bar now maximizes the window in frameless mode.</li>\n<li>Linux: &quot;Adapt to system theme&quot; now works properly.</li>\n<li>The keyboard shortcut for rectangular selection has changed. Now alt-click will add multiple cursors while alt-shift-drag will create a rectangular selection.</li>\n<li>Theme dropdown properly refreshes when changing the theme in settings.</li>\n<li>Update buttons properly refresh after updating the plugin via the plugin modal.</li>\n<li>Removed duplicate drag element that appeared when dragging tabs.</li>\n<li>Fixed checkboxes not being selectable in Live Preview.</li>\n<li>Fixed selections from multiple cursors not appearing.</li>\n<li>Fixed bug where the wrong file could get renamed if you switch files mid-rename.</li>\n<li>Vim: Fixed <code>gj</code> and <code>gk</code> not working.</li>\n<li>Fixed empty lists getting collapsed in reading mode.</li>\n<li>macOS: spellcheck now properly replaces word even when no text is selected.</li>\n<li>The root folder in the File Explorer is no longer collapsible via the keyboard.</li>\n<li>Editor commands no longer trigger if the inline title is focused.</li>\n<li>Fixed alt-clicking multiple selections not behaving correctly.</li>\n<li>Fixed opening vaults via <code>obsidian://vault</code> not properly marking other vaults as closed.</li>\n<li><code>webm</code> embeds are now properly recognized as video instead of audio.</li>\n<li>Fixed long suggestion titles not wrapping properly.</li>\n<li>Added missing search icon to graph view.</li>\n<li>Unique note creator: app no longer freezes when attempting to generate an invalid format.</li>\n<li>Graph View: dragging a node is now canceled when you start panning the canvas.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Clicking on gutter elements now properly fires click events.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":4,"patch":0,"pre_release":null},"platform":"Mobile","insider":false,"date":{"year":2022,"month":10,"day":19},"info":"<h2>Improvements</h2>\n<ul>\n<li>Misc. visual improvements for settings.</li>\n<li>Larger font sizes and better contrast for sidebar items.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Mobile drawers can no longer be pinned on mobile.</li>\n<li>iOS: fixed issue where app would freeze when clicking backlinks.</li>\n<li>Tablet: The toggle button for the left sidebar is now visible again.</li>\n<li>iOS: fixed bug preventing cursor from selecting links in Live Preview.</li>\n<li>Fixed &quot;Edit link&quot; context menu item not selecting text.</li>\n</ul>\n","major_release":false},{"version":{"major":1,"minor":0,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":10,"day":13},"info":"<h2>Before you dive in</h2>\n<p>We've made some big changes both visually and under the hood for this release. If you rely on any third party plugins or themes, we highly encourage you to <strong>check for updates</strong> <em>before</em> delving into Obsidian 1.0.</p>\n<ul>\n<li><strong>Settings → Appearance → <em>Check for Updates</em></strong>.</li>\n<li><strong>Settings → Community plugins → <em>Check for Updates</em></strong>.</li>\n</ul>\n<p>This update includes significant changes to the look and feel of Obsidian. Some of the highlights include:</p>\n<ul>\n<li><a href=\"#tabs\">Tabs</a> – The workspace now supports tabs. To accommodate tabs, we've made a lot of tweaks to Obsidian behaviors.</li>\n<li><a href=\"#tab-stacks\">Tab stacks</a> – an alternative way to view your tabs, reminiscent of <a href=\"https://notes.andymatuschak.org/\">Andy Matuschak's website</a>.</li>\n<li><a href=\"#new-appearance-settings\">New appearance settings</a> – Obsidian has gone through an extensive redesign process to make the interface more robust, accessible, and easier to tinker with.</li>\n<li><a href=\"#additional-improvements\">Tons of other misc. improvements</a> – New 'fold' commands, an overhauled Theme Gallery, and bug fixes galore!</li>\n</ul>\n<p>Make sure to take a look at the <a href=\"#faq\">FAQ section</a> which should address some common points of confusion as you adapt to the new Obsidian.</p>\n<h2>Tabs</h2>\n<p>With this update, we have embraced <strong>tabs</strong> throughout the UI. We've found that tabs provide a more intuitive experience for both browsing and editing notes in your vault.</p>\n<p>Tabs have had us rethinking some of the most basic interactions with Obsidian. We have taken this opportunity to consolidate the hotkeys for opening files. Combine these modifier keys when clicking on any link in Obsidian (this includes the quick switcher!) or use them with <kbd>Enter</kdb> to navigate the link under the cursor.</p>\n<table>\n<thead>\n<tr>\n<th>Action</th>\n<th>MacOS</th>\n<th>Windows/Linux</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Navigate</strong></td>\n<td><em>None</em></td>\n<td><em>None</em></td>\n</tr>\n<tr>\n<td><strong>New Tab</strong></td>\n<td><kbd>⌘</kbd> (+ <kbd>Shift</kbd> in Source Mode)</td>\n<td><kbd>Ctrl</kbd> (+ <kbd>Shift</kbd> in Source Mode)</td>\n</tr>\n<tr>\n<td><strong>New Tab Group</strong></td>\n<td><kbd>⌘</kbd><kbd>⌥</kbd></td>\n<td><kbd>Ctrl</kbd><kbd>Alt</kbd></td>\n</tr>\n<tr>\n<td><strong>New Window</strong></td>\n<td><kbd>⌘</kbd><kbd>⌥</kbd><kbd>Shift</kbd></td>\n<td><kbd>Ctrl</kbd><kbd>Alt</kbd><kbd>Shift</kbd></td>\n</tr>\n</tbody>\n</table>\n<p>Tabs have also inspired some changes to how users browse their vaults. It felt only natural that we also introduce <strong>per-tab history</strong>. Each tab now maintains its own history for navigation.</p>\n<p><img src=\"https://user-images.githubusercontent.com/693981/191052493-8109f1a1-411c-4b61-b435-788d0cac3231.png\" alt=\"per-tab history\"></p>\n<h2>Tab stacks</h2>\n<p>You can now switch any tab group in your workspace into a <em>tab stack</em>. Tab stacks provide an alternative way to view your tabs, reminiscent of Andy's Mode.</p>\n<p><img src=\"https://user-images.githubusercontent.com/693981/188205363-0f24b2a5-3706-4a8c-b38b-7a66baa68ce6.gif\" alt=\"tab-stacks\"></p>\n<p><em>Tab stacks</em> are, at their heart, the same as a tab group. Try mixing and matching with a tab group on one side and a tab stack on the other.</p>\n<h2>New appearance settings</h2>\n<p>We've introduced quite a few new settings at <strong>Settings → Appearance</strong>.</p>\n<table>\n<thead>\n<tr>\n<th>Setting</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Show inline title</strong></td>\n<td>Notes now display the full note title inline with the note contents as an <em>Inline Title</em>. You can disable this in settings</td>\n</tr>\n<tr>\n<td><strong>Show tab title bar</strong></td>\n<td>Show or hide the title bar at the top of very tab.</td>\n</tr>\n<tr>\n<td><strong>Window frame style</strong></td>\n<td>By default, the UI is now in <em>Frameless</em> mode. The window title is hidden. In settings, you can choose between the new frameless mode, the custom Obsidian frame (old default), and using the native OS window frame.</td>\n</tr>\n<tr>\n<td><strong>Accent color</strong></td>\n<td>There's now an &quot;accent color&quot; color-picker to give your vault its own unique style. Theme support may vary.</td>\n</tr>\n<tr>\n<td><strong>Zoom level</strong></td>\n<td>Controls the overall zoom level of the app.</td>\n</tr>\n<tr>\n<td><strong>Native menus</strong></td>\n<td>Menus will be rendered to match the context menus provided by the operating system. Enabled by default on MacOS.</td>\n</tr>\n</tbody>\n</table>\n<h2>Additional improvements</h2>\n<ul>\n<li>The Theme Gallery has gotten a major overhaul. Themes now support versioning just like plugins. Note: Themes that are not compatible with 1.0 have been marked as &quot;legacy&quot; and cannot be installed until they get updated.</li>\n<li>Added &quot;collapse all&quot; button to file explorer and tag view.</li>\n<li>Added &quot;Fold more&quot; and &quot;Fold less&quot; commands for folding lines under the cursor.</li>\n<li>Added &quot;Change theme&quot; command for quickly switching between themes.</li>\n<li>Auto-generated links to headings now keep more punctuation characters for better contexts.</li>\n<li>Added &quot;Find &amp; Replace,&quot; Export PDF, Share, and text formatting items to macOS app menu.</li>\n<li>Added <code>Shift + Up/Down</code> hotkeys to expand search results while a search item is focused.</li>\n<li>Renamed &quot;Split vertically&quot; and &quot;Split horizontally&quot; to &quot;Split right&quot; and &quot;Split down&quot; to avoid ambiguity.</li>\n<li>Pressing <code>Home</code> will now move the cursor to the beginning of a list item.</li>\n<li>Obsidian Sync: The history view has a toggle to choose between seeing the version of a file at a point in time or seeing the diff.</li>\n<li>Release notes will now automatically show after Obsidian updates.</li>\n<li>Improved community theme/plugin README.md relative images, added support for videos.</li>\n<li>Renamed &quot;active file&quot; to &quot;current file&quot; in several commands for better consistency.</li>\n<li>Improved the overall appearance of the app when &quot;translucent window&quot; is enabled.</li>\n<li>Soft-wrapping of lines should now better avoid misaligned indents.</li>\n<li>Added an option to Export to PDF to show the name of the note at the beginning of the document.</li>\n<li>Publish: &quot;new&quot; and &quot;unchanged&quot; sections are now collapsed by default.</li>\n<li>Fixed bug with search results containing &quot;path:&quot; sometimes showing duplicate text.</li>\n<li>Fixed multi-line embedded queries not working.</li>\n<li>Fix memory leak with loading native system fonts.</li>\n<li>Fixed crash when file explorer is missing a sort order.</li>\n<li><code>Ctrl/Cmd+W</code> can now close the vault switcher and help window.</li>\n<li>File explorer keyboard navigation properly ignores hidden files.</li>\n<li>Clicking to edit Live Preview widgets (e.g. tables or callouts) will now scroll the view to the beginning of the widget.</li>\n<li>Word count now works for any text file that can be opened, not just <code>md</code> files.</li>\n<li>macOS: &quot;obsidian&quot; will now be capitalized in the App menu.</li>\n<li>macOS: commands will no longer refer to Finder as &quot;System Explorer.&quot;</li>\n<li>macOS: right-clicking on top of the cursor will no longer cause the word under the cursor to be selected.</li>\n<li>Added <code>show-theme</code> action to the Obsidian URI. It will open the given theme in the Community theme gallery. For example: <a href=\"obsidian://show-theme?name=Minimal\">obsidian://show-theme?name=Minimal</a></li>\n</ul>\n<h2>For Developers</h2>\n<ul>\n<li>Workspace information is no longer saved to the <code>.obsidian/workspace</code> file. It is now saved to <code>workspace.json</code>.</li>\n<li>Added standard color picker component.</li>\n<li>Added <code>has-active-menu</code> class to file explorer item that received the right-click.</li>\n<li>Added <code>list-bullet</code> class to HTML markup for unordered list items.</li>\n<li>Theme developers: we have published <a href=\"https://forum.obsidian.md/t/0-16-0-theme-migration-guide/42537\">a guide for helping get your theme ready for 1.0</a>.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Q.</strong> Why am I seeing the title of my note duplicated at the top of my note?</p>\n<blockquote>\n<p>We now display the filename as an <strong>Inline Title</strong> to allow filenames to feel more attached to the note. If you already have the heading of your note matching the filename, you might notice some redundancy. You can disable this feature via <strong>Appearance → <em>Show inline title</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why does everything look so big/small?</p>\n<blockquote>\n<p>The new update has made some changes to make Obsidian feel more native to your operating system. To adjust the overall scale of the UI, you can configure the <strong>UI Zoom</strong> level in Settings at <strong>Appearance → Advanced → <em>Zoom level</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> How do I open notes side-by-side now?</p>\n<blockquote>\n<p>The behavior of <code>Cmd/Ctrl + Enter</code> and <code>Cmd/Ctrl + Click</code> have changed to opening links in a new tab. To open links in a new pane to the right, you can use <code>Cmd/Ctrl + Alt + Enter</code> or <code>Cmd/Ctrl + Alt + Click</code>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why can't I toggle checkboxes with <kbd>Ctrl</kbd><kbd>Enter</kbd> (or <kbd>⌘</kbd><kbd>Enter</kbd> on MacOS) anymore?</p>\n<blockquote>\n<p>The default hotkey for &quot;Toggle checkbox status&quot; has been changed to <kbd>Ctrl</kbd><kbd>L</kbd> (or <kbd>⌘</kbd><kbd>L</kbd> on MacOS). <kbd>Ctrl</kbd><kbd>Enter</kbd> is now the default hotkey for opening links under the cursor in a new tab. You can change these hotkeys in settings.</p>\n</blockquote>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":6},"info":"<h2>No longer broken</h2>\n<ul>\n<li>Fixed lag when switching tabs on larger files.</li>\n<li>Fixed not being able to scroll within plugin details page.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":4,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":10,"day":3},"info":"<h2>No longer broken</h2>\n<ul>\n<li>&quot;Save File&quot; command now works with all text files, not just Markdown files.</li>\n<li>Fixed styling of nested block quotes in live preview.</li>\n<li>Fixed scroll getting reset when rearranging tabs.</li>\n<li>Fixed bug where inline document backlinks would sometimes render with a long scrollbar.</li>\n<li>Live Preview: Fixed bare emails not showing as links when appearing the middle of a line.</li>\n<li>Mermaid: improved rendering.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":3,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":9,"day":19},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Introducing <strong>per-tab history</strong>. Each tab now maintains its own history stack for navigation.</li>\n</ul>\n<p><img src=\"https://user-images.githubusercontent.com/693981/191052493-8109f1a1-411c-4b61-b435-788d0cac3231.png\" alt=\"per-tab history\"></p>\n<p>A huge thank you to <code>@pjeby</code> for Pane Relief and for all his help with testing the new per-tab history!</p>\n<h2>Improvements</h2>\n<ul>\n<li>&quot;Show tab title bar&quot; is now enabled by default. The tab title bar now also includes forward/backward navigation arrows as well as the full file path.</li>\n<li>Soft-wrapping of lines should now better avoid misaligned indents.</li>\n<li>Sliding Panes plugin will now automatically be disabled on startup.</li>\n<li>Added an option to Export to PDF to show the name of the note at the beginning of the document.</li>\n<li>Improved sidebar collapse/expand animation.</li>\n<li>Publish: &quot;new&quot; and &quot;unchanged&quot; sections are now collapsed by default.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Legacy themes are no longer deleted when updating to 0.16 compatible themes. This should improve compatibility when syncing to a device that's not yet 0.16 compatible.</li>\n<li>Fixed pasting into inline titles inside pop-out windows.</li>\n<li>Fixed selecting text inside the Release Notes callouts.</li>\n<li>Pressing 'escape' will no longer cause the editor to lose focus.</li>\n<li>macOS: Command-ArrowLeft will now take you to the beginning of the current list item.</li>\n<li>macOS: Fixed &quot;Show context menu&quot; command not working with spelling corrections.</li>\n<li>Publish: fixed &quot;use live version&quot; not working with locally deleted files.</li>\n<li>Translucency is now disabled in fullscreen mode.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":9,"day":2},"info":"<h2>Shiny new things</h2>\n<p><img src=\"https://user-images.githubusercontent.com/693981/188205363-0f24b2a5-3706-4a8c-b38b-7a66baa68ce6.gif\" alt=\"tab-stacks\"></p>\n<ul>\n<li>Introducing <strong>Tab Stacks</strong>. You can now switch any tab group in your workspace into a <em>tab stack</em>. Tab stacks provide an alternative way to view your tabs, reminiscent of <a href=\"https://notes.andymatuschak.org\">Andy Matuschak's website</a>.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>Improved the overall appearance of the app when &quot;translucent window&quot; is enabled.</li>\n<li>The quick switcher will no longer attempt to reuse an existing tab when opening a file.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Windows: fixed not being able to drag the window when a modal is open.</li>\n<li>Fixed styling issues in the Release Notes view.</li>\n<li>Theme modal will now show legacy themes that you have installed locally.</li>\n<li>Fixed &quot;backlink in document&quot; buttons not working.</li>\n<li>Outline view will only scroll the associated tab instead of all tabs with the same file.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2022,"month":8,"day":31},"info":"<h2>Improvements</h2>\n<ul>\n<li>The setting <strong>Appearance → Show view header</strong> has been renamed to <strong>Appearance → <em>Show tab title bar</em></strong>.</li>\n<li>The setting <strong>Appearance → Title bar style</strong> has been renamed to <strong>Appearance → <em>Window frame style</em></strong>.</li>\n<li>Added &quot;UI zoom level&quot; slider to <strong>Settings → Appearance</strong>.</li>\n<li>Release notes will now automatically show after Obsidian updates.</li>\n<li>Improved community theme/plugin README.md relative images, added support for videos.</li>\n<li>Added default hotkey for opening link in new window (<code>Ctrl/Cmd+Alt+Shift+Enter</code>)</li>\n<li>Improved performance for installing/updating plugins.</li>\n<li>Reduced flashing when searching for plugins.</li>\n<li>Renamed &quot;active file&quot; to &quot;current file&quot; in several commands for better consistency.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed quick switcher's &quot;open to the right&quot; hotkey not working.</li>\n<li>Fixed &quot;Backlink in document&quot; not always updating.</li>\n<li>Fixed file explorer not always highlighting selected files.</li>\n<li>Tweaked sizing and positioning of title bar when zoomed in/out.</li>\n<li>Obsidian Sync will now avoid deleting old themes.</li>\n<li>Fixed misaligned logo in custom mode.</li>\n<li>Fixed status bar jitter when word count updates.</li>\n<li>macOS: Tweaked location of traffic lights when zoomed in/out.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":16,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2022,"month":8,"day":30},"info":"<h2>Note about custom themes</h2>\n<p>Major changes have been made to Obsidian's styling. If you are using a custom theme, make sure you update the theme to the latest version. If you are still seeing visual anomalies, we recommend switching to the default theme for the time being.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>The workspace now supports <strong>Tabs</strong>. To accommodate tabs, we've made a lot of tweaks to Obsidian behaviors.</li>\n<li>Way more than a fresh coat of paint, Obsidian has gone through an extensive redesign process to make the interface more robust, accessible, and easier to tinker with. Internally, we've been calling this new look &quot;Dragonglass,&quot; and we'll be releasing a separate changelog to showcase all the changes that went into it.</li>\n<li>Notes now display the full note title inline with the note contents as an <strong>Inline Title</strong>. The view header is now disabled by default. You can add it back from <strong>Appearance → <em>Show view header</em></strong>.</li>\n<li>By default, the UI is now in <strong>Frameless</strong> mode. The window title is hidden. In settings, you can choose between the new frameless mode, the custom window frame (old default), and using the native OS window frame.</li>\n<li>There's now an &quot;accent color&quot; color-picker in the Appearance settings to give your vault it's own unique style. Theme support may vary.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The Theme Gallery has gotten a major overhaul. Themes now support versioning just like plugins. Note: Themes that are not compatible with 0.16 have been marked as &quot;legacy&quot; and cannot be installed until they get updated.</li>\n<li>We have consolidated the hotkeys for opening new panes.\n<ul>\n<li><code>Ctrl/Cmd + Click</code> on a link will open it in a new tab</li>\n<li><code>Ctrl/Cmd + Alt + Click</code> will open links in a new pane to the right.</li>\n<li><code>Ctrl/Cmd + Alt + Shift + Click</code> will open links in a new window.</li>\n</ul>\n</li>\n<li>Auto-generated links to headings now keep more punctuation characters for better contexts.</li>\n<li>Added &quot;Native menus&quot; to show context menus natively for desktop only.</li>\n<li>Added &quot;collapse all&quot; button to file explorer and tag view.</li>\n<li>Added &quot;Change theme&quot; command for quickly switching between themes.</li>\n<li>Added &quot;Find &amp; Replace,&quot; Export PDF, Share, and text formatting items to macOS app menu.</li>\n<li>Added <code>Shift + Up/Down</code> hotkeys to expand search results while a search item is focused.</li>\n<li>Added &quot;Title bar style&quot; setting for switching between the custom app frame (default) and the OS-native app frame.</li>\n<li>Added &quot;Fold more&quot; and &quot;Fold less&quot; commands for folding lines under the cursor.</li>\n<li>Renamed &quot;Split vertically&quot; and &quot;Split horizontally&quot; to &quot;Split right&quot; and &quot;Split down&quot; to avoid ambiguity.</li>\n<li>Pressing <code>Home</code> will now move the cursor to the beginning of a list item.</li>\n<li>Obsidian Sync: The history view has a toggle to choose between seeing the version of a file at a point in time or seeing the diff.</li>\n<li>Added <code>show-theme</code> action to the Obsidian URI. It will open the given theme in the Community theme gallery. For example: <a href=\"obsidian://show-theme?name=Minimal\">obsidian://show-theme?name=Minimal</a></li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed bug with search results containing &quot;path:&quot; sometimes showing duplicate text.</li>\n<li>Fixed multi-line embedded queries not working.</li>\n<li>Fix memory leak with loading native system fonts.</li>\n<li>Fixed crash when file explorer is missing a sort order.</li>\n<li><code>Ctrl/Cmd+W</code> can now close the vault switcher and help window.</li>\n<li>File explorer keyboard navigation properly ignores hidden files.</li>\n<li>Clicking to edit Live Preview widgets (e.g. tables or callouts) will now scroll the view to the beginning of the widget.</li>\n<li>Word count now works for any text file that can be opened, not just <code>md</code> files.</li>\n<li>macOS: &quot;obsidian&quot; will now be capitalized in the App menu.</li>\n<li>macOS: commands will no longer refer to Finder as &quot;System Explorer.&quot;</li>\n<li>macOS: right-clicking on top of the cursor will no longer cause the word under the cursor to be selected.</li>\n</ul>\n<h2>Developers</h2>\n<ul>\n<li>Workspace information is no longer saved to the <code>.obsidian/workspace</code> file. It is now saved to <code>workspace.json</code>.</li>\n<li>Added standard color picker component.</li>\n<li>Added <code>has-active-menu</code> class to file explorer item that received the right-click.</li>\n<li>Added <code>list-bullet</code> class to HTML markup for unordered list items.</li>\n<li>Theme developers: we have published <a href=\"https://forum.obsidian.md/t/0-16-0-theme-migration-guide/42537\">a guide for helping get your theme ready for 0.16</a>.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Q.</strong> Why am I seeing the title of my note duplicated at the top of my note?</p>\n<blockquote>\n<p>We now display the filename as an <strong>Inline Title</strong> to allow filenames to feel more attached to the note. If you already have the heading of your note matching the filename, you might notice some redundancy. You can disable this feature  from <strong>Editor → Display → <em>Show inline title</em></strong></kbd>.</p>\n</blockquote>\n<p><strong>Q.</strong> Where did the view header with my current view status go?</p>\n<blockquote>\n<p>The view header is hidden by default. You can re-enable it in settings at <strong>Appearance → Advanced → <em>Show tab title bar</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> Why does everything look so big/small?</p>\n<blockquote>\n<p>The new update has made some changes to make Obsidian feel more native to your operating system. To adjust the overall scale of the UI, you can configure the <strong>UI Zoom</strong> level in Settings at <strong>Appearance → Advanced → <em>Zoom level</em></strong>.</p>\n</blockquote>\n<p><strong>Q.</strong> How do I open notes side-by-side now?</p>\n<blockquote>\n<p>The behavior of <code>Cmd/Ctrl + Enter</code> and <code>Cmd/Ctrl + Click</code> have changed to opening links in a new tab. To open links in a new pane to the right, you can use <code>Cmd/Ctrl + Alt + Enter</code> or <code>Cmd/Ctrl + Alt + Click</code>.</p>\n</blockquote>\n","major_release":false}]