[{"version":{"major":0,"minor":8,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":21},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There's now a new Outline plugin, which works in the same way as the backlinks pane. An &quot;unlinked&quot; sidebar pane will show the outline of the current file, while a &quot;linked&quot; pane will always show the outline of the linked pane.</li>\n<li>Open with Default App plugin now also adds &quot;Show in Folder&quot; option which will open the system file manager and highlight the file.</li>\n<li>You can now scroll beyond the last line of the file.</li>\n<li>HTML tags with <code>style</code> properties are now allowed to be added to elements, style all the things!</li>\n<li>HTML <code>iframe</code> tags are now allowed, which can be used to embed various external pages like YouTube, Google Maps, etc.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Graph view now has smoother fading animations when hovering with mouse.</li>\n<li>Search regex now uses multiline mode, which means <code>^</code> will now match beginning of line and <code>$</code> will now match end of line.</li>\n<li>Link auto-complete and quick switcher would match the file name as a priority, instead of always matching the full path. This should improve the match ordering for searcher that contain characters in the parent folder, such as searching for &quot;task&quot; in &quot;test/task.md&quot; which previously matched &quot;[t]est/t[ask]&quot; instead of &quot;test/[task]&quot;.</li>\n<li>The HTML sanitizer is now a lot faster, making large documents more performant.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Switching between edit mode and preview mode no longer loses your scroll position from the top, so you won't have to scroll all the way down again.</li>\n<li>Global search fixes:\n<ul>\n<li>&quot;quoted string&quot; did not properly match full words when containing punctuation or whitespace characters, such as &quot;- [ ]&quot;. It should work now.</li>\n<li>/regex/ previously required two backslashes to escape characters, for example, <code>/\\[\\]/</code> previously didn't work, requiring <code>/\\\\[\\\\]/</code>. Now you don't need to add the second backslash.</li>\n<li>When clicking on a search result, sometimes the highlights were off by a few characters. This was caused by Windows-style line endings &quot;\\r&quot;, and should no longer cause any trouble.</li>\n<li>Search results sometimes didn't show all results when scrolling. Also sometimes the results would flicker and jump around. That should stop happening now.</li>\n<li>Fixed search operator <code>ignore-case:</code> previously made the search case sensitive instead of what it says it does, oops.</li>\n</ul>\n</li>\n<li>Link autocomplete should no longer generates a leading <code>/</code> for relative links.</li>\n<li>Fixed <code>]]</code> not properly styled in headings, which made them appear really small.</li>\n<li>Table headers are now properly aligned using table alignment options.</li>\n<li>Fixed editor horizontal scrollbar hidden behind text, so it could not be interacted with.</li>\n<li>Fixed <code>$$</code> latex blocks couldn't contain single dollar signs <code>$</code>.</li>\n<li>Backlinks pane now no longer cause lag when switching documents in a vault with heavy linking.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":8,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":14},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Major new feature: Search has been massively improved and expanded! Check this out:\n<ul>\n<li>Words in the search query separated by space will be searched independently in each file.</li>\n<li><code>&quot;Quoted strings&quot;</code> can be used to perform full word match. <code>&quot;test&quot;</code> will not match the word <code>testing</code>. Use backslash <code>\\&quot;</code> to escape double quotes and <code>\\\\</code> to escape backslash.</li>\n<li>Regular expressions (regex) can now be used in search. Use forward slash to denote a regular expression. For example: <code>/[a-z]{3}/</code>.</li>\n<li>Boolean operations can now be used. Use <code>OR</code> to match one or another. Use <code>-</code> to negate a query. The space character is used for boolean &quot;and&quot;.</li>\n<li>Parenthesis can be used to group boolean operations. For example <code>(a OR b) (c OR d)</code>.</li>\n<li>Several special operators are available. Some operators allow nesting queries using parenthesis, for example: <code>file:(&quot;to be&quot; OR -&quot;2B&quot;)</code>.\n<ul>\n<li><code>file:</code> will perform the following subquery on the file name. For example: <code>file:&quot;.jpg&quot;</code>.</li>\n<li><code>path:</code> will perform the following subquery on the file path, absolute from the root. For example: <code>file:&quot;Daily Notes/2020-07&quot;</code>.</li>\n<li><code>match-case:</code> and <code>ignore-case:</code> will override the case sensitive match logic for the following subquery.</li>\n</ul>\n</li>\n<li>There are now options in the search interface to provide different types of results:\n<ul>\n<li><code>Collapse results</code> will toggle between just showing matching note names and showing the lines in which matches appear. These extended results can be toggled for each note by clicking on the folding triangle next to the file name.</li>\n<li><code>Match Case</code> will do what it says, but note that it can be overridden on a per-search basis as per above.</li>\n<li><code>Explain Search Terms</code> will show you what the search is actually looking for in plain terms, so you can debug complex searches.</li>\n</ul>\n</li>\n<li>And search results are now optimized to only render results visible in the scrollable box. This means no more lag when there are a lot of search matches.</li>\n<li>You can also star search queries for quick navigation using the &quot;Starred&quot; plugin.</li>\n</ul>\n</li>\n<li>There is a new option for link suggestions to auto-complete paths in relative format, vault-absolute format, or our default &quot;shortest unique path&quot;. This option can be found in Settings &gt; File.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Daily Notes plugin now adds commands to go to previous and next day's note, if they exist. You will only see these in the Command Palette if you are in a daily note. A daily note for these purposes is defined as &quot;matching the date format set in the daily notes plugin settings,&quot; so so any notes that don't use the specified date format won't be navigated to.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Excessive padding for media embeds (images, audio, video) have been slimmed down.</li>\n<li>There was a bug in the recognition of tags with numbers wherein some would be shown as tags in preview but not edit mode. That is fixed now.</li>\n<li>And we fixed the thing where toggle highlight command would just add more <code>==</code> instead of toggling as the name would suggest.</li>\n<li>Mermaid graphs would sometimes have boxes clip the last few letters of the text. That shouldn't happen anymore.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":7,"day":2},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>We now render mermaid diagrams! <a href=\"https://mermaid-js.github.io/mermaid/#/\">Mermaid</a> is a markup language similar to Markdown for producing diagrams and flow charts. The syntax to work with mermaid is a backtick-fenced code block, with the type set to <code>mermaid</code>, like so:</li>\n</ul>\n<pre><code class=\"language-mermaid\">graph TD;\n    A--&gt;B;\n    A--&gt;C;\n    B--&gt;D;\n    C--&gt;D;\n</code></pre>\n<ul>\n<li>There's now folder auto-complete for plugin options that select folders.</li>\n<li>We now auto pair ==highlight== syntax. We've also added a command &amp; hotkey for this, similar to bold and italics.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>We've moved workspace-related ephemeral data from <code>.obsidian/config</code> to its own file <code>.obsidian/workspace</code>.</li>\n<li>When suggesting links, the first item will only be automatically selected if you type at least 1 character.</li>\n<li>Bare URLs without a scheme prefix will no longer be automatically detected as links. Add &quot;https://&quot; for it to be recognized. (For example, <code>obsidian.md</code> vs <code>https://obsidian.md</code>)</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Sometimes trying to auto-link backlinks in &quot;unlinked mentions&quot; could be clicked multiple times producing a <code>[[link]]nk]]nk]]</code>. Thankfully, that no longer happens.</li>\n<li>We fixed LaTeX sometimes hanging the app if <code>$</code> was included in the middle.</li>\n<li>We also fixed LaTeX couldn't include escaped <code>$</code>. You can now do that with <code>\\$</code></li>\n<li>We've optimized HTML rendering to speed up re-rendering for big documents.</li>\n<li><code>Ctrl/Cmd-B</code> and <code>Ctrl/Cmd-I</code> are now customizable.</li>\n<li>Indenting/unindenting using &quot;smart indent lists&quot; should no longer become &quot;NaN.&quot;</li>\n<li>Consecutive links <code>[[link1]][link2]]</code> now links to the correct place in edit mode.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":5,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":7,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>We added a &quot;strict Markdown line break&quot; option for previews, which obeys Markdown's original newline spec. This will cause single line breaks to be ignored.</li>\n<li><code>Ctrl/Cmd-D</code> can now be customized.</li>\n<li>We added new commands for folding/unfolding all lines.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Spellcheck will now ignore URLs and code blocks.</li>\n<li>Spellcheck now has a user dictionary. Right click + <code>Add to dictionary</code> to add. Settings -&gt; Editor -&gt; Spellcheck (gears icon) to remove words from the dictionary.</li>\n<li>Pinning panes will now be applied to the whole group of linked panes.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>&quot;Replace all&quot; can now undo and redo in a single operation.</li>\n<li><code>Ctrl/Cmd-[</code> and <code>Ctrl/Cmd-]</code> no longer override vim mode.</li>\n<li>We added a notice for when saving fails, which could happen if the USB drive containing the vault is ejected.</li>\n<li>We fixed the <code>split pane</code> command and shortcut creating empty panes when current pane was pinned.</li>\n<li>Footnotes now go to the right place. The link destination will now also be highlighted.</li>\n<li>We fixed the bug where front-matter containing the string <code>---</code> could cause the editor to crash.</li>\n<li>Auto-detected URLs in the editor will no longer include the space or period characters after.</li>\n<li>And we fixed &quot;Focus on above/below/left/right pane&quot; option not always finding the correct pane to focus.</li>\n<li>Graph view now stops all activity soon after you stop interacting with it. This should save quite some CPU cycles if you prefer to have a graph open at all times.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":6,"day":20},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>We've added command palette options for navigation between panes (up/down/left/right), as well as open in default app. And, yes, you can make them hotkeys!</li>\n<li>We've also added a command palette, and thus the possibility of hotkeys, for toggling the fold on the current line, as well as swapping lines up and down.</li>\n<li>And there's now a command available to toggle pinning of a pane as well. So many commands!</li>\n<li>Vim mode now has a prompt for <code>:</code>, <code>/</code>, and <code>?</code>.</li>\n<li>Sidebar notes can now be switched between preview and edit using the context menu.</li>\n<li>Also, we have a Spellchecker now! It's only US/English for now, but at least you can spellcheck <em>a</em> language! Turn this on in Settings =&gt; Editor.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li><code>Select all</code> has been removed from the context menu.</li>\n<li>Rename now selects the whole file name.</li>\n<li>We've revamped Automatic update.  Now it checks every hour, has a button to check right away, and has a way to disable automatic updates. THIS WON'T WORK FOR NOW on the insider build because it requires a new installer, so this will only be in the public release.</li>\n<li>We now allow customizing <code>Cmd/Ctrl+K</code>, which was previously reserved for the Markdown editor's insert link.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Search highlighting now shows through code and <code>==</code> highlight.</li>\n<li>We fixed the misalignment of the images in the dmg in MacOS. We know that was very important to some of you.</li>\n<li>There was a very weird Javascript bug wherein a file could not be named &quot;Constructor.&quot; You can now name a file &quot;constructor.&quot; Thanks, Javascript.</li>\n<li>We fixed context menus sometimes getting stuck open.</li>\n<li>We fixed link and tag autocomplete showing up too far on the left.</li>\n<li>And we fixed block LaTeX not being recognized without a newline before it.</li>\n<li>We fixed internal links not working in edit mode when it contains _ or when spellchecker picks up a word.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":6,"day":14},"info":"<h2>No longer broken</h2>\n<ul>\n<li>We fixed an issue where renaming a folder causes all files under it to no longer open in the app.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":2,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":6,"day":13},"info":"<p>Some quick bug fixes on top of 0.7.1.</p>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed backlinks not being updated when files are edited.</li>\n<li>There was another instance of pressing <code>Tab</code> causing the cursor to  jump to another file while editing, that's fixed now too.</li>\n<li>The graph view was getting cut off when sidebar was collapsed, it should now redraw correctly.</li>\n<li>Selection color in preview was being applied incorrectly, now it is right.</li>\n<li>In preview mode code blocks were not aligned properly, now they are.</li>\n<li>Block latex is now properly detected in editor when <code>$$</code> is on its own line.</li>\n<li>We fixed a trailing escaped character causing latex to not be detected in the editor.</li>\n<li>We fixed an issue where <code>Cmd-Z</code> does not undo the file name change.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":1,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":6,"day":10},"info":"<p>Just some quick bug fixes on the heels of 0.7.0, cleaning up a little.</p>\n<h2>Changes</h2>\n<ul>\n<li>We now allow <code>[File](file:///...)</code> links in preview.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Pressing <code>Tab</code> at the end of a file no longer causes the cursor to jump to another pane's file name.</li>\n<li>We fixed the editor pane scrollbar sometimes cannot be clicked on.</li>\n<li>We fixed renaming a file sometimes not updating starred file list, causing the file not found error.</li>\n<li>Pressing <code>Enter</code> while searching no longer causes it to jump to the next occurrence even if the cursor is in the document.</li>\n<li>We fixed the thing where the graph view's pane would blank out or duplicate when the pane was moved.</li>\n<li>We fixed editor selection sometimes having two different colors.</li>\n<li>The bug with <code>Cmd/Ctrl-[</code> and <code>]</code> not incrementing numbered lists correctly is now fixed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":7,"patch":0,"pre_release":null},"platform":"Desktop","insider":true,"date":{"year":2020,"month":6,"day":9},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>We've rebuilt the pane system entirely, adding lots of functionality and flexibility to the way you can interact with your notes:</li>\n<li>Panes can now be rearranged by dragging the icon in the top left of the pane. Dropping onto each of the four sides of an existing pane creates a horizontal or vertical split, dropping in the center swaps positions.</li>\n<li>Panes can now be moved to sidebars as well, and sidebars can be repositioned in the same way. A drop onto a the top or bottom of the sidebar will create a vertical split, a drop in the center creates a stack of tabs that can be switched between. (Before you ask, no, you can't easily rearrange tabs yet, we're working on that.)</li>\n<li>Panes can now be manually linked to another pane using an option in the more options menu (the three dots icon in the top right corner of the pane).</li>\n<li>You can now open backlinks for a specific file pane in the more options menu, which will be linked to just that file. There's also an option for it in the Command Palette.</li>\n<li>Depending on your settings, some sidebars may not show up initially in the new panel system (most notably Starred Files). If this happens, just disable and re-enable the plugin and they'll come back.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>We now default to &quot;Readable line length&quot;, so that things are more readable on wide screens. This can be turned off in Settings -&gt; Editor. And, yes, the exact width can be adjusted in custom CSS.</li>\n<li>The editor has a more noticeable tab delimiter.</li>\n<li>Contrast in dark mode default CSS has been adjusted for better readability.</li>\n<li>We had previously tried to add legacy fallback for graph view on older hardware. This time we actually did so.</li>\n<li>Custom CSS can now be enabled from Appearance tab. Community themes can also be accessed from there directly.</li>\n<li>We added a search filter on the hotkeys settings tab, because there are now lots of hotkeys.</li>\n<li>And we added a hotkey to open the help docs, <code>F1</code> by default.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>In Mac OS there was a bug that caused crashes when trying to record audio. We fixed that one, but:</li>\n<li>IMPORTANT: IF YOU ARE ON MAC OS YOU MUST RE-DOWNLOAD THE DMG INSTALLER for v0.7.0 or later AND RE-INSTALL for this bug to be fixed. If you don't care about audio recording, though, it shouldn't matter, the auto-update will still work. Re-installing will not affect your data in any way though, so there's no reason not to do it.</li>\n<li>There was a bug where malformed links would cause the app to go blank. Now it just doesn't work, as it shouldn't.</li>\n<li>A memory leak in graph view has been plugged.</li>\n<li>We fixed the bug where non-breaking spaces in filenames would cause unpleasant behavior.</li>\n<li>Relatedly, we fixed the bug where filenames with accented characters and CJK characters were causing trouble on MacOS. In summary: Unicode is weird.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":7,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":6,"day":2},"info":"<p>Mostly some quick bug fixes this time around.</p>\n<h2>Changes</h2>\n<ul>\n<li>More tags are now recognized. Previously tags could not start with a digit; now tags can start with a digit but must not be ALL digits (i.e. #365)</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Table justification got broken in 0.6.5 by the html sanitizer, it's not broken anymore.</li>\n<li>The html sanitizer also broke checkboxes not working in preview mode. We fixed that too.</li>\n<li>Hover tooltips were sometimes making a white bar show up at the bottom of the page. That should no longer be the case.</li>\n<li>Links that are <code>[[#section]]</code> will now properly link to headings in the same file. This will also work for <code>[link](#heading)</code>.</li>\n<li>We fixed a bug where sometimes navigating back wouldn't let you navigate forward again.</li>\n<li>And we also fixed a thing where navigating back would not save layout when closing/opening the app.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":6,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":6,"day":1},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>We added an option for deletions to use either 1) System trash, 2) local vault <code>.trash/</code> or 3) permanent delete like before. This means an extral layer of safety in case you accidentally delete a note. The default is System trash, but if the system trash is disabled, it will use <code>.trash/</code> by default.</li>\n<li>There are now several options for opening files in new panes! <code>Cmd/Ctrl-click</code> from the file explorer will do it. When using the quick switcher, <code>Cmd/Ctrl-Enter</code>will open the selection in a new pane.</li>\n<li>Relatedly, the quick switcher can use <code>Shift-Enter</code> to create a new note instead of opening the selected match, if you have names that are too similar. <code>Cmd/Ctrl-Shift-Enter</code> creates and opens in a new pane.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Clicking on search results and backlinks will now stay in preview mode and not force you to edit mode. It will also scroll and highlight in preview mode.</li>\n<li>We no longer allow choosing an inaccessible folder (like Program Files on Windows, or Applications on MacOS). This should solve a problem some Windows users had with having to run the application as an administrator, and will head off a bunch of other possible problems in the future.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Latex and code highlighting now work for embeds.</li>\n<li>Regular Markdown internal links are now properly indexed for graph view and backlinks. Renaming files also updates those if found.</li>\n<li>The Backlinks pane no longer shows empty when closing a pane (it previously should have shown the other pane's backlinks but instead showed nothing).</li>\n<li>We fixed some weird flicking scroll sync behavior introduced in 0.6.5. Sorry about that.</li>\n<li>We Fixed pressing Enter on title rename sometimes causing a newline to be entered into the source editor.</li>\n<li>And we fixed the fact that clicking on some footnotes didn't do anything. It will now navigate as it should have all along.</li>\n<li>You know the thing where when you renamed a file, another open file with a link to it would not have the link properly updated? That shouldn't happen anymore.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":5,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":29},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>Due to popular demand, we now have inline latex support! Didn't really expect that to be a popular demand, but, we have it!</li>\n<li>The Help docs are everywhere now! They're in the Vault chooser! They're in the Settings! They're in the native system menus! And they now have their own button, a question mark next to Settings! This is probably technically under &quot;Changes,&quot; but your docs writer is so excited about this that it goes under &quot;Shiny new things&quot;, sorry devs.</li>\n<li>We added an option to open in preview mode by default, with a customizable hotkey.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>We made significant speed improvement to file explorer and tag panes. Users with a large number of notes will be most likely to be able to tell the difference, but every little bit helps.</li>\n<li>There's also been significant speed improvements to large documents opening in preview mode.</li>\n<li>Help docs now appear in the default directory where applications store data (which varies by OS), not in your vault.</li>\n<li>Embedded attachment files no longer show up in Graph View. This should make navigating that significantly less noisy.</li>\n<li>We made a bunch of aesthetic improvements to Graph View. We set a maximum zoom level to avoid blurry text, adjusted the fade amount, and now only apply a color circle when highlighting. The Graph View will also fall back to canvas rendering for older computers.</li>\n<li>Now when you try to embed PDF, instead of nothing, you see a box with file name, and an icon to open it in your default app.</li>\n<li>In the Community Themes tab, there's a switch so you can choose to only see themes compatable to the mode you're in.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed various CSS related bugs where elements would superimpose, or otherwise get stuck on the left-most side of the editor when it's supposed to be indented.</li>\n<li>We fixed a CSS bug wherein the editor would sometimes not properly render nested styles.</li>\n<li>And we fixed the CSS so highlighted text in dark mode is no longer black, which was kind of the opposite of highlighting.</li>\n<li>Also, footnotes now render correctly. And your humble docs writer finally remembered that inline footnotes are a thing, so those are documented now.</li>\n<li>We fixed a rare issue where typing in nested lists caused linked panes to scroll down as you type.</li>\n<li>We fixed the Quick Switcher not saving newly opened files in &quot;recents&quot;.</li>\n<li>We fixed an issue with notes sometimes closing when edited in another program that uses atomic writes. This seemed to most affect vim users, but it should be fixed for everyone.</li>\n<li>We turned off spellchecker for filenames, because until we get spellchecker everywhere, that was just confusing.</li>\n<li>Sometimes creating a partial link before another link would cause autocomplete to add gibberish. That should no longer happen.</li>\n<li>The Home/End keys should go to a wrapped end of a line instead of the full line.</li>\n<li>Now when switching to preview mode while the link autosuggester is open, the autosuggester will no longer hang around uselessly.</li>\n<li>Sometimes the tag pane was empty for no reason. Now it will be as lush as it should be.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":4,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":24},"info":"<p>This is a small release to fix some bugs that made the Graph view unusable.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>There is now an &quot;Insider Build&quot; option. If you purchased a Catalyst license (any tier), you have access to early builds. The setting to turn this on is in Settings =&gt; About. Information on Catalyst licenses can be found <a href=\"https://obsidian.md/pricing\">on our website</a>.</li>\n<li>In the Graph view, hovering an item now shows the note name. This means that even when you zoom way out you can still see which notes are where without being overwhelmed.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>The Graph view will stop rendering when nothing on screen is changing. This probably won't make a difference to most people, but those of us with 2k+ notes will see a performance improvement.</li>\n<li>The Graph view now also includes embedded links.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>On the open Vault dialogue, deleting a Vault will now delete it, not open it as though to make you feel guilty for wanting to delete it.</li>\n<li><code>ctrl-b</code> will now no longer step on OS- level movement hotkeys.</li>\n<li>Sometimes you could click through a note to the Graph view behind. This turns out to be a very counterintuitive way of doing Random Note, and we stopped that from happening.</li>\n<li>The Graph view would render the names of nodes behind other notes, which made them hard to read. They are now out front where they belong.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":24},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The Graph View got some love. It should be much faster now, and zoomable!</li>\n<li><code>Ctrl/Cmd-click</code> on a node in the graph view now opens in a new pane.</li>\n<li>You can now choose where a file is created when a link to an empty file is clicked. It will be in the root folder of your vault by default, but you can choose somewhere else.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>There's a new UI for settings. Plugin Settings and Community Themes are now in their own separate section, and easier to find.</li>\n<li>You can now turn back off the &quot;Always update links&quot; setting if you want.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We unbroke the thing we broke where you couldn't click on a vault to choose it again. Clicks are meaningful again.</li>\n<li>Minor bugs squashed.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":22},"info":"<p>Just a quick bug fix because there was a potential for data loss. But, we couldn't help adding a new feature as well.</p>\n<h2>Shiny new things</h2>\n<ul>\n<li>There's now a Custom CSS picker that lets you choose from several community built themes. It's in Settings =&gt; Plugins, the gear next to the Custom CSS switch.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>There was a rare but dangerous bug wherein a race condition could cause two different autosaves to collide, resulting in blanking out a note. That should not happen any more.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":22},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The big news this release: We now support multiple vaults! You can now have windows open to different places, each with their own custom settings and CSS. Details on how to use this feature are in [[Work with multiple vaults]].</li>\n<li>Now when typing a link, if you press <code>|</code> (that's bar/pipe, not L or 1), it will autocomplete and allow you to start typing display text immediately.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Most of the changes this release are on the back end, working on new features.</li>\n<li>Because of the new Vault functionality, the dialogue to open new or existing vaults has been moved out of Settings into its own thing just above the Settings button.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We made a bunch of minor bug fixes and quality of life improvements. Things that were previously subtle or hidden in the interface are now revealed, tastefully. Places text could previously not be selected, are now selectable. Lines showing up in strange places are now replaced with informative text.</li>\n<li>Also we fixed a lot of typos in the docs. Plugins are no longer &quot;disabed&quot; by default.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":6,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":18},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>The big news: We've implemented linking to headings! Start typing a link like you would normally. Once you highlight the note you want from the list, press <code>#</code> instead of <code>Enter</code> and you'll see a list of headings in that file. Press <code>#</code> again for each subheading, and <code>Enter</code> to complete the link.</li>\n<li>Related to that, if you make a link with heading specified for an embed, it will show just that section in preview mode. The hover preview will also show just that section.</li>\n<li>The OTHER big news: You can now follow links with the keyboard. By default, follow the link under the cursor with <code>alt-Enter</code>, and open in a new panel with <code>Ctrl-alt-Enter</code>, but of course these are customizable in [[Keyboard shortcuts]].</li>\n<li>You can now now search AND replace, <code>Ctrl+H</code> by default.</li>\n<li>Daily notes now have the option of using a template note. Set this in the plug-in settings.</li>\n<li>We also added commands to toggle the left and right side bars. No hotkey set by default.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>Link suggestion now has fuzzy search. No more trying to remember what order words came in when you named that file.</li>\n<li>Both the link suggestion and the quick switcher highlight matches as you type. Yes the colors for these can be changed in CSS.</li>\n<li>When you use the Navigate Back command to return to a document, we now restore your scroll location and cursor selection.</li>\n<li>Markdown links with relative paths like <code>[link](../Note.md)</code>  now work. The path is relative to the file you're making the link in.</li>\n<li>Improved the [[Format your notes]] examples to include some of the lesser-used formats to satisfy certain CSS developers who shall remain nameless.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Long note titles are no longer truncated with ellipses, so you can actually see what you're typing when you edit them.</li>\n<li>Long headings are no longer compressed to unreadable in page preview.</li>\n<li>Star and Unstar commands are now a single toggle command.</li>\n<li>We fixed that weird table layout issue that would cause columns to resize poorly.</li>\n<li>We fixed starred notes not appearing after you delete one of them.</li>\n<li>In the sidebar, you can now close a removed pane after disabling a plugin.</li>\n<li>Linking an unlinked file no longer navigates to that file at the same time. If that makes no sense to you, you probably never saw the bug. Don't worry about it, it's fixed now.</li>\n<li>Graph view now runs a single instance in the background. This means you won't lag out the application by opening it multiple times.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":15},"info":"<p>A quick release to fix a couple of things.</p>\n<h2>Changes</h2>\n<ul>\n<li>The is the big one: we changed all <code>Shift+Click</code> to <code>Ctrl/Cmd+Click</code> to open in new pane. Update your muscle memory now!</li>\n<li>There is now an &quot;About&quot; page in the Settings that will tell you what version you're on.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>The Starred File plugin no longer halfway shows up when it's disabled.</li>\n<li>We remembered to put in the release notes this time!</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":15},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>There's a new plugin: starred files. Starred files will appear in a &quot;Starred&quot; section in the left panel.</li>\n<li>Another new plugin: Open random note. It does what it says!</li>\n<li>We've implemented highlighting for block math, surround it with <code>$$</code>. We also now show math in preview.</li>\n<li>There's now code highlighting for code fences with the language specified, i.e.<code> ```js</code>. Just add the language name after the first set of backticks.</li>\n<li>You can now view and embed webm/mp4/ogg videos and gifs.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>The default font is smaller.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed page preview getting stuck when switching between files.</li>\n<li>We also fixed backlinks not updating when switching between panes.</li>\n<li>Unlinked mentions no longer include the current file. Inception avoided.</li>\n<li>Search in files now shows matches for filenames as well as content.</li>\n<li>We fixed some file name conflict issues, which had the danger of overwriting extant files.</li>\n<li>And we fiixed sometimes not being able to delete an empty folder.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":13},"info":"<h2>Shiny new things</h2>\n<ul>\n<li>You can now make custom hotkeys in settings.</li>\n<li>There are now new commands in the Command Palette for toggle preview, splitting panes, open settings, and more.</li>\n<li>The file explorer now has a &quot;make a copy&quot; option in the file menu.</li>\n<li>For the Daily Note and the ZK prefixer, you can now set the folder path to save to.</li>\n<li>You can also now change the date format for the Daily Note.</li>\n<li>The ZK Prefixer will now automatically increment the minute if the file already exists.</li>\n<li>The editor now has an option to show line numbers, which is helpful for vim mode.</li>\n<li>Footnotes now work in preview.</li>\n</ul>\n<h2>Changes</h2>\n<ul>\n<li>In the Graph View, now hovering the circle will highlight the node (it used to only highlight when hovering file name).</li>\n<li>The external link icon in preview is back.</li>\n<li>Clicking on a backlink match now jumps to the matched line.</li>\n<li>We now keep scroll location when toggling between editor and preview.</li>\n<li>When doing a Roam import, we now convert Roam {{[[TODO]]}} and {{[[DONE]]}} to Markdown checkboxes.</li>\n<li>The editor now uses variable-width font instead of monospace by default (you can use custom css to do monospace if you prefer).</li>\n<li>We changed the multi-cursor trigger from <code>ctrl+click</code> to <code>ctrl+alt+click</code> so it doesn't surprise people.</li>\n<li>Search now wraps lines at end of word instead of character.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>We fixed heading folding getting reset when clicking on the editor.</li>\n<li>Load speed is now drastically increased for large vaults.</li>\n<li>New folder placeholder name no longer show up as &quot;[object Object] Untitled&quot;.</li>\n<li>Horizontal split no longer causes an extra empty pane to open vertically on the left.</li>\n<li>Long urls now properly wrap rather than taking up their own line.</li>\n<li>We fixed internal links not being clickable in editor if it's the first thing in a list item.</li>\n<li>Things like [[]] no longer highlight everything behind it in the editor.</li>\n<li>Things between dollar signs like $text$ no longer get highlighted.</li>\n<li>Similarly, an arrow ==&gt; is now recognized as not a highlight.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":5,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":10},"info":"<h2>Shiny new things</h2>\n<ul>\n<li><strong>Open multiple files side by side</strong>. See how you can now work with multiple notes.</li>\n<li><strong>New Markdown editor</strong>!\n<ul>\n<li>You can now use <code>Ctrl+B</code> and <code>Ctrl+I</code> to bold and italicize selected text.</li>\n<li>List markers (including task list) are created for you when you press <code>Enter</code>.</li>\n<li>You can now fold headings and lists.</li>\n<li>Brackets and Markdown syntax are now auto-paired for you.</li>\n</ul>\n</li>\n<li><strong>Sort files</strong> in file explorer. You can sort by both file name and last modified time.</li>\n<li>Search within file. <code>Ctrl+F</code> to open the search, and use <code>F3</code> to jump to next match, or <code>Shift+F3</code> to the previous match. <code>Esc</code> to exit search.</li>\n<li>Improved search performance for large vaults. Stress-tested with 10,000 Markdown files.</li>\n<li><code>Ctrl+Shift+F</code> to jump straight to search. Start typing right away!</li>\n<li>New plugin: <strong>Zettelkasten prefixer</strong>.</li>\n<li>New plugin: <strong>Daily notes</strong>.</li>\n<li>Better onboarding! You can now create an emty vault if you don't have one, and import the help docs (yes, this folder) to your vault.</li>\n<li>Obsidian now auto-updates to the newest version on restart.</li>\n<li><code>obsidian.css</code> will now be live loaded and changes are reflected in real time, hopefully making it faster to make CSS themes!</li>\n</ul>\n<h2>Changes</h2>\n<p>There are some changes we've made to Obsidian. Might take some time to get used to -- but we think it's for the better!</p>\n<ul>\n<li>By default, the 2-pane preview layout is gone. If you want to restore to that view, <code>Shift+Click</code> the preview button on the title bar. <code>Click</code> will turn the current view into preview.</li>\n<li>Note title bar is now much smaller, allow you to see more text (and longer titles)! It's especially nice when you work with multiple notes.</li>\n<li>We removed back and forward navigation buttons now that you can have multiple files open. You can still use the shortcuts (<code>Ctrl/Cmd+Alt+Left/Right</code>) to navigate though.</li>\n<li>Plugin list is moved into settings. You don't need to access it that often anyway.</li>\n<li>Action buttons like graph view and quick switcher are moved to the top, leaving only settings at the bottom.</li>\n</ul>\n<h2>No longer broken</h2>\n<ul>\n<li>Fixed Markdown formatting in task list items will break preview.</li>\n<li>Fixed nested task lists not working.</li>\n<li>Fixed cannot delete empty folders.</li>\n<li>Fixed adding duplicate file extensions (e.g. <code>.png</code> when dropping file into another folder).</li>\n<li>Fixed a single &quot;#&quot; being recognized as a tag.</li>\n<li>Subfolder changes are now watched recursively on Linux.</li>\n<li>Fixed files and folders that start with <code>.</code> were not ignored, e.g. <code>.git</code> or <code>.gitignore</code>.</li>\n<li>Fixed window size not preserved across sessions.</li>\n<li>Fixed multiple audio recorder icons appear when you repeatedly enable and disable the plugin.</li>\n<li>Removed Electron help menu items.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":4,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":5,"day":4},"info":"<ul>\n<li>Layout: you can now resize the left and right panels.</li>\n<li>File explorer: you can now set a folder as the &quot;attachment folder&quot;. Further pasted images, dropped images, and recorded audio files will be stored here.</li>\n<li>Command palette: show all available commands when no search query is entered.</li>\n<li>Command palette: enable plugin by default.</li>\n<li>Attachments: now <code>.jpeg</code> files are also supported.</li>\n<li>File explorer: more compact layout to fit more content. Long file names will not wrap; a tooltip with its full name will appear.</li>\n<li>Quick switcher: you can now create files by typing its name into the switcher. You can even type in <code>Folder/Page</code> to create <code>Page.md</code> under <code>Folder</code>. But for now <code>Folder</code> might exist under vault for this to work.</li>\n<li>Internal link: add warning about existing links when deleting a file.</li>\n<li>Search &amp; backlinks: longer context around the matched text.</li>\n<li>File explorer: fix renaming <code>Example</code> to <code>example</code> will cause duplicate files to show up in Windows.</li>\n<li>Embed files: fix having one embedded file hides everything  that comes after it in that paragraph.</li>\n<li>Task list: fix formatting in the task item will render the item twice in preview.</li>\n<li>Link suggestion: fix folder name not getting searched.</li>\n<li>Link: fix custom scheme URLs like <code>x-devonthink://</code> not working.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":4,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":27},"info":"<h3>Shiny new things</h3>\n<ul>\n<li>Command palette. Access commands by typing!</li>\n<li>Backlinks: links are now updated when you rename a file, either from the title bar or from the file explorer.</li>\n<li>Backlinks: hover over an unlinked mention, and you'll get the option to link that mention and turn it into a proper [[Internal link]].</li>\n<li>Navigation: go backward/forward. Added as buttons to the title bar, and you can also access it via command palette and shortcuts (<code>Ctrl+Alt+Left/Right</code>).</li>\n<li>Editor: read mode. Accessible via command palette (type &quot;trm&quot; to find it).</li>\n<li>Quick switcher &amp; command palette: they now support fuzzy search.</li>\n</ul>\n<h3>No longer broken</h3>\n<ul>\n<li>Editor: fix <code>Ctrl+click</code> doesn't create new note.</li>\n<li>Editor: fix unreadable Markdown and white cursor bug.</li>\n<li>If you've moved the vault, instead of refusing to work the app now prompts for another location.</li>\n<li>Graph view fix links that end in <code>.md</code> would break the graph.</li>\n<li>Backlinks: fix unlinked mentions need a space after it in order to match.</li>\n<li>Backlinks: fix <code>[[Page title|Display]]</code> showing up as unlinked mentions instead of links.</li>\n<li>Backlinks: fix full file path like <code>[[Folder/Sub-folder/Page]]</code> not showing up as links.</li>\n<li>Custom CSS: fix cannot disable the plugin if <code>obsidian.css</code> is not present.</li>\n<li>Quick switcher: fix issue where navigating to &quot;Page name&quot; would wipe it if there's a folder called the same name in the same directory.</li>\n<li>Fix line wrapping issues in title bar, embeds, and Backlinks panel.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":3,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":21},"info":"<ul>\n<li>Tag: tags are now supported, with auto-complete support.</li>\n<li>Tag pane plugin, displays all the tags sorted by number of occurrences.</li>\n<li>Format: checkboxes (task list in GitHub flavored Markdown) is now supported.</li>\n<li>Page preview: hover a link in preview to see its content without going there. Ctrl+hover to activate in editor. Disabled by default.</li>\n<li>New plugin: custom CSS. Uses <code>obsidian.css</code> in the vault root if present.</li>\n<li>New plugin: button to open file with default app.</li>\n<li>Graph view: links and neighboring nodes are highlighted when hovering a node, while other nodes are faded out.</li>\n<li>Graph view: better connected nodes now appear bigger.</li>\n<li>Quick switcher: show most recent files when no search is entered.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":2,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":13},"info":"<ul>\n<li>Backlinks: show unlinked mentions as well.</li>\n<li>Preview: support embed Markdown files as well (with <code>![[page name]]</code>).</li>\n<li>Link: an extra click is no longer required to create a new note.</li>\n<li>Link: links to non-existent files are no longer red.</li>\n<li>Link: click an internal link while holding Ctrl or Cmd to follow it.</li>\n<li>Graph: fix previous note title still showing after switching to graph view.</li>\n<li>Slides: fix tables not working in presentation view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":10},"info":"<ul>\n<li>Plugin: backlinks. Show number of backlinks for the current file in status bar.</li>\n<li>Plugin: word count. Show word current of current file.</li>\n<li>Preview pane is now collapsible.</li>\n<li>Light mode.</li>\n<li>Graph view: you can now drag your mouse to pan.</li>\n<li>Copy paste: support pasting in clipboard images (e.g. screenshots).</li>\n<li>Copy paste: support pasting in local images on your hard drive (will be copied to vault folder).</li>\n<li>Copy paste: support pasting in images from your browser (will be downloaded to vault folder).</li>\n<li>Drag-and-drop: support drag and drop images from browser.</li>\n<li>Drag-and-drop: support drag and drop images from other folders (will be copied to vault folder).</li>\n<li>Link: fixed internal links not recognized on app start.</li>\n<li>File explorer: file deletion now asks for confirmation.</li>\n<li>File explorer: now you can move files into the vault folder for organization.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":5},"info":"<ul>\n<li>Linux version first release.</li>\n<li>Slides plugin: use <code>---</code> to separate your slides and start presenting right away.</li>\n<li>Audio recorder plugin: record audio and save as attachment (it gets automatically appended to the end of your current file).</li>\n<li>If you have a file at <code>Folder/Another folder/My note.md</code> and &quot;My note&quot; is a unique name, <code>[[My note]]</code> and <code>[[my note]]</code> internal links will now resolve. It used to be that only the complete link will be resolved.</li>\n<li>Last opened tab and plugin enabled status are now saved in config.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":2},"info":"<ul>\n<li>Graph view: navigate to file when clicking on a node.</li>\n<li>Graph view: collision detection to avoid overlap.</li>\n<li>Graph view: allow scroll to see the entire picture.</li>\n<li>Graph view: better link placement.</li>\n<li>Graph view: scroll to center on load.</li>\n<li>Graph view: visually distinguish non-existent linked nodes.</li>\n<li>Graph view: hide orphan nodes for now.</li>\n<li>App: fix app loads at a small fixed size.</li>\n<li>App: fix developer tools being visible when app first loads.</li>\n<li>Explorer: warn about duplicate file names when renaming.</li>\n<li>Explorer: warn about forbidden characters in file names.</li>\n<li>Sidebar: sidebar title should not be select-able.</li>\n<li>Sidebar: click current tab again to collapse.</li>\n<li>Sidebar: add collapse button to each panel.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":3,"day":30},"info":"<p>Initial release.</p>\n<p>Notable features include:</p>\n<ul>\n<li>Choose vault and list all the compatible files.</li>\n<li>[[Internal link]] with auto-complete.</li>\n<li>Image (<code>.png</code>) and audio (<code>.mp3</code>) file embed with <code>![[filename.png]]</code> [[embedding]] syntax.</li>\n<li>Plugin system.</li>\n</ul>\n","major_release":false}]