[{"version":{"major":0,"minor":2,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":13},"info":"<ul>\n<li>Backlinks: show unlinked mentions as well.</li>\n<li>Preview: support embed Markdown files as well (with <code>![[page name]]</code>).</li>\n<li>Link: an extra click is no longer required to create a new note.</li>\n<li>Link: links to non-existent files are no longer red.</li>\n<li>Link: click an internal link while holding Ctrl or Cmd to follow it.</li>\n<li>Graph: fix previous note title still showing after switching to graph view.</li>\n<li>Slides: fix tables not working in presentation view.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":1,"patch":0,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":10},"info":"<ul>\n<li>Plugin: backlinks. Show number of backlinks for the current file in status bar.</li>\n<li>Plugin: word count. Show word current of current file.</li>\n<li>Preview pane is now collapsible.</li>\n<li>Light mode.</li>\n<li>Graph view: you can now drag your mouse to pan.</li>\n<li>Copy paste: support pasting in clipboard images (e.g. screenshots).</li>\n<li>Copy paste: support pasting in local images on your hard drive (will be copied to vault folder).</li>\n<li>Copy paste: support pasting in images from your browser (will be downloaded to vault folder).</li>\n<li>Drag-and-drop: support drag and drop images from browser.</li>\n<li>Drag-and-drop: support drag and drop images from other folders (will be copied to vault folder).</li>\n<li>Link: fixed internal links not recognized on app start.</li>\n<li>File explorer: file deletion now asks for confirmation.</li>\n<li>File explorer: now you can move files into the vault folder for organization.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":3,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":5},"info":"<ul>\n<li>Linux version first release.</li>\n<li>Slides plugin: use <code>---</code> to separate your slides and start presenting right away.</li>\n<li>Audio recorder plugin: record audio and save as attachment (it gets automatically appended to the end of your current file).</li>\n<li>If you have a file at <code>Folder/Another folder/My note.md</code> and &quot;My note&quot; is a unique name, <code>[[My note]]</code> and <code>[[my note]]</code> internal links will now resolve. It used to be that only the complete link will be resolved.</li>\n<li>Last opened tab and plugin enabled status are now saved in config.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":2,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":4,"day":2},"info":"<ul>\n<li>Graph view: navigate to file when clicking on a node.</li>\n<li>Graph view: collision detection to avoid overlap.</li>\n<li>Graph view: allow scroll to see the entire picture.</li>\n<li>Graph view: better link placement.</li>\n<li>Graph view: scroll to center on load.</li>\n<li>Graph view: visually distinguish non-existent linked nodes.</li>\n<li>Graph view: hide orphan nodes for now.</li>\n<li>App: fix app loads at a small fixed size.</li>\n<li>App: fix developer tools being visible when app first loads.</li>\n<li>Explorer: warn about duplicate file names when renaming.</li>\n<li>Explorer: warn about forbidden characters in file names.</li>\n<li>Sidebar: sidebar title should not be select-able.</li>\n<li>Sidebar: click current tab again to collapse.</li>\n<li>Sidebar: add collapse button to each panel.</li>\n</ul>\n","major_release":false},{"version":{"major":0,"minor":0,"patch":1,"pre_release":null},"platform":"Desktop","insider":false,"date":{"year":2020,"month":3,"day":30},"info":"<p>Initial release.</p>\n<p>Notable features include:</p>\n<ul>\n<li>Choose vault and list all the compatible files.</li>\n<li>[[Internal link]] with auto-complete.</li>\n<li>Image (<code>.png</code>) and audio (<code>.mp3</code>) file embed with <code>![[filename.png]]</code> [[embedding]] syntax.</li>\n<li>Plugin system.</li>\n</ul>\n","major_release":false}]